{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/israel-attacks-yemens-hodeidah-houthi-interior-ministry-says/", "title": "IDF issues ‘urgent’ evacuation warning for three Houthi-controlled ports in Yemen", "media_type": "article", "date": "Today, 10:38 pm", "content": "The Israel Defense Forces on Sunday evening issued an “urgent” evacuation warning to the three Houthi-controlled ports in western Yemen, ahead of potential Israeli strikes.\nThe warning came after the Houthis fired several ballistic missiles and drones at Israel in recent days, since the Israeli Air Force struck the Houthi-controlled airport in Sanaa and several other facilities last week in response to a Houthi ballistic missile that impacted inside the grounds of Ben Gurion Airport last Sunday.\nIn a post on X, the IDF’s Arabic-language spokesman Col. Avichay Adraee warned those at the Ras Isa, Hodeidah, and Salif ports on the western coast to evacuate.\n“Due to the Houthi terror regime’s use of ports for its terror activities, we urge all those present at these ports to evacuate and stay away from them for your own safety until further notice,” he said.\nA report by Reuters, citing the Houthi interior ministry, claimed that Israel targeted Hodeidah port following the warning. Israeli military sources said no strikes had been carried out as of Sunday night. There were no reports in Houthi media of strikes either.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nOn Friday afternoon, the Houthis fired a ballistic missile that triggered sirens across central Israel. The IDF reported that the missile was successfully intercepted by air defenses.\nDefense Minister Israel Katz warned then that Israel would respond. “The Houthis continue to launch Iranian missiles at Israel. As we promised, we will respond, strongly in Yemen and anywhere else necessary,” he said in a statement.\nThe Friday attack came three days after the US announced that it had reached a ceasefire with the Yemeni terror group.\nHouthi officials made clear that the deal, in which they agreed to stop targeting US maritime activity in the Red Sea in exchange for an end to weeks of intense US airstrikes, did not include any agreement to stop firing at Israel or ships linked to the Jewish state.\nOn Wednesday, the IDF said a missile fired by the Houthis crashed outside Israeli territory. Earlier in the day, the IDF said it had downed a drone launched from Yemen.\nADVERTISEMENT\nThe attacks came after Israel carried out two days of heavy sorties targeting infrastructure controlled by the Houthis in response to the missile that struck Ben Gurion Airport. Since Ben Gurion was hit, most foreign airlines have suspended flights to Israel.\nThe fiery reprisals destroyed the international airport in the capital Sanaa, and caused heavy damage to a port in Hodeida and several power stations and a cement factory, officials said.\nThe Houthis — whose slogan calls for “Death to America, Death to Israel, [and] a Curse on the Jews” — first began attacking Israel and maritime traffic in November 2023, a month after the October 7 Hamas massacre.\nThe Houthis held their fire when a ceasefire was reached between Israel and Hamas in January 2025. By that point, they had fired over 40 ballistic missiles and dozens of attack drones and cruise missiles at Israel, including one that killed a civilian and wounded several others in Tel Aviv in July, prompting Israel’s first strike in Yemen.\nSince March 18, when the IDF resumed its offensive against Hamas in the Gaza Strip, the Houthis have launched some 29 ballistic missiles and at least 10 drones at Israel.\nThe sirens warning of missile attacks have sent hundreds of thousands of Israelis rushing to shelters at all hours of the day and night."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/body-of-soldier-zvi-feldman-missing-for-43-years-recovered-by-mossad-and-idf/", "title": "Body of soldier Zvi Feldman, missing for 43 years, recovered from Syria by Mossad, IDF", "media_type": "article", "date": "Today, 11:14 am", "content": "The Mossad spy agency and the Israel Defense Forces recovered the remains of Sgt. First Class Zvi Feldman, who went missing in the First Lebanon War’s battle of Sultan Yacoub in 1982, officials announced on Sunday.\nThe battle, nearly 43 years ago, was a skirmish between the IDF and the Syrian army in Lebanon’s Beqaa Valley. It claimed the lives of 21 Israeli servicemen, and more than 30 were injured during it.\nFeldman, a tank soldier, went missing during the battle along with Sgt. First Class Yehuda Katz and Sgt. First Class Zachary Baumel. Baumel’s remains were recovered and returned to Israel in 2019.\nIn a joint statement on Sunday, the Mossad and IDF said the body of Feldman was recovered from “the heart of Syria” in a special operation.\nThey said the “complex and covert operation” was made possible by “precise intelligence” and other capabilities, including “intelligence research and collection efforts and many activities and operations in enemy territory.”\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nThe military said the efforts to locate the body had been ongoing for decades.\nThis image released by the IDF on May 11, 2025, shows troops carrying a coffin containing the remains of Sgt. First Class Zvi Feldman, who went missing in 1982. (Israel Defense Forces)\nDefense officials said the operation to recover the remains was carried out by non-Israeli Mossad agents. The team operated deep inside Syria, dozens of kilometers from the Israeli border, to retrieve the body, while risking their lives.\nThe agents, operating on behalf of Mossad, had a cover story and had been inside Syria for several years. In the past five months, following the fall of the Bashar al-Assad regime, there were breakthroughs in the case and an opportunity to recover Feldman’s remains, the officials said.\nADVERTISEMENT\nOfficials said the team operated “under fire” during the mission, as they visited a graveyard several times, obtaining various findings that were sent to Israel for identification. Eventually findings matched Feldman’s DNA.\nThe team also found the tank soldier’s overalls, which were identified by the head of the Intelligence Directorate’s missing persons unit, who himself served in the Armored Corps in his youth.\nPrime Minister Benjamin Netanyahu informs relatives of Sgt. First Class Zvi Feldman that his body was recovered, May 11, 2025 (Kobi Gideon/GPO)\nThe remains belonging to Feldman — which were in a complex state due to the passage of time — and his overalls were brought to Israel for identification some two weeks ago. Feldman’s family was notified early Sunday once the identification process was completed.\nA video released by the IDF on Sunday showed the moment the remains were returned to Israel. The clip showed a coffin draped in an Israeli flag, as troops recited the mourner’s Kaddish, the Jewish prayer for the dead.\nThis video released by the IDF on May 11, 2025, shows troops reciting the Jewish prayer for the dead upon receiving the remains of Sgt. First Class Zvi Feldman, who went missing in 1982. (Israel Defense Forces)\n“For decades, Zvika was missing, and the efforts to locate him, along with the other missing soldiers from that same battle, never ceased for a moment,” Prime Minister Benjamin Netanyahu said in a statement.\nThe Mossad, IDF, Netanyahu, and Defense Minister Israel Katz all said Israel would not stop its efforts until the remains of Katz are also returned.\nADVERTISEMENT\n“Just as we returned Zachary Baumel, and today Zvi Feldman, we continue to act in every way to also return Sgt. First Class Yehuda Katz and fulfill our duty for him and his family,” the defense minister said.\nFrom left: Zachary Baumel, Yehuda Katz and Zvi Feldman (Courtesy)\nBaumel’s body was recovered with Russian assistance from the Yarmouk refugee camp, home to one of the largest Palestinian communities in Syria. In 2016, an Israeli tank lost in the battle was returned to Israel by Russia.\nThe IDF has been deployed to nine posts inside southern Syria since the fall of the Bashar al-Assad regime in December, mostly within a UN-patrolled buffer zone on the border between the countries.\nTroops have been operating in areas up to around 15 kilometers (9 miles) deep into Syria, aiming to capture weapons that Israel says could pose a threat to the country if they fall into the hands of “hostile forces.”\nThe Hostages Forum, which represents the majority of relatives of those held captive in Gaza, welcomes the return of Feldman’s body, while calling for the return of the remaining hostages, living and dead.\nIsraeli soldiers carry the coffin of Zachary Baumel at the Mount Herzl Military cemetery in Jerusalem on April 4, 2019. (Hadas Parush/Flash90)\n“The families of the hostages would like to extend a big hug to the Feldman family and to every family that is privileged to bring their loved one to burial,” the forum said in a statement.\n“The return of Zvi Feldman is a moral, ethical and national reminder to the prime minister and members of the government — a grave is not a privilege, but a basic duty of the state to its citizens and fighters. In Israel, no one is left behind,” it said.\n“As a society, we must not normalize a situation in which families have to wait over 40 years or more to be reunited with their loved ones,” it said.\nTerror groups in the Gaza Strip are holding 59 hostages, including 58 of the 251 abducted by Hamas-led terrorists on October 7, 2023. They include the bodies of at least 35 confirmed dead by the IDF, one of whom is a soldier killed a decade ago. Israel has said there are grave concerns for the lives of a further three."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/purge-of-hezbollah-from-beirut-airport-satisfying-israeli-us-officials-report/", "title": "Purge of Hezbollah from Beirut airport satisfying Israeli, US officials — report", "media_type": "article", "date": "Today, 12:28 pm", "content": "Lebanon has conducted a major overhaul of security at its sole international airport, in Beirut, to prevent smuggling by Hezbollah, satisfying Israeli and US officials and giving them hope that the government will take full control over the country’s ports of entry from the terror group, according to a new report.\nAirport staff linked to Hezbollah have been fired, smugglers have been detained, and new surveillance mechanisms using AI are being deployed at Rafik Hariri International Airport, which is situated in an area of southern Beirut that is controlled by the Iran-backed terror group, The Wall Street Journal reported Saturday.\nIn one recent achievement, Lebanese security thwarted an attempt to smuggle over 22 kilograms (50 pounds) of gold to Hezbollah through the airport, a senior security official told the newspaper.\n“You can feel the difference,” Lebanese Prime Minister Nawaf Salam said. “We’re doing better on smuggling for the first time in the contemporary history of Lebanon.”\nSalam, who was appointed by Lebanon’s new president in January, was also cited as saying that Hezbollah had tried to block plans to construct a second airport for commercial and cargo flights in an area outside the terror group’s control, near the Syrian border in northern Lebanon. The second airport could also serve as an alternative should the Beirut airport be shuttered due to Israeli attacks on Hezbollah targets there, the newspaper said.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nWhile Israeli and US officials reportedly felt there was still work to be done in Lebanon, a senior US official told the newspaper that “there is reason for hope here.”\nA Lebanese army officer shows Lebanese Prime Minister Nawaf Salam, center, an Israeli military position on the horizon, in the southern village of Khiam, February 28, 2025. (Rabih Daher / AFP)\nThe official, who works for the mechanism overseeing the implementation of the November 27 Israel-Hezbollah ceasefire agreement, said “it has only been six or seven months, and we have stepped to a place that I am not sure I thought was achievable back in November.”\nSenior Lebanese security and military officials cited by the Journal said no planes are now exempt from security checks, while flights from Iran have been suspended since February.\nADVERTISEMENT\nThe suspension, triggered by an IDF claim that Iran was smuggling cash to Hezbollah aboard civilian flights, set off massive riots by supporters of the terror group who demanded Iranian flights be let in. At one point, rioters attacked a convoy led by a top officer from the international peacekeeping force UNIFIL, wounding him.\nMeanwhile, the IDF has continued to target Hezbollah operatives and arms caches in southern Lebanon, and maintains some posts in the region after withdrawing from most of it in February.\nThe terror group was required to vacate the area under the November 27 ceasefire agreement, to be replaced by Lebanon’s military and UNIFIL. Last month, an official said the Lebanese military had dismantled over 90% of Hezbollah’s infrastructure near the border with Israel.\nFire from burning tires burns as Hezbollah supporters face off with Lebanese soldiers during a Hezbollah-organized riot to block the road to the airport in Beirut, Lebanon, February 15, 2025. (Ibrahim Amro / AFP)\nIbrahim Mousawi, a Hezbollah member of Lebanon’s parliament, told the Journal that while the terror group sustained heavy losses, it had ways to rearm, saying, “Where there is a will, there is a way.” He also said allegations that Hezbollah controlled the airport were exaggerated: “We are part of the system, just like any other Lebanese constituency.”\nHowever, Lebanon’s former deputy prime minister Ghassan Hasbani said the airport had been “a main port of entry for supporting whatever para-state activities were happening.”\nHasbani, who now represents an anti-Hezbollah bloc in the Lebanese parliament, said authorities had turned “a purposeful blind eye” to the terror group’s use of the Beirut airport. “In the absence of international attention and pressure to do something about it, nothing much was done.”\nADVERTISEMENT\nHezbollah’s standing in domestic politics has taken a blow in the wake of the fighting that began when the terror group attacked Israel on October 8, 2023 — a day after fellow Iran-backed group Hamas stormed southern Israel to kill some 1,200 people and take 251 hostages, sparking the war in Gaza.\nSome 60,000 residents of northern Israel were displaced by Hezbollah’s near-daily attacks. In a bid to secure the residents’ return, the IDF stepped up operations in Lebanon in September, decimating Hezbollah’s leadership.\nView of a large fire caused by rockets fired from Lebanon, in the northern town of Kiryat Shmona, June 3, 2024. (Ayal Margolin/Flash90)\nThe fighting killed thousands of people, according to Lebanon’s health ministry, which does not distinguish between combatants and civilians. The IDF estimated it had killed some 3,500 Hezbollah operatives.\nHezbollah also took a hit with the ouster in December of its powerful ally in Syria, the Iran-backed president Bashar al-Assad. The ouster cut off a land route for arms smuggling from Iran to Lebanon.\nIn January, Lebanon’s parliament elected US-backed President Joseph Aoun, ending a two-year vacancy in the post. Aoun, previously the commander of Lebanon’s armed forces, has vowed to maintain a state monopoly on arms — a veiled threat against Hezbollah, the only armed group not to surrender its arms to the Lebanese state when the country’s 15-year civil war ended in 1990. Aoun has also demanded that Israel vacate its remaining posts in southern Lebanon."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/israel-attacks-yemens-hodeidah-houthi-interior-ministry-says/", "title": "IDF issues ‘urgent’ evacuation warning for three Houthi-controlled ports in Yemen", "media_type": "article", "date": "11 May 2025, 10:38 pm", "content": "The Israel Defense Forces on Sunday evening issued an “urgent” evacuation warning to the three Houthi-controlled ports in western Yemen, ahead of potential Israeli strikes.\nThe warning came after the Houthis fired several ballistic missiles and drones at Israel in recent days, since the Israeli Air Force struck the Houthi-controlled airport in Sanaa and several other facilities last week in response to a Houthi ballistic missile that impacted inside the grounds of Ben Gurion Airport last Sunday.\nIn a post on X, the IDF’s Arabic-language spokesman Col. Avichay Adraee warned those at the Ras Isa, Hodeidah, and Salif ports on the western coast to evacuate.\n00:00 / 23:33\n“Due to the Houthi terror regime’s use of ports for its terror activities, we urge all those present at these ports to evacuate and stay away from them for your own safety until further notice,” he said.\nA report by Reuters, citing the Houthi interior ministry, claimed that Israel targeted Hodeidah port following the warning. Israeli military sources said no strikes had been carried out as of Sunday night. There were no reports in Houthi media of strikes either.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nOn Friday afternoon, the Houthis fired a ballistic missile that triggered sirens across central Israel. The IDF reported that the missile was successfully intercepted by air defenses.\nDefense Minister Israel Katz warned then that Israel would respond. “The Houthis continue to launch Iranian missiles at Israel. As we promised, we will respond, strongly in Yemen and anywhere else necessary,” he said in a statement.\nThe Friday attack came three days after the US announced that it had reached a ceasefire with the Yemeni terror group.\nHouthi officials made clear that the deal, in which they agreed to stop targeting US maritime activity in the Red Sea in exchange for an end to weeks of intense US airstrikes, did not include any agreement to stop firing at Israel or ships linked to the Jewish state.\nOn Wednesday, the IDF said a missile fired by the Houthis crashed outside Israeli territory. Earlier in the day, the IDF said it had downed a drone launched from Yemen.\nADVERTISEMENT\nThe attacks came after Israel carried out two days of heavy sorties targeting infrastructure controlled by the Houthis in response to the missile that struck Ben Gurion Airport. Since Ben Gurion was hit, most foreign airlines have suspended flights to Israel.\nThe fiery reprisals destroyed the international airport in the capital Sanaa, and caused heavy damage to a port in Hodeida and several power stations and a cement factory, officials said.\nThe Houthis — whose slogan calls for “Death to America, Death to Israel, [and] a Curse on the Jews” — first began attacking Israel and maritime traffic in November 2023, a month after the October 7 Hamas massacre.\nThe Houthis held their fire when a ceasefire was reached between Israel and Hamas in January 2025. By that point, they had fired over 40 ballistic missiles and dozens of attack drones and cruise missiles at Israel, including one that killed a civilian and wounded several others in Tel Aviv in July, prompting Israel’s first strike in Yemen.\nSince March 18, when the IDF resumed its offensive against Hamas in the Gaza Strip, the Houthis have launched some 29 ballistic missiles and at least 10 drones at Israel.\nThe sirens warning of missile attacks have sent hundreds of thousands of Israelis rushing to shelters at all hours of the day and night."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/body-of-soldier-zvi-feldman-missing-for-43-years-recovered-by-mossad-and-idf/", "title": "Body of soldier Zvi Feldman, missing for 43 years, recovered from Syria by Mossad, IDF", "media_type": "article", "date": "11 May 2025, 11:14 am", "content": "The Mossad spy agency and the Israel Defense Forces recovered the remains of Sgt. First Class Zvi Feldman, who went missing in the First Lebanon War’s battle of Sultan Yacoub in 1982, officials announced on Sunday.\nThe battle, nearly 43 years ago, was a skirmish between the IDF and the Syrian army in Lebanon’s Beqaa Valley. It claimed the lives of 21 Israeli servicemen, and more than 30 were injured during it.\nFeldman, a tank soldier, went missing during the battle along with Sgt. First Class Yehuda Katz and Sgt. First Class Zachary Baumel. Baumel’s remains were recovered and returned to Israel in 2019.\nIn a joint statement on Sunday, the Mossad and IDF said the body of Feldman was recovered from “the heart of Syria” in a special operation.\nThey said the “complex and covert operation” was made possible by “precise intelligence” and other capabilities, including “intelligence research and collection efforts and many activities and operations in enemy territory.”\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nThe military said the efforts to locate the body had been ongoing for decades.\nThis image released by the IDF on May 11, 2025, shows troops carrying a coffin containing the remains of Sgt. First Class Zvi Feldman, who went missing in 1982. (Israel Defense Forces)\nDefense officials said the operation to recover the remains was carried out by non-Israeli Mossad agents. The team operated deep inside Syria, dozens of kilometers from the Israeli border, to retrieve the body, while risking their lives.\nThe agents, operating on behalf of Mossad, had a cover story and had been inside Syria for several years. In the past five months, following the fall of the Bashar al-Assad regime, there were breakthroughs in the case and an opportunity to recover Feldman’s remains, the officials said.\nADVERTISEMENT\nOfficials said the team operated “under fire” during the mission, as they visited a graveyard several times, obtaining various findings that were sent to Israel for identification. Eventually findings matched Feldman’s DNA.\nThe team also found the tank soldier’s overalls, which were identified by the head of the Intelligence Directorate’s missing persons unit, who himself served in the Armored Corps in his youth.\nPrime Minister Benjamin Netanyahu informs relatives of Sgt. First Class Zvi Feldman that his body was recovered, May 11, 2025 (Kobi Gideon/GPO)\nThe remains belonging to Feldman — which were in a complex state due to the passage of time — and his overalls were brought to Israel for identification some two weeks ago. Feldman’s family was notified early Sunday once the identification process was completed.\nA video released by the IDF on Sunday showed the moment the remains were returned to Israel. The clip showed a coffin draped in an Israeli flag, as troops recited the mourner’s Kaddish, the Jewish prayer for the dead.\nThis video released by the IDF on May 11, 2025, shows troops reciting the Jewish prayer for the dead upon receiving the remains of Sgt. First Class Zvi Feldman, who went missing in 1982. (Israel Defense Forces)\n“For decades, Zvika was missing, and the efforts to locate him, along with the other missing soldiers from that same battle, never ceased for a moment,” Prime Minister Benjamin Netanyahu said in a statement.\nThe Mossad, IDF, Netanyahu, and Defense Minister Israel Katz all said Israel would not stop its efforts until the remains of Katz are also returned.\nADVERTISEMENT\n“Just as we returned Zachary Baumel, and today Zvi Feldman, we continue to act in every way to also return Sgt. First Class Yehuda Katz and fulfill our duty for him and his family,” the defense minister said.\nFrom left: Zachary Baumel, Yehuda Katz and Zvi Feldman (Courtesy)\nBaumel’s body was recovered with Russian assistance from the Yarmouk refugee camp, home to one of the largest Palestinian communities in Syria. In 2016, an Israeli tank lost in the battle was returned to Israel by Russia.\nThe IDF has been deployed to nine posts inside southern Syria since the fall of the Bashar al-Assad regime in December, mostly within a UN-patrolled buffer zone on the border between the countries.\nTroops have been operating in areas up to around 15 kilometers (9 miles) deep into Syria, aiming to capture weapons that Israel says could pose a threat to the country if they fall into the hands of “hostile forces.”\nThe Hostages Forum, which represents the majority of relatives of those held captive in Gaza, welcomes the return of Feldman’s body, while calling for the return of the remaining hostages, living and dead.\nIsraeli soldiers carry the coffin of Zachary Baumel at the Mount Herzl Military cemetery in Jerusalem on April 4, 2019. (Hadas Parush/Flash90)\n“The families of the hostages would like to extend a big hug to the Feldman family and to every family that is privileged to bring their loved one to burial,” the forum said in a statement.\n“The return of Zvi Feldman is a moral, ethical and national reminder to the prime minister and members of the government — a grave is not a privilege, but a basic duty of the state to its citizens and fighters. In Israel, no one is left behind,” it said.\n“As a society, we must not normalize a situation in which families have to wait over 40 years or more to be reunited with their loved ones,” it said.\nTerror groups in the Gaza Strip are holding 59 hostages, including 58 of the 251 abducted by Hamas-led terrorists on October 7, 2023. They include the bodies of at least 35 confirmed dead by the IDF, one of whom is a soldier killed a decade ago. Israel has said there are grave concerns for the lives of a further three."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/purge-of-hezbollah-from-beirut-airport-satisfying-israeli-us-officials-report/", "title": "Purge of Hezbollah from Beirut airport satisfying Israeli, US officials — report", "media_type": "article", "date": "11 May 2025, 12:28 pm", "content": "Lebanon has conducted a major overhaul of security at its sole international airport, in Beirut, to prevent smuggling by Hezbollah, satisfying Israeli and US officials and giving them hope that the government will take full control over the country’s ports of entry from the terror group, according to a new report.\nAirport staff linked to Hezbollah have been fired, smugglers have been detained, and new surveillance mechanisms using AI are being deployed at Rafik Hariri International Airport, which is situated in an area of southern Beirut that is controlled by the Iran-backed terror group, The Wall Street Journal reported Saturday.\nIn one recent achievement, Lebanese security thwarted an attempt to smuggle over 22 kilograms (50 pounds) of gold to Hezbollah through the airport, a senior security official told the newspaper.\n“You can feel the difference,” Lebanese Prime Minister Nawaf Salam said. “We’re doing better on smuggling for the first time in the contemporary history of Lebanon.”\nSalam, who was appointed by Lebanon’s new president in January, was also cited as saying that Hezbollah had tried to block plans to construct a second airport for commercial and cargo flights in an area outside the terror group’s control, near the Syrian border in northern Lebanon. The second airport could also serve as an alternative should the Beirut airport be shuttered due to Israeli attacks on Hezbollah targets there, the newspaper said.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nWhile Israeli and US officials reportedly felt there was still work to be done in Lebanon, a senior US official told the newspaper that “there is reason for hope here.”\nA Lebanese army officer shows Lebanese Prime Minister Nawaf Salam, center, an Israeli military position on the horizon, in the southern village of Khiam, February 28, 2025. (Rabih Daher / AFP)\nThe official, who works for the mechanism overseeing the implementation of the November 27 Israel-Hezbollah ceasefire agreement, said “it has only been six or seven months, and we have stepped to a place that I am not sure I thought was achievable back in November.”\nSenior Lebanese security and military officials cited by the Journal said no planes are now exempt from security checks, while flights from Iran have been suspended since February.\nADVERTISEMENT\nThe suspension, triggered by an IDF claim that Iran was smuggling cash to Hezbollah aboard civilian flights, set off massive riots by supporters of the terror group who demanded Iranian flights be let in. At one point, rioters attacked a convoy led by a top officer from the international peacekeeping force UNIFIL, wounding him.\nMeanwhile, the IDF has continued to target Hezbollah operatives and arms caches in southern Lebanon, and maintains some posts in the region after withdrawing from most of it in February.\nThe terror group was required to vacate the area under the November 27 ceasefire agreement, to be replaced by Lebanon’s military and UNIFIL. Last month, an official said the Lebanese military had dismantled over 90% of Hezbollah’s infrastructure near the border with Israel.\nFire from burning tires burns as Hezbollah supporters face off with Lebanese soldiers during a Hezbollah-organized riot to block the road to the airport in Beirut, Lebanon, February 15, 2025. (Ibrahim Amro / AFP)\nIbrahim Mousawi, a Hezbollah member of Lebanon’s parliament, told the Journal that while the terror group sustained heavy losses, it had ways to rearm, saying, “Where there is a will, there is a way.” He also said allegations that Hezbollah controlled the airport were exaggerated: “We are part of the system, just like any other Lebanese constituency.”\nHowever, Lebanon’s former deputy prime minister Ghassan Hasbani said the airport had been “a main port of entry for supporting whatever para-state activities were happening.”\nHasbani, who now represents an anti-Hezbollah bloc in the Lebanese parliament, said authorities had turned “a purposeful blind eye” to the terror group’s use of the Beirut airport. “In the absence of international attention and pressure to do something about it, nothing much was done.”\nADVERTISEMENT\nHezbollah’s standing in domestic politics has taken a blow in the wake of the fighting that began when the terror group attacked Israel on October 8, 2023 — a day after fellow Iran-backed group Hamas stormed southern Israel to kill some 1,200 people and take 251 hostages, sparking the war in Gaza.\nSome 60,000 residents of northern Israel were displaced by Hezbollah’s near-daily attacks. In a bid to secure the residents’ return, the IDF stepped up operations in Lebanon in September, decimating Hezbollah’s leadership.\nView of a large fire caused by rockets fired from Lebanon, in the northern town of Kiryat Shmona, June 3, 2024. (Ayal Margolin/Flash90)\nThe fighting killed thousands of people, according to Lebanon’s health ministry, which does not distinguish between combatants and civilians. The IDF estimated it had killed some 3,500 Hezbollah operatives.\nHezbollah also took a hit with the ouster in December of its powerful ally in Syria, the Iran-backed president Bashar al-Assad. The ouster cut off a land route for arms smuggling from Iran to Lebanon.\nIn January, Lebanon’s parliament elected US-backed President Joseph Aoun, ending a two-year vacancy in the post. Aoun, previously the commander of Lebanon’s armed forces, has vowed to maintain a state monopoly on arms — a veiled threat against Hezbollah, the only armed group not to surrender its arms to the Lebanese state when the country’s 15-year civil war ended in 1990. Aoun has also demanded that Israel vacate its remaining posts in southern Lebanon."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/israel-attacks-yemens-hodeidah-houthi-interior-ministry-says/", "title": "IDF issues ‘urgent’ evacuation warning for three Houthi-controlled ports in Yemen", "media_type": "article", "date": "11 May 2025, 10:38 pm", "content": "The Israel Defense Forces on Sunday evening issued an “urgent” evacuation warning to the three Houthi-controlled ports in western Yemen, ahead of potential Israeli strikes.\nThe warning came after the Houthis fired several ballistic missiles and drones at Israel in recent days, since the Israeli Air Force struck the Houthi-controlled airport in Sanaa and several other facilities last week in response to a Houthi ballistic missile that impacted inside the grounds of Ben Gurion Airport last Sunday.\nIn a post on X, the IDF’s Arabic-language spokesman Col. Avichay Adraee warned those at the Ras Isa, Hodeidah, and Salif ports on the western coast to evacuate.\n“Due to the Houthi terror regime’s use of ports for its terror activities, we urge all those present at these ports to evacuate and stay away from them for your own safety until further notice,” he said.\nA report by Reuters, citing the Houthi interior ministry, claimed that Israel targeted Hodeidah port following the warning. Israeli military sources said no strikes had been carried out as of Sunday night. There were no reports in Houthi media of strikes either.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nOn Friday afternoon, the Houthis fired a ballistic missile that triggered sirens across central Israel. The IDF reported that the missile was successfully intercepted by air defenses.\nDefense Minister Israel Katz warned then that Israel would respond. “The Houthis continue to launch Iranian missiles at Israel. As we promised, we will respond, strongly in Yemen and anywhere else necessary,” he said in a statement.\nThe Friday attack came three days after the US announced that it had reached a ceasefire with the Yemeni terror group.\nHouthi officials made clear that the deal, in which they agreed to stop targeting US maritime activity in the Red Sea in exchange for an end to weeks of intense US airstrikes, did not include any agreement to stop firing at Israel or ships linked to the Jewish state.\nOn Wednesday, the IDF said a missile fired by the Houthis crashed outside Israeli territory. Earlier in the day, the IDF said it had downed a drone launched from Yemen.\nADVERTISEMENT\nThe attacks came after Israel carried out two days of heavy sorties targeting infrastructure controlled by the Houthis in response to the missile that struck Ben Gurion Airport. Since Ben Gurion was hit, most foreign airlines have suspended flights to Israel.\nThe fiery reprisals destroyed the international airport in the capital Sanaa, and caused heavy damage to a port in Hodeida and several power stations and a cement factory, officials said.\nThe Houthis — whose slogan calls for “Death to America, Death to Israel, [and] a Curse on the Jews” — first began attacking Israel and maritime traffic in November 2023, a month after the October 7 Hamas massacre.\nThe Houthis held their fire when a ceasefire was reached between Israel and Hamas in January 2025. By that point, they had fired over 40 ballistic missiles and dozens of attack drones and cruise missiles at Israel, including one that killed a civilian and wounded several others in Tel Aviv in July, prompting Israel’s first strike in Yemen.\nSince March 18, when the IDF resumed its offensive against Hamas in the Gaza Strip, the Houthis have launched some 29 ballistic missiles and at least 10 drones at Israel.\nThe sirens warning of missile attacks have sent hundreds of thousands of Israelis rushing to shelters at all hours of the day and night."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/body-of-soldier-zvi-feldman-missing-for-43-years-recovered-by-mossad-and-idf/", "title": "Body of soldier Zvi Feldman, missing for 43 years, recovered from Syria by Mossad, IDF", "media_type": "article", "date": "11 May 2025, 11:14 am", "content": "The Mossad spy agency and the Israel Defense Forces recovered the remains of Sgt. First Class Zvi Feldman, who went missing in the First Lebanon War’s battle of Sultan Yacoub in 1982, officials announced on Sunday.\nThe battle, nearly 43 years ago, was a skirmish between the IDF and the Syrian army in Lebanon’s Beqaa Valley. It claimed the lives of 21 Israeli servicemen, and more than 30 were injured during it.\nFeldman, a tank soldier, went missing during the battle along with Sgt. First Class Yehuda Katz and Sgt. First Class Zachary Baumel. Baumel’s remains were recovered and returned to Israel in 2019.\nIn a joint statement on Sunday, the Mossad and IDF said the body of Feldman was recovered from “the heart of Syria” in a special operation.\nThey said the “complex and covert operation” was made possible by “precise intelligence” and other capabilities, including “intelligence research and collection efforts and many activities and operations in enemy territory.”\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nThe military said the efforts to locate the body had been ongoing for decades.\nThis image released by the IDF on May 11, 2025, shows troops carrying a coffin containing the remains of Sgt. First Class Zvi Feldman, who went missing in 1982. (Israel Defense Forces)\nDefense officials said the operation to recover the remains was carried out by non-Israeli Mossad agents. The team operated deep inside Syria, dozens of kilometers from the Israeli border, to retrieve the body, while risking their lives.\nThe agents, operating on behalf of Mossad, had a cover story and had been inside Syria for several years. In the past five months, following the fall of the Bashar al-Assad regime, there were breakthroughs in the case and an opportunity to recover Feldman’s remains, the officials said.\nADVERTISEMENT\nOfficials said the team operated “under fire” during the mission, as they visited a graveyard several times, obtaining various findings that were sent to Israel for identification. Eventually findings matched Feldman’s DNA.\nThe team also found the tank soldier’s overalls, which were identified by the head of the Intelligence Directorate’s missing persons unit, who himself served in the Armored Corps in his youth.\nPrime Minister Benjamin Netanyahu informs relatives of Sgt. First Class Zvi Feldman that his body was recovered, May 11, 2025 (Kobi Gideon/GPO)\nThe remains belonging to Feldman — which were in a complex state due to the passage of time — and his overalls were brought to Israel for identification some two weeks ago. Feldman’s family was notified early Sunday once the identification process was completed.\nA video released by the IDF on Sunday showed the moment the remains were returned to Israel. The clip showed a coffin draped in an Israeli flag, as troops recited the mourner’s Kaddish, the Jewish prayer for the dead.\nThis video released by the IDF on May 11, 2025, shows troops reciting the Jewish prayer for the dead upon receiving the remains of Sgt. First Class Zvi Feldman, who went missing in 1982. (Israel Defense Forces)\n“For decades, Zvika was missing, and the efforts to locate him, along with the other missing soldiers from that same battle, never ceased for a moment,” Prime Minister Benjamin Netanyahu said in a statement.\nThe Mossad, IDF, Netanyahu, and Defense Minister Israel Katz all said Israel would not stop its efforts until the remains of Katz are also returned.\nADVERTISEMENT\n“Just as we returned Zachary Baumel, and today Zvi Feldman, we continue to act in every way to also return Sgt. First Class Yehuda Katz and fulfill our duty for him and his family,” the defense minister said.\nFrom left: Zachary Baumel, Yehuda Katz and Zvi Feldman (Courtesy)\nBaumel’s body was recovered with Russian assistance from the Yarmouk refugee camp, home to one of the largest Palestinian communities in Syria. In 2016, an Israeli tank lost in the battle was returned to Israel by Russia.\nThe IDF has been deployed to nine posts inside southern Syria since the fall of the Bashar al-Assad regime in December, mostly within a UN-patrolled buffer zone on the border between the countries.\nTroops have been operating in areas up to around 15 kilometers (9 miles) deep into Syria, aiming to capture weapons that Israel says could pose a threat to the country if they fall into the hands of “hostile forces.”\nThe Hostages Forum, which represents the majority of relatives of those held captive in Gaza, welcomes the return of Feldman’s body, while calling for the return of the remaining hostages, living and dead.\nIsraeli soldiers carry the coffin of Zachary Baumel at the Mount Herzl Military cemetery in Jerusalem on April 4, 2019. (Hadas Parush/Flash90)\n“The families of the hostages would like to extend a big hug to the Feldman family and to every family that is privileged to bring their loved one to burial,” the forum said in a statement.\n“The return of Zvi Feldman is a moral, ethical and national reminder to the prime minister and members of the government — a grave is not a privilege, but a basic duty of the state to its citizens and fighters. In Israel, no one is left behind,” it said.\n“As a society, we must not normalize a situation in which families have to wait over 40 years or more to be reunited with their loved ones,” it said.\nTerror groups in the Gaza Strip are holding 59 hostages, including 58 of the 251 abducted by Hamas-led terrorists on October 7, 2023. They include the bodies of at least 35 confirmed dead by the IDF, one of whom is a soldier killed a decade ago. Israel has said there are grave concerns for the lives of a further three."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/purge-of-hezbollah-from-beirut-airport-satisfying-israeli-us-officials-report/", "title": "Purge of Hezbollah from Beirut airport satisfying Israeli, US officials — report", "media_type": "article", "date": "11 May 2025, 12:28 pm", "content": "Lebanon has conducted a major overhaul of security at its sole international airport, in Beirut, to prevent smuggling by Hezbollah, satisfying Israeli and US officials and giving them hope that the government will take full control over the country’s ports of entry from the terror group, according to a new report.\nAirport staff linked to Hezbollah have been fired, smugglers have been detained, and new surveillance mechanisms using AI are being deployed at Rafik Hariri International Airport, which is situated in an area of southern Beirut that is controlled by the Iran-backed terror group, The Wall Street Journal reported Saturday.\nIn one recent achievement, Lebanese security thwarted an attempt to smuggle over 22 kilograms (50 pounds) of gold to Hezbollah through the airport, a senior security official told the newspaper.\n“You can feel the difference,” Lebanese Prime Minister Nawaf Salam said. “We’re doing better on smuggling for the first time in the contemporary history of Lebanon.”\nSalam, who was appointed by Lebanon’s new president in January, was also cited as saying that Hezbollah had tried to block plans to construct a second airport for commercial and cargo flights in an area outside the terror group’s control, near the Syrian border in northern Lebanon. The second airport could also serve as an alternative should the Beirut airport be shuttered due to Israeli attacks on Hezbollah targets there, the newspaper said.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nWhile Israeli and US officials reportedly felt there was still work to be done in Lebanon, a senior US official told the newspaper that “there is reason for hope here.”\nA Lebanese army officer shows Lebanese Prime Minister Nawaf Salam, center, an Israeli military position on the horizon, in the southern village of Khiam, February 28, 2025. (Rabih Daher / AFP)\nThe official, who works for the mechanism overseeing the implementation of the November 27 Israel-Hezbollah ceasefire agreement, said “it has only been six or seven months, and we have stepped to a place that I am not sure I thought was achievable back in November.”\nSenior Lebanese security and military officials cited by the Journal said no planes are now exempt from security checks, while flights from Iran have been suspended since February.\nADVERTISEMENT\nThe suspension, triggered by an IDF claim that Iran was smuggling cash to Hezbollah aboard civilian flights, set off massive riots by supporters of the terror group who demanded Iranian flights be let in. At one point, rioters attacked a convoy led by a top officer from the international peacekeeping force UNIFIL, wounding him.\nMeanwhile, the IDF has continued to target Hezbollah operatives and arms caches in southern Lebanon, and maintains some posts in the region after withdrawing from most of it in February.\nThe terror group was required to vacate the area under the November 27 ceasefire agreement, to be replaced by Lebanon’s military and UNIFIL. Last month, an official said the Lebanese military had dismantled over 90% of Hezbollah’s infrastructure near the border with Israel.\nFire from burning tires burns as Hezbollah supporters face off with Lebanese soldiers during a Hezbollah-organized riot to block the road to the airport in Beirut, Lebanon, February 15, 2025. (Ibrahim Amro / AFP)\nIbrahim Mousawi, a Hezbollah member of Lebanon’s parliament, told the Journal that while the terror group sustained heavy losses, it had ways to rearm, saying, “Where there is a will, there is a way.” He also said allegations that Hezbollah controlled the airport were exaggerated: “We are part of the system, just like any other Lebanese constituency.”\nHowever, Lebanon’s former deputy prime minister Ghassan Hasbani said the airport had been “a main port of entry for supporting whatever para-state activities were happening.”\nHasbani, who now represents an anti-Hezbollah bloc in the Lebanese parliament, said authorities had turned “a purposeful blind eye” to the terror group’s use of the Beirut airport. “In the absence of international attention and pressure to do something about it, nothing much was done.”\nADVERTISEMENT\nHezbollah’s standing in domestic politics has taken a blow in the wake of the fighting that began when the terror group attacked Israel on October 8, 2023 — a day after fellow Iran-backed group Hamas stormed southern Israel to kill some 1,200 people and take 251 hostages, sparking the war in Gaza.\nSome 60,000 residents of northern Israel were displaced by Hezbollah’s near-daily attacks. In a bid to secure the residents’ return, the IDF stepped up operations in Lebanon in September, decimating Hezbollah’s leadership.\nView of a large fire caused by rockets fired from Lebanon, in the northern town of Kiryat Shmona, June 3, 2024. (Ayal Margolin/Flash90)\nThe fighting killed thousands of people, according to Lebanon’s health ministry, which does not distinguish between combatants and civilians. The IDF estimated it had killed some 3,500 Hezbollah operatives.\nHezbollah also took a hit with the ouster in December of its powerful ally in Syria, the Iran-backed president Bashar al-Assad. The ouster cut off a land route for arms smuggling from Iran to Lebanon.\nIn January, Lebanon’s parliament elected US-backed President Joseph Aoun, ending a two-year vacancy in the post. Aoun, previously the commander of Lebanon’s armed forces, has vowed to maintain a state monopoly on arms — a veiled threat against Hezbollah, the only armed group not to surrender its arms to the Lebanese state when the country’s 15-year civil war ended in 1990. Aoun has also demanded that Israel vacate its remaining posts in southern Lebanon."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/tehran-says-4th-round-of-nuclear-talks-difficult-while-us-encouraged/", "title": "Tehran says 4th round of nuclear talks difficult, while US ‘encouraged’", "media_type": "article", "date": "11 May 2025, 9:44 pm", "content": "Iran and the United States wrapped up nuclear talks in Oman on Sunday with no apparent breakthrough and a public standoff over enrichment, but with both sides confirming plans for future negotiations.\nIt was the fourth round of the talks that began a month ago, marking the highest-level contact between the two foes since Washington withdrew in 2018 from a landmark nuclear deal during President Donald Trump’s first term.\nBoth sides had reported progress in the previous three rounds, and on Sunday, Iran said the meeting was “difficult but useful,” while a senior US official said Washington was “encouraged.”\nIn a post on X, Iran’s foreign ministry spokesman Esmaeil Baqaei said the talks could help “better understand each other’s positions and to find reasonable and realistic ways to address the differences.”\nBaqaei earlier said negotiators would push for relief from US sanctions.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nThe US official, speaking on condition of anonymity, said Washington was “encouraged by today’s outcome and look(s) forward to our next meeting, which will happen in the near future,” without specifying when.\nThis handout picture provided by the Iranian Foreign Ministry on May 11, 2025, shows Iran’s Foreign Minister Abbas Araghchi (C) being welcomed upon his arrival in Muscat (Iranian Foreign Ministry / AFP)\nBaqaei said that the “next round will be coordinated and announced by Oman.”\nAccording to the US official, the talks were “both direct and indirect, and lasted over three hours.”\nADVERTISEMENT\n“Agreement was reached to move forward” and “continue working through technical elements,” the official added.\nIran entered the talks saying that its right to maintain uranium enrichment was “non-negotiable,” while Washington’s chief negotiator Steve Witkoff has said that the American demand to stop enrichment is a “red line.”\nIranian Foreign Minister Abbas Araghchi, who led Tehran’s delegation, said in a video before departing for the Omani capital Muscat that “enrichment capability is one of the honors” of Iran.\nUS President Donald Trump, left, shakes hands with Assistant to the President, Senior Adviser and Special Envoy Steve Witkoff after Witkoff’s swearing-in ceremony in the Oval Office of the White House in Washington, DC, on May 6, 2025. (Jim WATSON / AFP)\n‘Pressure’\nThe talks come amid a flurry of diplomatic activity in the region, with Trump heading to the Gulf for his first major foreign tour next week, and Araghchi just back from Saudi Arabia and Qatar.\nThe fourth round that took place on Sunday was initially scheduled for May 3, but was delayed, with mediator Oman citing “logistical reasons.”\nYousuf Al Bulushi, chairman of the Muscat Policy Council think tank, said that a breakthrough “will take quite some time, but I’m optimistic.”\nADVERTISEMENT\nHe warned, however, that both sides had lost precious time during past negotiations, trying to clarify public statements “instead of focusing solely on talks.”\nPublic pressure “is a tactic in negotiations… but this is really impacting the atmosphere” at the table, said Bulushi.\nWestern countries, including the United States, have long accused Iran of seeking to acquire nuclear weapons, while Tehran insists that its nuclear program is for peaceful purposes.\nA handout picture provided by the Iranian presidency shows Iran’s President Masoud Pezeshkian (2nd R) and the Atomic Energy Organisation of Iran (AEOI) chief Mohammad Eslami (R) during the ‘National Day of Nuclear Technology,’ in Tehran, on April 9, 2025 (Iranian Presidency / AFP)\nIran currently enriches uranium to 60-percent purity — far above the 3.67% limit set in the 2015 deal with the United States and other world powers, and a short technical step from the 90% needed for weapons-grade material. Tehran regularly threatens to destroy Israel, and its uranium enrichment level is far higher than necessary for civilian uses.\nWitkoff, Trump’s Middle East envoy, said in a Friday interview that Iran’s “enrichment facilities have to be dismantled.”\n“That’s our red line. No enrichment. That means dismantlement. It means no weaponization. And it means that Natanz, Fordow and Isfahan — those are their three enrichment facilities — have to be dismantled,” he told US right-wing outlet Breitbart News, after initially suggesting flexibility on Tehran maintaining low-level enrichment of uranium for civilian purposes.\nAraghchi has repeatedly defended Iran’s right to enrich uranium.\nForeign Minister Gideon Saar visits at the Yad Vashem Holocaust Memorial museum in Jerusalem on May 11, 2025 (Yonatan Sindel/Flash90)\n‘World’s most dangerous weapon’\nAt a press conference in Jerusalem on Sunday, Foreign Minister Gideon Sa’ar said Iran’s uranium enrichment facilities “must be dismantled,” and that the US and Israel agree on this issue.\nADVERTISEMENT\n“The most dangerous regime must not be allowed to obtain the world’s most dangerous weapon,” he said.\nSa’ar said he “agrees very much” with comments made over the weekend by Witkoff, who said enrichment facilities “have to be dismantled” for Washington to take it at its word that it does not want nuclear arms.\n“I think this is the right approach and we hold the same view on the matter,” Sa’ar said.\nAsked whether Israel is concerned about recent foreign policy moves by Trump that seemed to sideline Jerusalem on key regional issues, Sa’ar said, “We are coordinated. It doesn’t mean we must fully agree one hundred percent on every issue.”\n“The US is a sovereign state, Israel is a sovereign state. But I believe that we have very, very big common grounds with positions in this US administration, more than in the past…I think the US is our greatest friend and President Trump is a great friend of Israel, and we will work together; we are working together,” he added.\nSa’ar noted that “there is no other world leader” with whom Trump has spent more time than Prime Minister Benjamin Netanyahu.\nA woman walks past a billboard bearing portraits of slain Iranian and Lebanese and Palestinian terror leaders in Tehran’s Enghelab square on May 11, 2025. (ATTA KENARE / AFP)\nNetanyahu, who is deeply skeptical of the Iran-US talks, has called for all of Tehran’s nuclear facilities to be dismantled and for its ballistic missile program to be stopped as part of any credible deal.\nADVERTISEMENT\nTehran has insisted that the talks be solely focused on the nuclear issue and the lifting of sanctions, ruling out negotiations on military capabilities.\nJerusalem is reportedly unhappy with the state of the talks, which were said to be developing into a largely similar framework to the 2015 Joint Comprehensive Plan of Action, or JCPOA, which was signed by then-US president Barack Obama and was panned at the time by Netanyahu as disastrous for Israel. Trump also maligned the accord before withdrawing from it in 2018."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/iran-vows-not-to-back-down-from-its-nuclear-rights-as-talks-with-us-set-to-resume/", "title": "Iran vows not to back down from its ‘nuclear rights,’ as talks with US set to resume", "media_type": "article", "date": "11 May 2025, 4:27 am", "content": "DUBAI, United Arab Emirates — Iranian Foreign Minister Abbas Araghchi said on Saturday that if the United States’ goal was to deprive Iran of its “nuclear rights,” Tehran would never back down on that front.\nAraghchi was speaking in Doha a day ahead of another round of planned nuclear talks between Iran and the US in Oman.\n“If the goal of the negotiations is to deprive Iran of its nuclear rights, I state clearly that Iran will not back down from any of its rights,” state media quoted Araghchi as saying.\nIran has repeatedly said its right to enrich uranium is non-negotiable and has ruled out a “zero enrichment” demand by some US officials.\nBut US President Donald Trump’s special envoy, Steve Witkoff, said in an interview on Friday that Iran’s “enrichment facilities have to be dismantled” under any accord with the United States.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nTrump, who withdrew Washington from a 2015 deal between Tehran and world powers meant to curb its nuclear activity, has threatened to bomb Iran if no new deal is reached to resolve the long-unresolved dispute.\nUS President Donald Trump, left, shakes hands with Assistant to the President, Senior Adviser and Special Envoy Steve Witkoff after Witkoff’s swearing-in ceremony in the Oval Office of the White House in Washington, DC, on May 6, 2025. (Photo by Jim WATSON / AFP)\nWestern countries say Iran’s nuclear program, which Tehran accelerated after the US walkout from the now moribund 2015 accord, is geared toward producing weapons, whereas Iran insists it is purely for civilian purposes. However, Tehran regularly threatens to flatten Israeli cities and is currently enriching uranium to levels that have no civilian use.\n“In its indirect talks with the United States, Iran emphasizes its right to peaceful use of nuclear energy and clearly declares that it is not seeking nuclear weapons,” Araghchi claimed.\nADVERTISEMENT\n“Iran continues negotiations in good faith, and if the goal of these talks is to ensure the non-acquisition of nuclear weapons, an agreement is possible. However, if the aim is to limit Iran’s nuclear rights, Iran will never retreat from its rights.”\nWitkoff was set to travel to Oman on Sunday for the fourth round of Omani-mediated talks with Araghchi, a source familiar with the matter said. The fourth round of negotiations, initially scheduled for May 3 in Rome, was postponed, with mediator Oman citing “logistical reasons.”\nAraghchi visited Saudi Arabia and Qatar on Saturday, a day before the fourth round of negotiations and days before Trump is expected to visit those countries. Trump is scheduled to visit Saudi Arabia, Qatar and the United Arab Emirates from May 13 to 16 on his first major Middle East trip of his second term. The president is not expected to visit Israel on the trip.\nIran’s Foreign Minister Abbas Araghchi speaks to the media during the signing ceremony for his book ‘The Power of Negotiation’ at the Muscat International Book fair in Oman, April 25, 2025. (Haitham AL-SHUKAIRI / AFP)\nTrump provoked Araghchi’s ire earlier this month by indicating that the US would decide what to call the Persian Gulf, following reports that Washington could officially rename it the Gulf of Arabia. Araghchi condemned the decision as showing “hostile intent toward Iran and its people.”\nAhead of the trip, Trump had predicted that Saudi-Israel normalization would happen “very quickly.” However, sources cited by Reuters have said Trump has dropped the demand that Saudi Arabia normalize relations with Israel as a condition for progress on a civil nuclear program.\nJacob Magid and agencies contributed to this report."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/witkoff-iran-must-dismantle-uranium-enrichment-facilities-ship-material-far-away/", "title": "Witkoff: Iran must dismantle uranium enrichment facilities, ship material ‘far away’", "media_type": "article", "date": "10 May 2025, 12:10 am", "content": "US special envoy to the Middle East Steve Witkoff, who is set to resume nuclear talks with Iran on Sunday, has said the Islamic Republic’s uranium enrichment facilities “have to be dismantled” for Washington to take it at its word that it does not want nuclear arms.\n“They cannot have centrifuges. They have to downblend all of their fuel that they have there and send it to a far-away place,” Witkoff said in an interview with right-wing US news outlet Breitbart on Thursday. “An enrichment program can never exist in the state of Iran ever again. That’s our red line.”\n“I just believe they have no choice” but to accept the position of US President Donald Trump against enrichment, said Witkoff. “Obviously, they can say no, and they can test President Trump, but I think that would be an unwise thing to do.”\nThe comments came after Witkoff last month said the US would seek only to cap Iran’s uranium enrichment, but not end it altogether, contrary to the position of Israeli Prime Minister Benjamin Netanyahu. Witkoff quickly backtracked, saying any nuclear deal with Iran “must stop and eliminate its nuclear enrichment and weaponization program.”\nSpeaking to Breitbart, Witkoff said Iran would have to dismantle its three known enrichment facilities in Natanz, Fordow and Isfahan. On the other hand, he said, the Iranians could hold onto their nuclear reactor in Bushehr, where “they have no ability to enrich, they have no ability to have centrifuges there, they can only use that facility for civilian purposes — making electricity and things of that sort of civilian purposes.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\n“If that is what they choose to do, if they believe in that program, they ought to expand it if they want to,” said Witkoff, adding that his goal in the nuclear talks was to get Tehran to “voluntarily shift away from an enrichment program.”\nThis October 26, 2010, photo shows the reactor building of the Bushehr nuclear power plant just outside the southern city of Bushehr, Iran. (AP Photo/Mehr News Agency, Majid Asgaripour)\n“If we can get them to voluntarily do that, that is the most permanent way to make sure that they never get a weapon,” he said.\nIran, whose leaders are sworn to destroy Israel, says it opposes nuclear weapons. However, the Islamic Republic is enriching uranium to 60% — far higher than necessary for civilian uses, and a short step away from weapons-grade.\nADVERTISEMENT\nIran also funds a regional network of anti-Israel proxies, including Gaza’s Hamas, Lebanon’s Hezbollah and Yemen’s Houthis. Getting Iran to stop arming those groups is a “secondary discussion,” Witkoff told Breitbart.\n“We don’t want to confuse the nuclear discussion because that to us is the existential issue,” said Witkoff. “That’s the issue that needs to be solved today and quickly.”\nWitkoff is set to travel to Oman on Sunday for the fourth round of Omani-mediated talks with Iranian Foreign Minister Abbas Araghchi, a source familiar with the matter said, as Iran’s semi-official Tasnim news cited an Iranian negotiator as saying Tehran had agreed to resume talks.\nThe fourth round of negotiations, initially scheduled for May 3 in Rome, was postponed, with mediator Oman citing “logistical reasons.”\nIranian Foreign Minister Abbas Araghchi attends a news conference following his meeting with Russian Foreign Minister Sergey Lavrov in Moscow, Russia, April 18, 2025. (Tatyana Makeyeva/Pool Photo via AP)\nWitkoff told Breitbart that the fourth round had been delayed because “we didn’t think that the talks last week were going to be productive, because we needed to get to certain understandings with them, and hopefully this Sunday they will be productive.”\nWitkoff was reportedly engaged over the past week in talks with Omani and Houthi officials that resulted in a US ceasefire in Yemen, announced by Trump on Tuesday. Sources cited by CNN said the US-Houthi truce talks aimed to provide momentum for the Iran nuclear talks.\nADVERTISEMENT\nThe truce did not include a commitment by the Yemeni rebels to stop attacking Israel, and apparently caught Jerusalem by surprise — much like Trump’s announcement of the Iran nuclear talks last month.\nTrump, in his first term, scrapped the 2015 Iran nuclear deal, dubbed the Joint Comprehensive Plan of Action, which had promised Iran sanctions relief in exchange for greater oversight over its nuclear program. Netanyahu had railed against that deal, arguing that it kept in place Iran’s capacity to produce nuclear arms.\nWitkoff told Breitbart that “we’re never doing a JCPOA deal,” saying the agreement had a “mismatched procedure.”\nUS President Donald Trump waits to greet Canadian Prime Minister Mark Carney at the West Wing of the White House, May 6, 2025, in Washington. (AP Photo/Mark Schiefelbein)\n“We believe that they cannot have enrichment, they cannot have centrifuges, they cannot have anything that allows them to build a weapon. We believe in all of that. That was not JCPOA,” said Witkoff.\n“JCPOA had sunset provisions that burned off the obligations and burned off the sanctions relief at inappropriate times. It’s never going to happen in this deal,” he said.\nWitkoff stressed that Trump, who is expected to visit the Middle East next week, prefers a diplomatic rather than military solution to the Iranian nuclear threat.\nWitkoff said critics of his diplomacy included a “neocon element” that “believes war is the only way to solve things.”\n“Neocon,” or neo-conservative, refers in US political parlance to politicians who support intervention in foreign conflicts. The term is often used derisively by Trump’s isolationist supporters.\nADVERTISEMENT\nIranian diplomats and officials from the P5+1 powers meet in Vienna to discuss the 2015 nuclear accord on April 25, 2017. (AFP/Joe Klamar)\nWitkoff’s comment came after Trump last week fired US National Security Adviser Mike Waltz, in part, reportedly, over the latter’s hawkish views on Iran and intense coordination with Netanyahu on a potential military strike there.\nWitkoff said his neo-conservative critics “give no consideration whatsoever on what the consequences are” for military action, and are certain that Iran will manipulate Witkoff if it is not handled with force.\n“They may attempt to manipulate me. I don’t think they’re going to be able to manipulate me,” said Witkoff. “If the Iranians make the mistake of thinking they can procrastinate at the table, then they won’t see that much of me.\n“The alternative, as the president says, will be a bad alternative for them,” he said. Trump “believes that his force of personality… can bend people to do things in a better way in the interests of the United States government,” said Witkoff, adding: “I believe in that too.”\nAraghchi to consult with Saudi counterparts\nAraghchi, Witkoff’s interlocutor in the nuclear talks, is set to visit Saudi Arabia and Qatar on Saturday, a day before the fourth round of negotiations and days before Trump is expected to visit those countries, Iran’s foreign ministry said in a statement Friday.\nAraghchi is due to hold talks with senior Saudi officials in Riyadh before heading to Doha for a conference on Arab-Iranian dialogue, the ministry said. The Iranian top diplomat later said meetings in Saudi Arabia would cover the latest on the nuclear talks with Washington.\nIran’s Foreign Minister Abbas Araghchi speaks to the media during the signing ceremony for his book ‘The Power of Negotiation’ at the Muscat International Book fair in Oman, April 25, 2025. (Haitham AL-SHUKAIRI / AFP)\nIn a video carried by Iranian media, Araghchi said Tehran believes “the sustainability of any possible agreement depends to a large extent on taking into account the considerations and concerns of the countries of the region in the nuclear field,” and those countries’ common interests with Iran.\nADVERTISEMENT\nTrump is scheduled to visit Saudi Arabia, Qatar and the United Arab Emirates from May 13 to 16 on his first major Middle East trip of his second term. The president is not expected to visit Israel on the trip.\nTrump provoked Araghchi’s ire earlier this week by indicating that the US would decide how to call the Persian Gulf, following reports that Washington could officially rename it the Gulf of Arabia. Araghchi condemned the decision as showing “hostile intent toward Iran and its people.”\nAhead of the trip, Trump had predicted that Saudi-Israel normalization would happen “very quickly.” However, sources cited by Reuters this week said Trump had dropped the demand that Saudi Arabia normalize relations with Israel as a condition for progress on a civil nuclear program.\nAgencies contributed to this report."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/israel-attacks-yemens-hodeidah-houthi-interior-ministry-says/", "title": "IDF issues ‘urgent’ evacuation warning for three Houthi-controlled ports in Yemen", "media_type": "article", "date": "11 May 2025, 10:38 pm", "content": "The Israel Defense Forces on Sunday evening issued an “urgent” evacuation warning to the three Houthi-controlled ports in western Yemen, ahead of potential Israeli strikes.\nThe warning came after the Houthis fired several ballistic missiles and drones at Israel in recent days, since the Israeli Air Force struck the Houthi-controlled airport in Sanaa and several other facilities last week in response to a Houthi ballistic missile that impacted inside the grounds of Ben Gurion Airport last Sunday.\nIn a post on X, the IDF’s Arabic-language spokesman Col. Avichay Adraee warned those at the Ras Isa, Hodeidah, and Salif ports on the western coast to evacuate.\n00:00 / 23:33\n“Due to the Houthi terror regime’s use of ports for its terror activities, we urge all those present at these ports to evacuate and stay away from them for your own safety until further notice,” he said.\nA report by Reuters, citing the Houthi interior ministry, claimed that Israel targeted Hodeidah port following the warning. Israeli military sources said no strikes had been carried out as of Sunday night. There were no reports in Houthi media of strikes either.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nOn Friday afternoon, the Houthis fired a ballistic missile that triggered sirens across central Israel. The IDF reported that the missile was successfully intercepted by air defenses.\nDefense Minister Israel Katz warned then that Israel would respond. “The Houthis continue to launch Iranian missiles at Israel. As we promised, we will respond, strongly in Yemen and anywhere else necessary,” he said in a statement.\nThe Friday attack came three days after the US announced that it had reached a ceasefire with the Yemeni terror group.\nHouthi officials made clear that the deal, in which they agreed to stop targeting US maritime activity in the Red Sea in exchange for an end to weeks of intense US airstrikes, did not include any agreement to stop firing at Israel or ships linked to the Jewish state.\nOn Wednesday, the IDF said a missile fired by the Houthis crashed outside Israeli territory. Earlier in the day, the IDF said it had downed a drone launched from Yemen.\nADVERTISEMENT\nThe attacks came after Israel carried out two days of heavy sorties targeting infrastructure controlled by the Houthis in response to the missile that struck Ben Gurion Airport. Since Ben Gurion was hit, most foreign airlines have suspended flights to Israel.\nThe fiery reprisals destroyed the international airport in the capital Sanaa, and caused heavy damage to a port in Hodeida and several power stations and a cement factory, officials said.\nThe Houthis — whose slogan calls for “Death to America, Death to Israel, [and] a Curse on the Jews” — first began attacking Israel and maritime traffic in November 2023, a month after the October 7 Hamas massacre.\nThe Houthis held their fire when a ceasefire was reached between Israel and Hamas in January 2025. By that point, they had fired over 40 ballistic missiles and dozens of attack drones and cruise missiles at Israel, including one that killed a civilian and wounded several others in Tel Aviv in July, prompting Israel’s first strike in Yemen.\nSince March 18, when the IDF resumed its offensive against Hamas in the Gaza Strip, the Houthis have launched some 29 ballistic missiles and at least 10 drones at Israel.\nThe sirens warning of missile attacks have sent hundreds of thousands of Israelis rushing to shelters at all hours of the day and night."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/body-of-soldier-zvi-feldman-missing-for-43-years-recovered-by-mossad-and-idf/", "title": "Body of soldier Zvi Feldman, missing for 43 years, recovered from Syria by Mossad, IDF", "media_type": "article", "date": "11 May 2025, 11:14 am", "content": "The Mossad spy agency and the Israel Defense Forces recovered the remains of Sgt. First Class Zvi Feldman, who went missing in the First Lebanon War’s battle of Sultan Yacoub in 1982, officials announced on Sunday.\nThe battle, nearly 43 years ago, was a skirmish between the IDF and the Syrian army in Lebanon’s Beqaa Valley. It claimed the lives of 21 Israeli servicemen, and more than 30 were injured during it.\nFeldman, a tank soldier, went missing during the battle along with Sgt. First Class Yehuda Katz and Sgt. First Class Zachary Baumel. Baumel’s remains were recovered and returned to Israel in 2019.\n00:00 / 23:33\nIn a joint statement on Sunday, the Mossad and IDF said the body of Feldman was recovered from “the heart of Syria” in a special operation.\nThey said the “complex and covert operation” was made possible by “precise intelligence” and other capabilities, including “intelligence research and collection efforts and many activities and operations in enemy territory.”\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nThe military said the efforts to locate the body had been ongoing for decades.\nThis image released by the IDF on May 11, 2025, shows troops carrying a coffin containing the remains of Sgt. First Class Zvi Feldman, who went missing in 1982. (Israel Defense Forces)\nDefense officials said the operation to recover the remains was carried out by non-Israeli Mossad agents. The team operated deep inside Syria, dozens of kilometers from the Israeli border, to retrieve the body, while risking their lives.\nThe agents, operating on behalf of Mossad, had a cover story and had been inside Syria for several years. In the past five months, following the fall of the Bashar al-Assad regime, there were breakthroughs in the case and an opportunity to recover Feldman’s remains, the officials said.\nADVERTISEMENT\nOfficials said the team operated “under fire” during the mission, as they visited a graveyard several times, obtaining various findings that were sent to Israel for identification. Eventually findings matched Feldman’s DNA.\nThe team also found the tank soldier’s overalls, which were identified by the head of the Intelligence Directorate’s missing persons unit, who himself served in the Armored Corps in his youth.\nPrime Minister Benjamin Netanyahu informs relatives of Sgt. First Class Zvi Feldman that his body was recovered, May 11, 2025 (Kobi Gideon/GPO)\nThe remains belonging to Feldman — which were in a complex state due to the passage of time — and his overalls were brought to Israel for identification some two weeks ago. Feldman’s family was notified early Sunday once the identification process was completed.\nA video released by the IDF on Sunday showed the moment the remains were returned to Israel. The clip showed a coffin draped in an Israeli flag, as troops recited the mourner’s Kaddish, the Jewish prayer for the dead.\nThis video released by the IDF on May 11, 2025, shows troops reciting the Jewish prayer for the dead upon receiving the remains of Sgt. First Class Zvi Feldman, who went missing in 1982. (Israel Defense Forces)\n“For decades, Zvika was missing, and the efforts to locate him, along with the other missing soldiers from that same battle, never ceased for a moment,” Prime Minister Benjamin Netanyahu said in a statement.\nThe Mossad, IDF, Netanyahu, and Defense Minister Israel Katz all said Israel would not stop its efforts until the remains of Katz are also returned.\nADVERTISEMENT\n“Just as we returned Zachary Baumel, and today Zvi Feldman, we continue to act in every way to also return Sgt. First Class Yehuda Katz and fulfill our duty for him and his family,” the defense minister said.\nFrom left: Zachary Baumel, Yehuda Katz and Zvi Feldman (Courtesy)\nBaumel’s body was recovered with Russian assistance from the Yarmouk refugee camp, home to one of the largest Palestinian communities in Syria. In 2016, an Israeli tank lost in the battle was returned to Israel by Russia.\nThe IDF has been deployed to nine posts inside southern Syria since the fall of the Bashar al-Assad regime in December, mostly within a UN-patrolled buffer zone on the border between the countries.\nTroops have been operating in areas up to around 15 kilometers (9 miles) deep into Syria, aiming to capture weapons that Israel says could pose a threat to the country if they fall into the hands of “hostile forces.”\nThe Hostages Forum, which represents the majority of relatives of those held captive in Gaza, welcomes the return of Feldman’s body, while calling for the return of the remaining hostages, living and dead.\nIsraeli soldiers carry the coffin of Zachary Baumel at the Mount Herzl Military cemetery in Jerusalem on April 4, 2019. (Hadas Parush/Flash90)\n“The families of the hostages would like to extend a big hug to the Feldman family and to every family that is privileged to bring their loved one to burial,” the forum said in a statement.\n“The return of Zvi Feldman is a moral, ethical and national reminder to the prime minister and members of the government — a grave is not a privilege, but a basic duty of the state to its citizens and fighters. In Israel, no one is left behind,” it said.\n“As a society, we must not normalize a situation in which families have to wait over 40 years or more to be reunited with their loved ones,” it said.\nTerror groups in the Gaza Strip are holding 59 hostages, including 58 of the 251 abducted by Hamas-led terrorists on October 7, 2023. They include the bodies of at least 35 confirmed dead by the IDF, one of whom is a soldier killed a decade ago. Israel has said there are grave concerns for the lives of a further three."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/purge-of-hezbollah-from-beirut-airport-satisfying-israeli-us-officials-report/", "title": "Purge of Hezbollah from Beirut airport satisfying Israeli, US officials — report", "media_type": "article", "date": "11 May 2025, 12:28 pm", "content": "Lebanon has conducted a major overhaul of security at its sole international airport, in Beirut, to prevent smuggling by Hezbollah, satisfying Israeli and US officials and giving them hope that the government will take full control over the country’s ports of entry from the terror group, according to a new report.\nAirport staff linked to Hezbollah have been fired, smugglers have been detained, and new surveillance mechanisms using AI are being deployed at Rafik Hariri International Airport, which is situated in an area of southern Beirut that is controlled by the Iran-backed terror group, The Wall Street Journal reported Saturday.\nIn one recent achievement, Lebanese security thwarted an attempt to smuggle over 22 kilograms (50 pounds) of gold to Hezbollah through the airport, a senior security official told the newspaper.\n“You can feel the difference,” Lebanese Prime Minister Nawaf Salam said. “We’re doing better on smuggling for the first time in the contemporary history of Lebanon.”\nSalam, who was appointed by Lebanon’s new president in January, was also cited as saying that Hezbollah had tried to block plans to construct a second airport for commercial and cargo flights in an area outside the terror group’s control, near the Syrian border in northern Lebanon. The second airport could also serve as an alternative should the Beirut airport be shuttered due to Israeli attacks on Hezbollah targets there, the newspaper said.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nWhile Israeli and US officials reportedly felt there was still work to be done in Lebanon, a senior US official told the newspaper that “there is reason for hope here.”\nA Lebanese army officer shows Lebanese Prime Minister Nawaf Salam, center, an Israeli military position on the horizon, in the southern village of Khiam, February 28, 2025. (Rabih Daher / AFP)\nThe official, who works for the mechanism overseeing the implementation of the November 27 Israel-Hezbollah ceasefire agreement, said “it has only been six or seven months, and we have stepped to a place that I am not sure I thought was achievable back in November.”\nSenior Lebanese security and military officials cited by the Journal said no planes are now exempt from security checks, while flights from Iran have been suspended since February.\nADVERTISEMENT\nThe suspension, triggered by an IDF claim that Iran was smuggling cash to Hezbollah aboard civilian flights, set off massive riots by supporters of the terror group who demanded Iranian flights be let in. At one point, rioters attacked a convoy led by a top officer from the international peacekeeping force UNIFIL, wounding him.\nMeanwhile, the IDF has continued to target Hezbollah operatives and arms caches in southern Lebanon, and maintains some posts in the region after withdrawing from most of it in February.\nThe terror group was required to vacate the area under the November 27 ceasefire agreement, to be replaced by Lebanon’s military and UNIFIL. Last month, an official said the Lebanese military had dismantled over 90% of Hezbollah’s infrastructure near the border with Israel.\nFire from burning tires burns as Hezbollah supporters face off with Lebanese soldiers during a Hezbollah-organized riot to block the road to the airport in Beirut, Lebanon, February 15, 2025. (Ibrahim Amro / AFP)\nIbrahim Mousawi, a Hezbollah member of Lebanon’s parliament, told the Journal that while the terror group sustained heavy losses, it had ways to rearm, saying, “Where there is a will, there is a way.” He also said allegations that Hezbollah controlled the airport were exaggerated: “We are part of the system, just like any other Lebanese constituency.”\nHowever, Lebanon’s former deputy prime minister Ghassan Hasbani said the airport had been “a main port of entry for supporting whatever para-state activities were happening.”\nHasbani, who now represents an anti-Hezbollah bloc in the Lebanese parliament, said authorities had turned “a purposeful blind eye” to the terror group’s use of the Beirut airport. “In the absence of international attention and pressure to do something about it, nothing much was done.”\nADVERTISEMENT\nHezbollah’s standing in domestic politics has taken a blow in the wake of the fighting that began when the terror group attacked Israel on October 8, 2023 — a day after fellow Iran-backed group Hamas stormed southern Israel to kill some 1,200 people and take 251 hostages, sparking the war in Gaza.\nSome 60,000 residents of northern Israel were displaced by Hezbollah’s near-daily attacks. In a bid to secure the residents’ return, the IDF stepped up operations in Lebanon in September, decimating Hezbollah’s leadership.\nView of a large fire caused by rockets fired from Lebanon, in the northern town of Kiryat Shmona, June 3, 2024. (Ayal Margolin/Flash90)\nThe fighting killed thousands of people, according to Lebanon’s health ministry, which does not distinguish between combatants and civilians. The IDF estimated it had killed some 3,500 Hezbollah operatives.\nHezbollah also took a hit with the ouster in December of its powerful ally in Syria, the Iran-backed president Bashar al-Assad. The ouster cut off a land route for arms smuggling from Iran to Lebanon.\nIn January, Lebanon’s parliament elected US-backed President Joseph Aoun, ending a two-year vacancy in the post. Aoun, previously the commander of Lebanon’s armed forces, has vowed to maintain a state monopoly on arms — a veiled threat against Hezbollah, the only armed group not to surrender its arms to the Lebanese state when the country’s 15-year civil war ended in 1990. Aoun has also demanded that Israel vacate its remaining posts in southern Lebanon."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/israel-attacks-yemens-hodeidah-houthi-interior-ministry-says/", "title": "IDF issues ‘urgent’ evacuation warning for three Houthi-controlled ports in Yemen", "media_type": "article", "date": "11 May 2025, 10:38 pm", "content": "The Israel Defense Forces on Sunday evening issued an “urgent” evacuation warning to the three Houthi-controlled ports in western Yemen, ahead of potential Israeli strikes.\nThe warning came after the Houthis fired several ballistic missiles and drones at Israel in recent days, since the Israeli Air Force struck the Houthi-controlled airport in Sanaa and several other facilities last week in response to a Houthi ballistic missile that impacted inside the grounds of Ben Gurion Airport last Sunday.\nIn a post on X, the IDF’s Arabic-language spokesman Col. Avichay Adraee warned those at the Ras Isa, Hodeidah, and Salif ports on the western coast to evacuate.\n“Due to the Houthi terror regime’s use of ports for its terror activities, we urge all those present at these ports to evacuate and stay away from them for your own safety until further notice,” he said.\nA report by Reuters, citing the Houthi interior ministry, claimed that Israel targeted Hodeidah port following the warning. Israeli military sources said no strikes had been carried out as of Sunday night. There were no reports in Houthi media of strikes either.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nOn Friday afternoon, the Houthis fired a ballistic missile that triggered sirens across central Israel. The IDF reported that the missile was successfully intercepted by air defenses.\nDefense Minister Israel Katz warned then that Israel would respond. “The Houthis continue to launch Iranian missiles at Israel. As we promised, we will respond, strongly in Yemen and anywhere else necessary,” he said in a statement.\nThe Friday attack came three days after the US announced that it had reached a ceasefire with the Yemeni terror group.\nHouthi officials made clear that the deal, in which they agreed to stop targeting US maritime activity in the Red Sea in exchange for an end to weeks of intense US airstrikes, did not include any agreement to stop firing at Israel or ships linked to the Jewish state.\nOn Wednesday, the IDF said a missile fired by the Houthis crashed outside Israeli territory. Earlier in the day, the IDF said it had downed a drone launched from Yemen.\nADVERTISEMENT\nThe attacks came after Israel carried out two days of heavy sorties targeting infrastructure controlled by the Houthis in response to the missile that struck Ben Gurion Airport. Since Ben Gurion was hit, most foreign airlines have suspended flights to Israel.\nThe fiery reprisals destroyed the international airport in the capital Sanaa, and caused heavy damage to a port in Hodeida and several power stations and a cement factory, officials said.\nThe Houthis — whose slogan calls for “Death to America, Death to Israel, [and] a Curse on the Jews” — first began attacking Israel and maritime traffic in November 2023, a month after the October 7 Hamas massacre.\nThe Houthis held their fire when a ceasefire was reached between Israel and Hamas in January 2025. By that point, they had fired over 40 ballistic missiles and dozens of attack drones and cruise missiles at Israel, including one that killed a civilian and wounded several others in Tel Aviv in July, prompting Israel’s first strike in Yemen.\nSince March 18, when the IDF resumed its offensive against Hamas in the Gaza Strip, the Houthis have launched some 29 ballistic missiles and at least 10 drones at Israel.\nThe sirens warning of missile attacks have sent hundreds of thousands of Israelis rushing to shelters at all hours of the day and night."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/body-of-soldier-zvi-feldman-missing-for-43-years-recovered-by-mossad-and-idf/", "title": "Body of soldier Zvi Feldman, missing for 43 years, recovered from Syria by Mossad, IDF", "media_type": "article", "date": "11 May 2025, 11:14 am", "content": "The Mossad spy agency and the Israel Defense Forces recovered the remains of Sgt. First Class Zvi Feldman, who went missing in the First Lebanon War’s battle of Sultan Yacoub in 1982, officials announced on Sunday.\nThe battle, nearly 43 years ago, was a skirmish between the IDF and the Syrian army in Lebanon’s Beqaa Valley. It claimed the lives of 21 Israeli servicemen, and more than 30 were injured during it.\nFeldman, a tank soldier, went missing during the battle along with Sgt. First Class Yehuda Katz and Sgt. First Class Zachary Baumel. Baumel’s remains were recovered and returned to Israel in 2019.\n00:00 / 23:33\nIn a joint statement on Sunday, the Mossad and IDF said the body of Feldman was recovered from “the heart of Syria” in a special operation.\nThey said the “complex and covert operation” was made possible by “precise intelligence” and other capabilities, including “intelligence research and collection efforts and many activities and operations in enemy territory.”\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nThe military said the efforts to locate the body had been ongoing for decades.\nThis image released by the IDF on May 11, 2025, shows troops carrying a coffin containing the remains of Sgt. First Class Zvi Feldman, who went missing in 1982. (Israel Defense Forces)\nDefense officials said the operation to recover the remains was carried out by non-Israeli Mossad agents. The team operated deep inside Syria, dozens of kilometers from the Israeli border, to retrieve the body, while risking their lives.\nThe agents, operating on behalf of Mossad, had a cover story and had been inside Syria for several years. In the past five months, following the fall of the Bashar al-Assad regime, there were breakthroughs in the case and an opportunity to recover Feldman’s remains, the officials said.\nADVERTISEMENT\nOfficials said the team operated “under fire” during the mission, as they visited a graveyard several times, obtaining various findings that were sent to Israel for identification. Eventually findings matched Feldman’s DNA.\nThe team also found the tank soldier’s overalls, which were identified by the head of the Intelligence Directorate’s missing persons unit, who himself served in the Armored Corps in his youth.\nPrime Minister Benjamin Netanyahu informs relatives of Sgt. First Class Zvi Feldman that his body was recovered, May 11, 2025 (Kobi Gideon/GPO)\nThe remains belonging to Feldman — which were in a complex state due to the passage of time — and his overalls were brought to Israel for identification some two weeks ago. Feldman’s family was notified early Sunday once the identification process was completed.\nA video released by the IDF on Sunday showed the moment the remains were returned to Israel. The clip showed a coffin draped in an Israeli flag, as troops recited the mourner’s Kaddish, the Jewish prayer for the dead.\nThis video released by the IDF on May 11, 2025, shows troops reciting the Jewish prayer for the dead upon receiving the remains of Sgt. First Class Zvi Feldman, who went missing in 1982. (Israel Defense Forces)\n“For decades, Zvika was missing, and the efforts to locate him, along with the other missing soldiers from that same battle, never ceased for a moment,” Prime Minister Benjamin Netanyahu said in a statement.\nThe Mossad, IDF, Netanyahu, and Defense Minister Israel Katz all said Israel would not stop its efforts until the remains of Katz are also returned.\nADVERTISEMENT\n“Just as we returned Zachary Baumel, and today Zvi Feldman, we continue to act in every way to also return Sgt. First Class Yehuda Katz and fulfill our duty for him and his family,” the defense minister said.\nFrom left: Zachary Baumel, Yehuda Katz and Zvi Feldman (Courtesy)\nBaumel’s body was recovered with Russian assistance from the Yarmouk refugee camp, home to one of the largest Palestinian communities in Syria. In 2016, an Israeli tank lost in the battle was returned to Israel by Russia.\nThe IDF has been deployed to nine posts inside southern Syria since the fall of the Bashar al-Assad regime in December, mostly within a UN-patrolled buffer zone on the border between the countries.\nTroops have been operating in areas up to around 15 kilometers (9 miles) deep into Syria, aiming to capture weapons that Israel says could pose a threat to the country if they fall into the hands of “hostile forces.”\nThe Hostages Forum, which represents the majority of relatives of those held captive in Gaza, welcomes the return of Feldman’s body, while calling for the return of the remaining hostages, living and dead.\nIsraeli soldiers carry the coffin of Zachary Baumel at the Mount Herzl Military cemetery in Jerusalem on April 4, 2019. (Hadas Parush/Flash90)\n“The families of the hostages would like to extend a big hug to the Feldman family and to every family that is privileged to bring their loved one to burial,” the forum said in a statement.\n“The return of Zvi Feldman is a moral, ethical and national reminder to the prime minister and members of the government — a grave is not a privilege, but a basic duty of the state to its citizens and fighters. In Israel, no one is left behind,” it said.\n“As a society, we must not normalize a situation in which families have to wait over 40 years or more to be reunited with their loved ones,” it said.\nTerror groups in the Gaza Strip are holding 59 hostages, including 58 of the 251 abducted by Hamas-led terrorists on October 7, 2023. They include the bodies of at least 35 confirmed dead by the IDF, one of whom is a soldier killed a decade ago. Israel has said there are grave concerns for the lives of a further three."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/purge-of-hezbollah-from-beirut-airport-satisfying-israeli-us-officials-report/", "title": "Purge of Hezbollah from Beirut airport satisfying Israeli, US officials — report", "media_type": "article", "date": "11 May 2025, 12:28 pm", "content": "Lebanon has conducted a major overhaul of security at its sole international airport, in Beirut, to prevent smuggling by Hezbollah, satisfying Israeli and US officials and giving them hope that the government will take full control over the country’s ports of entry from the terror group, according to a new report.\nAirport staff linked to Hezbollah have been fired, smugglers have been detained, and new surveillance mechanisms using AI are being deployed at Rafik Hariri International Airport, which is situated in an area of southern Beirut that is controlled by the Iran-backed terror group, The Wall Street Journal reported Saturday.\nIn one recent achievement, Lebanese security thwarted an attempt to smuggle over 22 kilograms (50 pounds) of gold to Hezbollah through the airport, a senior security official told the newspaper.\n“You can feel the difference,” Lebanese Prime Minister Nawaf Salam said. “We’re doing better on smuggling for the first time in the contemporary history of Lebanon.”\nSalam, who was appointed by Lebanon’s new president in January, was also cited as saying that Hezbollah had tried to block plans to construct a second airport for commercial and cargo flights in an area outside the terror group’s control, near the Syrian border in northern Lebanon. The second airport could also serve as an alternative should the Beirut airport be shuttered due to Israeli attacks on Hezbollah targets there, the newspaper said.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nWhile Israeli and US officials reportedly felt there was still work to be done in Lebanon, a senior US official told the newspaper that “there is reason for hope here.”\nA Lebanese army officer shows Lebanese Prime Minister Nawaf Salam, center, an Israeli military position on the horizon, in the southern village of Khiam, February 28, 2025. (Rabih Daher / AFP)\nThe official, who works for the mechanism overseeing the implementation of the November 27 Israel-Hezbollah ceasefire agreement, said “it has only been six or seven months, and we have stepped to a place that I am not sure I thought was achievable back in November.”\nSenior Lebanese security and military officials cited by the Journal said no planes are now exempt from security checks, while flights from Iran have been suspended since February.\nADVERTISEMENT\nThe suspension, triggered by an IDF claim that Iran was smuggling cash to Hezbollah aboard civilian flights, set off massive riots by supporters of the terror group who demanded Iranian flights be let in. At one point, rioters attacked a convoy led by a top officer from the international peacekeeping force UNIFIL, wounding him.\nMeanwhile, the IDF has continued to target Hezbollah operatives and arms caches in southern Lebanon, and maintains some posts in the region after withdrawing from most of it in February.\nThe terror group was required to vacate the area under the November 27 ceasefire agreement, to be replaced by Lebanon’s military and UNIFIL. Last month, an official said the Lebanese military had dismantled over 90% of Hezbollah’s infrastructure near the border with Israel.\nFire from burning tires burns as Hezbollah supporters face off with Lebanese soldiers during a Hezbollah-organized riot to block the road to the airport in Beirut, Lebanon, February 15, 2025. (Ibrahim Amro / AFP)\nIbrahim Mousawi, a Hezbollah member of Lebanon’s parliament, told the Journal that while the terror group sustained heavy losses, it had ways to rearm, saying, “Where there is a will, there is a way.” He also said allegations that Hezbollah controlled the airport were exaggerated: “We are part of the system, just like any other Lebanese constituency.”\nHowever, Lebanon’s former deputy prime minister Ghassan Hasbani said the airport had been “a main port of entry for supporting whatever para-state activities were happening.”\nHasbani, who now represents an anti-Hezbollah bloc in the Lebanese parliament, said authorities had turned “a purposeful blind eye” to the terror group’s use of the Beirut airport. “In the absence of international attention and pressure to do something about it, nothing much was done.”\nADVERTISEMENT\nHezbollah’s standing in domestic politics has taken a blow in the wake of the fighting that began when the terror group attacked Israel on October 8, 2023 — a day after fellow Iran-backed group Hamas stormed southern Israel to kill some 1,200 people and take 251 hostages, sparking the war in Gaza.\nSome 60,000 residents of northern Israel were displaced by Hezbollah’s near-daily attacks. In a bid to secure the residents’ return, the IDF stepped up operations in Lebanon in September, decimating Hezbollah’s leadership.\nView of a large fire caused by rockets fired from Lebanon, in the northern town of Kiryat Shmona, June 3, 2024. (Ayal Margolin/Flash90)\nThe fighting killed thousands of people, according to Lebanon’s health ministry, which does not distinguish between combatants and civilians. The IDF estimated it had killed some 3,500 Hezbollah operatives.\nHezbollah also took a hit with the ouster in December of its powerful ally in Syria, the Iran-backed president Bashar al-Assad. The ouster cut off a land route for arms smuggling from Iran to Lebanon.\nIn January, Lebanon’s parliament elected US-backed President Joseph Aoun, ending a two-year vacancy in the post. Aoun, previously the commander of Lebanon’s armed forces, has vowed to maintain a state monopoly on arms — a veiled threat against Hezbollah, the only armed group not to surrender its arms to the Lebanese state when the country’s 15-year civil war ended in 1990. Aoun has also demanded that Israel vacate its remaining posts in southern Lebanon."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/tehran-says-4th-round-of-nuclear-talks-difficult-while-us-encouraged/", "title": "Tehran says 4th round of nuclear talks difficult, while US ‘encouraged’", "media_type": "article", "date": "11 May 2025, 9:44 pm", "content": "Iran and the United States wrapped up nuclear talks in Oman on Sunday with no apparent breakthrough and a public standoff over enrichment, but with both sides confirming plans for future negotiations.\nIt was the fourth round of the talks that began a month ago, marking the highest-level contact between the two foes since Washington withdrew in 2018 from a landmark nuclear deal during President Donald Trump’s first term.\nBoth sides had reported progress in the previous three rounds, and on Sunday, Iran said the meeting was “difficult but useful,” while a senior US official said Washington was “encouraged.”\n00:00 / 23:33\nIn a post on X, Iran’s foreign ministry spokesman Esmaeil Baqaei said the talks could help “better understand each other’s positions and to find reasonable and realistic ways to address the differences.”\nBaqaei earlier said negotiators would push for relief from US sanctions.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nThe US official, speaking on condition of anonymity, said Washington was “encouraged by today’s outcome and look(s) forward to our next meeting, which will happen in the near future,” without specifying when.\nThis handout picture provided by the Iranian Foreign Ministry on May 11, 2025, shows Iran’s Foreign Minister Abbas Araghchi (C) being welcomed upon his arrival in Muscat (Iranian Foreign Ministry / AFP)\nBaqaei said that the “next round will be coordinated and announced by Oman.”\nAccording to the US official, the talks were “both direct and indirect, and lasted over three hours.”\nADVERTISEMENT\n“Agreement was reached to move forward” and “continue working through technical elements,” the official added.\nIran entered the talks saying that its right to maintain uranium enrichment was “non-negotiable,” while Washington’s chief negotiator Steve Witkoff has said that the American demand to stop enrichment is a “red line.”\nIranian Foreign Minister Abbas Araghchi, who led Tehran’s delegation, said in a video before departing for the Omani capital Muscat that “enrichment capability is one of the honors” of Iran.\nUS President Donald Trump, left, shakes hands with Assistant to the President, Senior Adviser and Special Envoy Steve Witkoff after Witkoff’s swearing-in ceremony in the Oval Office of the White House in Washington, DC, on May 6, 2025. (Jim WATSON / AFP)\n‘Pressure’\nThe talks come amid a flurry of diplomatic activity in the region, with Trump heading to the Gulf for his first major foreign tour next week, and Araghchi just back from Saudi Arabia and Qatar.\nThe fourth round that took place on Sunday was initially scheduled for May 3, but was delayed, with mediator Oman citing “logistical reasons.”\nYousuf Al Bulushi, chairman of the Muscat Policy Council think tank, said that a breakthrough “will take quite some time, but I’m optimistic.”\nADVERTISEMENT\nHe warned, however, that both sides had lost precious time during past negotiations, trying to clarify public statements “instead of focusing solely on talks.”\nPublic pressure “is a tactic in negotiations… but this is really impacting the atmosphere” at the table, said Bulushi.\nWestern countries, including the United States, have long accused Iran of seeking to acquire nuclear weapons, while Tehran insists that its nuclear program is for peaceful purposes.\nA handout picture provided by the Iranian presidency shows Iran’s President Masoud Pezeshkian (2nd R) and the Atomic Energy Organisation of Iran (AEOI) chief Mohammad Eslami (R) during the ‘National Day of Nuclear Technology,’ in Tehran, on April 9, 2025 (Iranian Presidency / AFP)\nIran currently enriches uranium to 60-percent purity — far above the 3.67% limit set in the 2015 deal with the United States and other world powers, and a short technical step from the 90% needed for weapons-grade material. Tehran regularly threatens to destroy Israel, and its uranium enrichment level is far higher than necessary for civilian uses.\nWitkoff, Trump’s Middle East envoy, said in a Friday interview that Iran’s “enrichment facilities have to be dismantled.”\n“That’s our red line. No enrichment. That means dismantlement. It means no weaponization. And it means that Natanz, Fordow and Isfahan — those are their three enrichment facilities — have to be dismantled,” he told US right-wing outlet Breitbart News, after initially suggesting flexibility on Tehran maintaining low-level enrichment of uranium for civilian purposes.\nAraghchi has repeatedly defended Iran’s right to enrich uranium.\nForeign Minister Gideon Saar visits at the Yad Vashem Holocaust Memorial museum in Jerusalem on May 11, 2025 (Yonatan Sindel/Flash90)\n‘World’s most dangerous weapon’\nAt a press conference in Jerusalem on Sunday, Foreign Minister Gideon Sa’ar said Iran’s uranium enrichment facilities “must be dismantled,” and that the US and Israel agree on this issue.\nADVERTISEMENT\n“The most dangerous regime must not be allowed to obtain the world’s most dangerous weapon,” he said.\nSa’ar said he “agrees very much” with comments made over the weekend by Witkoff, who said enrichment facilities “have to be dismantled” for Washington to take it at its word that it does not want nuclear arms.\n“I think this is the right approach and we hold the same view on the matter,” Sa’ar said.\nAsked whether Israel is concerned about recent foreign policy moves by Trump that seemed to sideline Jerusalem on key regional issues, Sa’ar said, “We are coordinated. It doesn’t mean we must fully agree one hundred percent on every issue.”\n“The US is a sovereign state, Israel is a sovereign state. But I believe that we have very, very big common grounds with positions in this US administration, more than in the past…I think the US is our greatest friend and President Trump is a great friend of Israel, and we will work together; we are working together,” he added.\nSa’ar noted that “there is no other world leader” with whom Trump has spent more time than Prime Minister Benjamin Netanyahu.\nA woman walks past a billboard bearing portraits of slain Iranian and Lebanese and Palestinian terror leaders in Tehran’s Enghelab square on May 11, 2025. (ATTA KENARE / AFP)\nNetanyahu, who is deeply skeptical of the Iran-US talks, has called for all of Tehran’s nuclear facilities to be dismantled and for its ballistic missile program to be stopped as part of any credible deal.\nADVERTISEMENT\nTehran has insisted that the talks be solely focused on the nuclear issue and the lifting of sanctions, ruling out negotiations on military capabilities.\nJerusalem is reportedly unhappy with the state of the talks, which were said to be developing into a largely similar framework to the 2015 Joint Comprehensive Plan of Action, or JCPOA, which was signed by then-US president Barack Obama and was panned at the time by Netanyahu as disastrous for Israel. Trump also maligned the accord before withdrawing from it in 2018."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/iran-vows-not-to-back-down-from-its-nuclear-rights-as-talks-with-us-set-to-resume/", "title": "Iran vows not to back down from its ‘nuclear rights,’ as talks with US set to resume", "media_type": "article", "date": "11 May 2025, 4:27 am", "content": "DUBAI, United Arab Emirates — Iranian Foreign Minister Abbas Araghchi said on Saturday that if the United States’ goal was to deprive Iran of its “nuclear rights,” Tehran would never back down on that front.\nAraghchi was speaking in Doha a day ahead of another round of planned nuclear talks between Iran and the US in Oman.\n“If the goal of the negotiations is to deprive Iran of its nuclear rights, I state clearly that Iran will not back down from any of its rights,” state media quoted Araghchi as saying.\n00:00 / 23:33\nIran has repeatedly said its right to enrich uranium is non-negotiable and has ruled out a “zero enrichment” demand by some US officials.\nBut US President Donald Trump’s special envoy, Steve Witkoff, said in an interview on Friday that Iran’s “enrichment facilities have to be dismantled” under any accord with the United States.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nTrump, who withdrew Washington from a 2015 deal between Tehran and world powers meant to curb its nuclear activity, has threatened to bomb Iran if no new deal is reached to resolve the long-unresolved dispute.\nUS President Donald Trump, left, shakes hands with Assistant to the President, Senior Adviser and Special Envoy Steve Witkoff after Witkoff’s swearing-in ceremony in the Oval Office of the White House in Washington, DC, on May 6, 2025. (Photo by Jim WATSON / AFP)\nWestern countries say Iran’s nuclear program, which Tehran accelerated after the US walkout from the now moribund 2015 accord, is geared toward producing weapons, whereas Iran insists it is purely for civilian purposes. However, Tehran regularly threatens to flatten Israeli cities and is currently enriching uranium to levels that have no civilian use.\n“In its indirect talks with the United States, Iran emphasizes its right to peaceful use of nuclear energy and clearly declares that it is not seeking nuclear weapons,” Araghchi claimed.\nADVERTISEMENT\n“Iran continues negotiations in good faith, and if the goal of these talks is to ensure the non-acquisition of nuclear weapons, an agreement is possible. However, if the aim is to limit Iran’s nuclear rights, Iran will never retreat from its rights.”\nWitkoff was set to travel to Oman on Sunday for the fourth round of Omani-mediated talks with Araghchi, a source familiar with the matter said. The fourth round of negotiations, initially scheduled for May 3 in Rome, was postponed, with mediator Oman citing “logistical reasons.”\nAraghchi visited Saudi Arabia and Qatar on Saturday, a day before the fourth round of negotiations and days before Trump is expected to visit those countries. Trump is scheduled to visit Saudi Arabia, Qatar and the United Arab Emirates from May 13 to 16 on his first major Middle East trip of his second term. The president is not expected to visit Israel on the trip.\nIran’s Foreign Minister Abbas Araghchi speaks to the media during the signing ceremony for his book ‘The Power of Negotiation’ at the Muscat International Book fair in Oman, April 25, 2025. (Haitham AL-SHUKAIRI / AFP)\nTrump provoked Araghchi’s ire earlier this month by indicating that the US would decide what to call the Persian Gulf, following reports that Washington could officially rename it the Gulf of Arabia. Araghchi condemned the decision as showing “hostile intent toward Iran and its people.”\nAhead of the trip, Trump had predicted that Saudi-Israel normalization would happen “very quickly.” However, sources cited by Reuters have said Trump has dropped the demand that Saudi Arabia normalize relations with Israel as a condition for progress on a civil nuclear program.\nJacob Magid and agencies contributed to this report."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/witkoff-iran-must-dismantle-uranium-enrichment-facilities-ship-material-far-away/", "title": "Witkoff: Iran must dismantle uranium enrichment facilities, ship material ‘far away’", "media_type": "article", "date": "10 May 2025, 12:10 am", "content": "US special envoy to the Middle East Steve Witkoff, who is set to resume nuclear talks with Iran on Sunday, has said the Islamic Republic’s uranium enrichment facilities “have to be dismantled” for Washington to take it at its word that it does not want nuclear arms.\n“They cannot have centrifuges. They have to downblend all of their fuel that they have there and send it to a far-away place,” Witkoff said in an interview with right-wing US news outlet Breitbart on Thursday. “An enrichment program can never exist in the state of Iran ever again. That’s our red line.”\n“I just believe they have no choice” but to accept the position of US President Donald Trump against enrichment, said Witkoff. “Obviously, they can say no, and they can test President Trump, but I think that would be an unwise thing to do.”\n00:00 / 23:33\nThe comments came after Witkoff last month said the US would seek only to cap Iran’s uranium enrichment, but not end it altogether, contrary to the position of Israeli Prime Minister Benjamin Netanyahu. Witkoff quickly backtracked, saying any nuclear deal with Iran “must stop and eliminate its nuclear enrichment and weaponization program.”\nSpeaking to Breitbart, Witkoff said Iran would have to dismantle its three known enrichment facilities in Natanz, Fordow and Isfahan. On the other hand, he said, the Iranians could hold onto their nuclear reactor in Bushehr, where “they have no ability to enrich, they have no ability to have centrifuges there, they can only use that facility for civilian purposes — making electricity and things of that sort of civilian purposes.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\n“If that is what they choose to do, if they believe in that program, they ought to expand it if they want to,” said Witkoff, adding that his goal in the nuclear talks was to get Tehran to “voluntarily shift away from an enrichment program.”\nThis October 26, 2010, photo shows the reactor building of the Bushehr nuclear power plant just outside the southern city of Bushehr, Iran. (AP Photo/Mehr News Agency, Majid Asgaripour)\n“If we can get them to voluntarily do that, that is the most permanent way to make sure that they never get a weapon,” he said.\nIran, whose leaders are sworn to destroy Israel, says it opposes nuclear weapons. However, the Islamic Republic is enriching uranium to 60% — far higher than necessary for civilian uses, and a short step away from weapons-grade.\nADVERTISEMENT\nIran also funds a regional network of anti-Israel proxies, including Gaza’s Hamas, Lebanon’s Hezbollah and Yemen’s Houthis. Getting Iran to stop arming those groups is a “secondary discussion,” Witkoff told Breitbart.\n“We don’t want to confuse the nuclear discussion because that to us is the existential issue,” said Witkoff. “That’s the issue that needs to be solved today and quickly.”\nWitkoff is set to travel to Oman on Sunday for the fourth round of Omani-mediated talks with Iranian Foreign Minister Abbas Araghchi, a source familiar with the matter said, as Iran’s semi-official Tasnim news cited an Iranian negotiator as saying Tehran had agreed to resume talks.\nThe fourth round of negotiations, initially scheduled for May 3 in Rome, was postponed, with mediator Oman citing “logistical reasons.”\nIranian Foreign Minister Abbas Araghchi attends a news conference following his meeting with Russian Foreign Minister Sergey Lavrov in Moscow, Russia, April 18, 2025. (Tatyana Makeyeva/Pool Photo via AP)\nWitkoff told Breitbart that the fourth round had been delayed because “we didn’t think that the talks last week were going to be productive, because we needed to get to certain understandings with them, and hopefully this Sunday they will be productive.”\nWitkoff was reportedly engaged over the past week in talks with Omani and Houthi officials that resulted in a US ceasefire in Yemen, announced by Trump on Tuesday. Sources cited by CNN said the US-Houthi truce talks aimed to provide momentum for the Iran nuclear talks.\nADVERTISEMENT\nThe truce did not include a commitment by the Yemeni rebels to stop attacking Israel, and apparently caught Jerusalem by surprise — much like Trump’s announcement of the Iran nuclear talks last month.\nTrump, in his first term, scrapped the 2015 Iran nuclear deal, dubbed the Joint Comprehensive Plan of Action, which had promised Iran sanctions relief in exchange for greater oversight over its nuclear program. Netanyahu had railed against that deal, arguing that it kept in place Iran’s capacity to produce nuclear arms.\nWitkoff told Breitbart that “we’re never doing a JCPOA deal,” saying the agreement had a “mismatched procedure.”\nUS President Donald Trump waits to greet Canadian Prime Minister Mark Carney at the West Wing of the White House, May 6, 2025, in Washington. (AP Photo/Mark Schiefelbein)\n“We believe that they cannot have enrichment, they cannot have centrifuges, they cannot have anything that allows them to build a weapon. We believe in all of that. That was not JCPOA,” said Witkoff.\n“JCPOA had sunset provisions that burned off the obligations and burned off the sanctions relief at inappropriate times. It’s never going to happen in this deal,” he said.\nWitkoff stressed that Trump, who is expected to visit the Middle East next week, prefers a diplomatic rather than military solution to the Iranian nuclear threat.\nWitkoff said critics of his diplomacy included a “neocon element” that “believes war is the only way to solve things.”\n“Neocon,” or neo-conservative, refers in US political parlance to politicians who support intervention in foreign conflicts. The term is often used derisively by Trump’s isolationist supporters.\nADVERTISEMENT\nIranian diplomats and officials from the P5+1 powers meet in Vienna to discuss the 2015 nuclear accord on April 25, 2017. (AFP/Joe Klamar)\nWitkoff’s comment came after Trump last week fired US National Security Adviser Mike Waltz, in part, reportedly, over the latter’s hawkish views on Iran and intense coordination with Netanyahu on a potential military strike there.\nWitkoff said his neo-conservative critics “give no consideration whatsoever on what the consequences are” for military action, and are certain that Iran will manipulate Witkoff if it is not handled with force.\n“They may attempt to manipulate me. I don’t think they’re going to be able to manipulate me,” said Witkoff. “If the Iranians make the mistake of thinking they can procrastinate at the table, then they won’t see that much of me.\n“The alternative, as the president says, will be a bad alternative for them,” he said. Trump “believes that his force of personality… can bend people to do things in a better way in the interests of the United States government,” said Witkoff, adding: “I believe in that too.”\nAraghchi to consult with Saudi counterparts\nAraghchi, Witkoff’s interlocutor in the nuclear talks, is set to visit Saudi Arabia and Qatar on Saturday, a day before the fourth round of negotiations and days before Trump is expected to visit those countries, Iran’s foreign ministry said in a statement Friday.\nAraghchi is due to hold talks with senior Saudi officials in Riyadh before heading to Doha for a conference on Arab-Iranian dialogue, the ministry said. The Iranian top diplomat later said meetings in Saudi Arabia would cover the latest on the nuclear talks with Washington.\nIran’s Foreign Minister Abbas Araghchi speaks to the media during the signing ceremony for his book ‘The Power of Negotiation’ at the Muscat International Book fair in Oman, April 25, 2025. (Haitham AL-SHUKAIRI / AFP)\nIn a video carried by Iranian media, Araghchi said Tehran believes “the sustainability of any possible agreement depends to a large extent on taking into account the considerations and concerns of the countries of the region in the nuclear field,” and those countries’ common interests with Iran.\nADVERTISEMENT\nTrump is scheduled to visit Saudi Arabia, Qatar and the United Arab Emirates from May 13 to 16 on his first major Middle East trip of his second term. The president is not expected to visit Israel on the trip.\nTrump provoked Araghchi’s ire earlier this week by indicating that the US would decide how to call the Persian Gulf, following reports that Washington could officially rename it the Gulf of Arabia. Araghchi condemned the decision as showing “hostile intent toward Iran and its people.”\nAhead of the trip, Trump had predicted that Saudi-Israel normalization would happen “very quickly.” However, sources cited by Reuters this week said Trump had dropped the demand that Saudi Arabia normalize relations with Israel as a condition for progress on a civil nuclear program.\nAgencies contributed to this report."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/irgc-chief-vows-to-open-the-gates-of-hell-if-us-israel-make-wrong-move/", "title": "Iran’s IRGC chief vows to ‘open the gates of hell’ if US, Israel make ‘wrong move’", "media_type": "article", "date": "9 May 2025, 9:13 am", "content": "The head of Iran’s powerful Islamic Revolutionary Guard Corps on Thursday threatened to “open the gates of hell” on Israel and the United States if the countries attack his country, warning Washington that its ally was pushing it into war.\n“These are serious warnings to Zionist officials, to US officials. The criminal prime minister of the Zionist regime talks a lot these days, threatens Iran,” IRGC chief Hossein Salami said in a speech, according to the Iran International news site.\n“I’m issuing a serious warning: If you make one wrong move, we will open up the gates of hell on you,” Salami added. “Sit down and stay in your place…we have made extensive preparations.”\n“If you make a mistake, we’ll act on you in a way that you forget the True Promise 1 and 2,” he added, referring to two direct Iranian attacks on Israel last year.\n“If the US threatens us on the nuclear issue, Iran is prepared for war at all levels and in all arenas,” Salami also said, according to Hebrew media reports. He added, accusing Israel of working to increase tensions between the countries: “Israel is pushing the United States into war in the region, but Washington needs to understand that such a war would be a great loss for it.”\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nThe remarks came after US President Donald Trump indicated Wednesday that he is seeking to “blow up” Iran’s nuclear centrifuges through an agreement, but is also prepared to blow them up in an attack if necessary.\nPrime Minister Benjamin Netanyahu (center), Defense Minister Israel Katz (left) and IDF Chief of Staff Lt. Gen. Eyal Zamir oversee airstrikes in Yemen, at the Defense Ministry headquarters, Tel Aviv, May 5, 2025. (Ariel Hermoni/Defense Ministry)\nThe US and Iran are conducting talks over limiting Iran’s nuclear program, but the US administration’s desired outcome for the talks is unclear, with some officials saying they are prepared to allow Iran to have limited nuclear fuel enrichment capabilities, while others have said that they want the nuclear program completely destroyed.\nIranian officials have asserted that they will never dismantle their nuclear centrifuges.\nADVERTISEMENT\nThe US and other Western countries have long accused Iran of pursuing nuclear weapons — a claim Tehran denies, insisting that its atomic program is solely for civilian purposes. But Iran, which openly seeks Israel’s destruction, has ramped up its enrichment of uranium to 60 percent purity, which has no peaceful application, and has obstructed international inspectors from checking its nuclear facilities.\nPrime Minister Benjamin Netanyahu and Defense Minister Israel Katz issued a warning to Iran on Tuesday after the Israeli military bombed targets belonging to the Iran-backed Houthi terrorists in Yemen for a second day, destroying the international airport in Sanaa.\n“I have said many times that whoever attacks Israel — his blood will be on his own head,” says Netanyahu, noting his promise that there would be multiple “blows” in response to a Houthi missile that struck inside the grounds of Ben Gurion International Airport on Sunday.\nHe said the choice and timing of targets was meant to punish the Houthis, but also to send a message to Iran, “without whose approval and long-term support, the Houthis could not carry out the criminal missile attack against us.”\nMissiles launched from Iran towards Israel are seen in the West Bank city of Nablus, October 1, 2024. (AP Photo/Majdi Mohammed)\nIran launched its first-ever direct attack on Israel in April 2024, firing some 300 attack drones and missiles in response to the killing of several Islamic Revolutionary Guard Corps members in an airstrike near Tehran’s consulate in Damascus.\nMonths later, in October, Iran launched some 200 ballistic missiles at Israel in retaliation for the killings of Hassan Nasrallah and Ismail Haniyeh, the leaders of Hezbollah and Hamas, respectively.\nIn both instances, the Iranian assaults were largely thwarted by Israel’s air defenses in cooperation with the US and its regional allies. Israel twice bombed Iran in response, the second time destroying much of its air defense systems as well as some rocket and drone manufacturing sites."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/trumps-meeting-with-saudi-ruler-said-set-to-include-leaders-of-pa-lebanon-syria/", "title": "Trump’s meeting with Saudi ruler said set to include leaders of PA, Lebanon, Syria", "media_type": "article", "date": "11 May 2025, 2:59 pm", "content": "US President Donald Trump’s meeting with Saudi Crown Prince Mohammed bin Salman in Riyadh on Tuesday is also set to include Palestinian Authority President Mahmoud Abbas, Lebanese President Joseph Aoun and Syria’s de facto leader, Ahmed al-Sharaa, Arabic media reported Sunday.\nCiting an informed source who declined to be identified, Palestinian newspaper Al-Quds said the Saudi prince “looks forward to Trump’s agreement to the Saudi condition of establishing a Palestinian state.” Trump had said in February that Saudi Arabia was no longer demanding Palestinian statehood as a condition for normalizing ties with Israel, a statement that at the time drew an urgent Saudi denial.\nAccording to the source cited by Al-Quds, Trump had acceded to bin Salman’s request to include the other Arab leaders in the meeting, which will come at the start of Trump’s visit to Saudi Arabia, Qatar and the United Arab Emirates between May 13 and 16.\nTrump will not be visiting Israel, whose government accuses both Abbas and Sharaa of supporting terrorism.\nThe US president predicted ahead of his trip that Saudi-Israeli normalization would happen “very quickly,” but in the meantime, he has reportedly dropped normalization with Israel as a condition for progress on Saudi Arabia’s civilian nuclear program.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nIt had been reported Saturday that Trump would announce US recognition of Palestinian statehood, but Washington’s envoy to Israel Mike Huckabee dismissed the report as “nonsense.”\nUS President Donald Trump, right, shakes hands with Saudi Deputy Crown Prince and Defense Minister Mohammed bin Salman during a bilateral meeting, in Riyadh, May 20, 2017. (Evan Vucci/AP)\nIsrael-Saudi normalization seemed just around the corner before the Hamas onslaught of October 7, 2023, that started the war in Gaza. Two Israeli ministers made unprecedented state visits to the desert kingdom in the weeks before the shock assault that sparked the war in Gaza. But the prospect of normalization faded as anti-Israel sentiment reached new heights in the Muslim world amid the war.\nDuring his first term, Trump brokered the Abraham Accords normalization agreements between Israel, the UAE, Morocco, Sudan and Bahrain, partly in exchange for Israel backing away from a plan to annex the West Bank, the seat of the Palestinian Authority.\nADVERTISEMENT\nTrump in his first term also proposed a solution to the Israeli-Palestinian conflict that would have seen a truncated Palestinian state established in parts of the West Bank, Gaza and the Negev Desert. The plan was rejected outright by both the PA and Prime Minister Benjamin Netanyahu’s pro-settler coalition partners.\nIsrael has long accused the PA of inciting violence against Jews in its school system and through stipends paid to families of Palestinian terrorists detained in Israeli prisons. Abbas ordered an end to the so-called play-to-play system in February, less than a month after Trump took office for the second time.\nFrom left, Bahrain Foreign Minister Khalid bin Ahmed Al Khalifa, Prime Minister Benjamin Netanyahu, then-US president Donald Trump, and United Arab Emirates Foreign Minister Abdullah bin Zayed al-Nahyan, sit during the Abraham Accords signing ceremony on the South Lawn of the White House, in Washington, September 15, 2020. (AP Photo/Alex Brandon, File)\nThe meeting in Riyadh on Tuesday comes as Trump has reportedly expressed frustration over the failure to reach a ceasefire in Gaza, which has been devastated over 19 months of war. The PA had previously threatened to cut ties with Trump over a plan he announced in February to take over Gaza, oust its residents and rebuild the devastated Strip as a coastal resort.\nA rival Egyptian plan for postwar Gaza would have ultimately handed the Strip over to the PA, but Netanyahu has rejected any role for the unpopular body in Gaza’s postwar governance.\nSeparately, Israel has maintained troop presence and carried out military strikes in southern Lebanon following the ceasefire with Hezbollah in November, and ib the Syrian side of the Golan Heights following Sharaa’s ouster in December of Syria’s Iran-backed president Bashar al-Assad. Both Lebanese President Aoun and Syria’s Sharaa have demanded that Israel withdraw from their respective countries."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/trump-aims-for-historic-return-to-region-taking-in-saudi-arabia-qatar-uae-not-israel/", "title": "Trump aims for ‘historic return’ to region, taking in Saudi Arabia, Qatar, UAE, not Israel", "media_type": "article", "date": "10 May 2025, 10:20 pm", "content": "US President Donald Trump heads for Saudi Arabia, Qatar and the United Arab Emirates on Monday, eyeing big business deals even as accords on the Middle East’s hotspots will be harder to seal.\nWhile Israel’s war against Gaza terror groups and Iran’s nuclear program will loom large over Trump’s first major foreign trip of his second term, the White House said he looked forward to a “historic return” to the region.\nEight years ago, Trump also chose Riyadh for his first overseas trip as president — when he memorably posed over a glowing orb with the leaders of Egypt and Saudi Arabia.\n00:00 / 23:33\nHis decision to once more bypass traditional Western allies to visit the oil-rich Gulf states underscores their increasingly pivotal geopolitical role — as well as his own business ties there.\n“It’s hard for me to escape the idea that President Trump is going to the Gulf because this is his happy place,” said Jon Alterman, director of the Middle East program at the Center for Strategic and International Studies.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\n“His hosts will be generous and hospitable. They’ll be keen to make deals. They’ll flatter him and not criticize him, and they’ll treat his family members as past and future business partners.”\nUS President Donald Trump (center-left), Saudi Arabia’s King Salman (center-right), and other leaders pose for a group photo during the Arabic Islamic American Summit at the King Abdulaziz Conference Center in Riyadh on May 21, 2017. (AFP/MANDEL NGAN)\n‘Historic return’\nRiyadh, Doha and Abu Dhabi are expected to pull out all the stops for Trump, who’s making his first major overseas trip after briefly attending the funeral of Pope Francis in Rome. His visit is due to begin on May 13 in Riyadh.\nThe wealthy Arab states will mix pomp and ceremony for the 78-year-old billionaire with deals that could span defense, aviation, energy and artificial intelligence.\nADVERTISEMENT\n“The president looks forward to embarking on his historic return to the Middle East” to promote a vision where “extremism is defeated [through] commerce and cultural exchanges,” spokeswoman Karoline Leavitt said Friday.\nBut he will not be able to avoid the long list of regional crises, including the war between Israel and Hamas in Gaza, the Houthi rebels in Yemen, and Syria’s post-Assad turmoil.\nUS President Donald Trump, second left, shakes hands with Qatar’s Emir Sheikh Tamim Bin Hamad Al-Thani, left, during a bilateral meeting, May 21, 2017, in Riyadh. Seated with them are: Then US secretary of state Rex Tillerson, third right, White House senior adviser Jared Kushner, second right, and then US National Security Adviser H.R. McMaster. (AP Photo/Evan Vucci)\nThe Gulf states have played a key diplomatic role under Trump 2.0. Qatar has been a major broker between Hamas and Israel, while Saudi Arabia has facilitated talks on the war in Ukraine.\n“Trump is coming to the Gulf first because this region has become a geopolitical and financial center of gravity,” Anna Jacobs, non-resident fellow at the Arab Gulf States Institute in Washington, told AFP.\nIn Riyadh, Trump will meet the leaders of the six Gulf Cooperation Council states: Saudi Arabia, the UAE, Bahrain, Qatar, Kuwait and Oman.\nBut one place that is not on the itinerary is Israel, the United States’ closest ally in the region.\nADVERTISEMENT\nThat has sparked speculation about tensions between Trump and Israeli Prime Minister Benjamin Netanyahu.\nUS President Donald Trump, left, greets Prime Minister Benjamin Netanyahu at the White House, April 7, 2025, in Washington. (AP/Evan Vucci)\nIsrael has set Trump’s trip as the deadline for a ceasefire deal with Hamas before launching a planned major offensive in Gaza.\nTrump has, however, taken an increasingly hands-off approach, although the United States says it is working with Israel on a US-led plan to get aid into the blockaded enclave, which hasn’t received aid in over two months, since a ceasefire-hostage deal collapsed. Israel and the US say Hamas diverts the aid and uses it to maintain control over the Strip.\nThe war in Gaza began when Hamas-led terrorists invaded southern Israel, killing 1,200 people, mostly civilians, and taking 251 hostages back to Gaza, 58 of whom remain captive in the enclave. The body of an additional IDF soldier who was kidnapped a decade ago is also being held by Hamas.\nDue to the ongoing war, efforts to get Saudi Arabia to recognize Israel, which Trump also sought during his first term, are likely to stay on the burner, as Riyadh says it first needs to see progress toward a Palestinian state, which has been a nonstarter for Jerusalem.\nTrump told Time magazine last month that Saudi Arabia will join the Abraham Accords— the series of normalization agreements that his previous administration brokered between Israel and several Arab states. “That will happen,” he said.\nReuters reported this week, however, that the US is no longer demanding Saudi Arabia normalize ties with Israel as a condition for progress on civil nuclear cooperation talks.\nEarlier this month, the US gave initial approval to sell $3.5 billion worth of air-to-air missiles for Saudi Arabia’s fighter jets, the latest proposed arms deal for the region ahead of Trump’s trip.\nADVERTISEMENT\nThe sale will likely be one of several heralded by Trump on his visit to the kingdom, AP reported, noting that Saudi Arabia has already said it wants to invest $600 billion in the United States over the next four years.\nPeople walk past an electronic billboard that shows US President Donald Trump, left, shaking hands with Saudi Crown Prince Mohammed bin Salman with the pro-normalization message ‘We are ready,’ in Tel Aviv, February 3, 2025. (AP Photo/ Ariel Schalit)\n‘Monetizing MAGA’\nIran will also be high on the agenda. Washington and Tehran will hold the latest round of indirect talks on Iran’s nuclear program in Oman on Sunday.\nIran reacted furiously after Trump said he was deciding whether to announce during the trip that he would change how the United States refers to the Gulf, from the Persian Gulf to the Gulf of Arabia.\nOne thing that the White House says won’t be on the agenda is Trump’s own businesses.\nLast month, the Trump Organization struck its first luxury real estate deal in Qatar, and released details of a billion-dollar skyscraper in Dubai whose apartments can be bought in cryptocurrency.\n(R to L ) The Trump Organisation executive vice-president Eric Trump, World Liberty Financial co-founder Zach Witkoff and cryptomoney exchange Tron Justin Sun, participate in a session during the Token 2049 crypto conference in Dubai on May 1, 2025. (Giuseppe CACACE / AFP)\nTrump’s son Eric was promoting a crypto firm in Dubai while Don Jr prepared to talk about “Monetizing MAGA” in Doha.\nBut the White House denied Trump was cashing in.\nADVERTISEMENT\n“It’s frankly ridiculous that anyone… would even suggest that President Trump is doing anything for his own benefit,” Leavitt said.\nTimes of Israel staff contributed to this report."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/saudi-israel-deal-remains-elusive-as-trump-visits-in-bid-for-1-trillion-bonanza/", "title": "Saudi-Israel deal remains elusive as Trump visits in bid for $1 trillion bonanza", "media_type": "article", "date": "11 May 2025, 2:49 pm", "content": "When US President Donald Trump lands in Riyadh on Tuesday, he will be greeted with opulent ceremonies, gilded palaces, and the prospect of $1 trillion in investments. But the raging war in Gaza has denied him one goal he has long craved: Saudi-Israel normalization.\nBehind the scenes, US officials are quietly pressing Israel to agree to an immediate ceasefire in Gaza — one of Saudi Arabia’s preconditions for any restart of normalization talks, said two Gulf sources close to official circles and a US official.\nTrump’s Middle East envoy Steve Witkoff told an audience at the Israeli embassy in Washington this week that he imminently expected progress on expanding the Abraham Accords, a set of deals brokered by Trump in his first term under which several Arab states — the UAE, Bahrain, Sudan, and Morocco — recognized Israel.\n00:00 / 23:33\nHowever, opposition by Prime Minister Benjamin Netanyahu to a permanent stop to the war or to the creation of a Palestinian state makes progress on similar talks with Riyadh unlikely, two of the sources said.\n“We think we will have some or a lot of announcements very, very shortly, which we hope will yield progress by next year,” Witkoff said in a video of his speech. He is expected to accompany Trump on his visit to the Middle East.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nSaudi Arabia does not recognize Israel as legitimate, meaning the Middle East’s two most advanced economies and military powers do not have formal diplomatic ties. Supporters of normalizing relations say it would bring stability and prosperity to the region, while countering Iran’s influence.\nUS President Donald Trump, right, shakes hands with Saudi Deputy Crown Prince and Defense Minister Mohammed bin Salman during a bilateral meeting, in Riyadh, May 20, 2017. (Evan Vucci/AP)\nEstablishing ties has become especially toxic for Saudi Arabia, the birthplace of Islam, since the start of the war in the Gaza Strip, triggered on October 7, 2023, when the Palestinian terror group Hamas led a devastating invasion of southern Israel that killed 1,200 people, mostly civilians, and saw 251 taken as hostages to Gaza.\nAs such, the issue, central to bilateral talks in Trump’s first term, has effectively been delinked from economic and other security matters between Washington and the kingdom, according to six other sources Reuters spoke with for this story, including two Saudi and two US officials. The people all asked to remain anonymous to speak about sensitive diplomatic conversations.\nADVERTISEMENT\nSaudi Arabia’s de facto ruler, Crown Prince Mohammed bin Salman, needs the Gaza war to end and a credible path to a Palestinian state “before he re-engages with the issue of normalization,” said Dennis Ross, a former US negotiator.\nIn the meantime, Washington and Riyadh will focus Trump’s trip largely on the economic partnership and other regional matters, according to the six sources. Lucrative investments such as major deals in arms, mega-projects and artificial intelligence are in play, officials from both sides stressed.\nThe approach was cemented in diplomatic talks between Saudi and US officials ahead of the trip, the first formal state visit of Trump’s second term, they said.\nTrump’s stated aim is to secure a trillion-dollar investment in US companies, building on an initial commitment of $600 billion pledged by the crown prince.\nThe wealthy kingdom, the world’s top oil exporter, knows the ritual well: dazzle the guest, secure the favor. The goal, the sources told Reuters, is to evade diplomatic landmines and perhaps, one said, to win concessions from Trump on the Gaza war and its aftermath.\nUS President Donald Trump, left, shakes hands with Prime Minister Benjamin Netanyahu as he leaves the West Wing of the White House, April 7, 2025, in Washington. (AP Photo/Mark Schiefelbein)\n“The Trump administration wants this trip to be a big deal. That means lots of splashy deal announcements and collaborations that can be sold as being good for America,” said Robert Mogielnicki, senior resident scholar at the Arab Gulf States Institute, a think tank in Washington.\nADVERTISEMENT\n“Normalizing ties with Israel is a much heavier lift than rolling out the red carpet for President Trump and announcing investment deals,” he said.\nA State Department spokesperson declined to comment on any understanding reached ahead of the trip, saying Trump “will look to strengthen ties between the United States and our Arab Gulf partners during the visits.”\nThe Saudi government communications office did not reply to a request for comment.\nCourt the kingdom\nBefore Hamas launched its October 7 attacks on Israel, the crown prince was finalizing a landmark diplomatic agreement: a US defense pact in exchange for Riyadh recognizing Israel.\nBut the scale of Israel’s campaign to destroy Hamas, topple its Gaza regime, and free the hostages forced a pause in the talks.\nThe Hamas-run Gaza health ministry says more than 50,000 people in the Strip have been killed or are presumed dead in the fighting so far, though the toll cannot be verified and does not differentiate between civilians and fighters.\nIsrael says it has killed some 20,000 combatants in battle as of January and another 1,600 terrorists inside Israel on October 7. Israel has said it seeks to minimize civilian fatalities and stresses that Hamas uses Gaza’s civilians as human shields, fighting from civilian areas including homes, hospitals, schools, and mosques.\nIn November last year, bin Salman accused Israel of genocide.\nADVERTISEMENT\nIsraeli troops operate in Gaza in a photo published by the IDF on May 9, 2025. (Israel Defense Forces)\nFrustrated by the impact of Gaza’s prolonged crisis on normalization efforts, Trump could use his visit to unveil a US framework to end the 18-month war, the two Gulf sources said.\nThe plan could create a transitional government and new security arrangements for postwar Gaza, potentially reshaping regional diplomacy and opening the door to future normalization talks, they said.\nUnderscoring the high-stakes diplomacy underway, Trump met privately with Israel’s Strategic Affairs Minister Ron Dermer on Thursday to discuss the war and nuclear talks with Iran, Axios reported.\nThe US State Department did not immediately respond to questions about Trump’s discussions on Gaza.\nTrump conspicuously has not announced a visit to Israel as part of his tour of the region. Two diplomats noted the US president has recently refrained from talking about his “Gaza Riviera” plan, which enraged the Arab world with the suggestion of resettling the entire Gazan population and US ownership of the strip.\nIn the build-up to the trip, Washington has taken a number of actions that are positive for Saudi Arabia. An agreement to stop US bombing of the Houthis in Yemen is in line with a Saudi ceasefire there. Washington has also delinked civil nuclear talks from the normalization question.\nThe stalled Saudi-US defense pact, initially conceived as a formal treaty, was revived in the scaled-back form of security guarantees late in the Biden presidency to bypass congressional opposition.\nADVERTISEMENT\nThe Trump administration has now picked up those talks, along with the discussions about a civilian nuclear agreement, three of the sources said, while cautioning that it will take time to define terms.\nChina influence\nTrump’s Saudi trip is his first formal state visit and second foreign trip since his re-election, after attending the pope’s funeral in Rome. He will also visit Qatar and the United Arab Emirates.\nChildren arrive with flowers for US President Donald Trump (C) during his welcoming by Saudi Arabia’s King Salman bin Abdulaziz al-Saud (R), upon Trump’s arrival at King Khalid International Airport in Riyadh on May 20, 2017. ( AFP PHOTO / MANDEL NGAN)\nBeneath the showmanship of Trump’s visits, diplomats say, lies also a calculated US effort to reassert influence and reshape economic alignments in a region where Beijing — Washington’s chief economic rival — has steadily expanded its foothold at the heart of the petrodollar system.\nTrump’s first trip abroad in his first term also began in Riyadh, where he unveiled $350 billion in Saudi investments.\nTrump commands deep trust from the Saudi leadership, rooted in the close ties during his first term — a period defined by large arms deals and steadfast US backing for bin Salman, even as global outrage erupted over the killing of columnist Jamal Khashoggi by Saudi agents in Istanbul.\nSaudi Arabia and its Gulf allies now plan to urge Trump to ease US regulations that have increasingly deterred foreign investment, particularly in sectors deemed part of America’s “critical national infrastructure,” five industry sources said.\nIn meetings with US officials, Saudi ministers will advocate for a more business-friendly climate, especially at a time when China is aggressively courting Gulf capital, the industry sources said.\nWhile countering China’s economic rise may top Trump’s foreign policy agenda, it won’t be easy in Saudi Arabia. Since the launch of Vision 2030, China has become integral to the kingdom’s plans, dominating sectors from energy and infrastructure to renewables."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/an-american-brand-on-every-street-the-surprising-saudi-obsession-with-the-us/", "title": "An American brand on every street: The surprising Saudi obsession with the US", "media_type": "article", "date": "11 May 2025, 5:05 am", "content": "RIYADH, Saudi Arabia (AFP) — During his nine years living in Tennessee, Fahd, a Saudi national, found comfort and consistency at Dunkin’, where he placed the same order every day.\nNow back in Riyadh, Fahd is doing something similar, highlighting the Saudi Arabian love affair with all things American that many find surprising.\n“When I came here, thank God, the same cafe and same order were here too,” said the 31-year-old mechanical engineer, who did not want to give his family name. “I started living the same lifestyle here as I did in America.”\n00:00 / 23:33\nSaudi Arabia, often known for its religious austerity, is home to Islam’s holiest sites and welcomes millions of Muslim pilgrims every year.\nIt also has — as just one example — more than 600 branches of Dunkin’ (formerly Dunkin’ Donuts), serving roughly 250,000 of its 35-million population each day, according to the US franchise.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nDespite its image as a cloistered and traditional society, life in Saudi Arabia is awash in Western corporate influence, especially from American companies.\nSaudi families eat at a branch of the US franchise ‘Buffalo Wild Wings’ in Riyadh on May 1, 2025. (Photo by Fayez Nureldine / AFP)\nBuffalo Wild Wings, Chuck-e-Cheese and Starbucks populate Riyadh’s sprawl of office parks and shopping centers, while the capital’s traffic-clogged streets heave with hulking American SUVs and pickup trucks.\n‘Every neighborhood’\nThe nations have shared a tight bond since King Abdulaziz bin Saud, the founder of modern Saudi Arabia, and US president Franklin Roosevelt shook hands onboard a US cruiser in the Suez Canal during the final months of World War II.\nADVERTISEMENT\nIn the ensuing decades, the United States has been at the forefront of providing military protection in return for privileged access to Saudi Arabia’s colossal oil reserves.\nThe Saudi riyal is pegged to the greenback and US leaders have been regular guests, including Donald Trump, who arrives in Saudi Arabia on Tuesday on the first major overseas trip of his second term.\nA man walks past a branch of the US franchise ‘Buffalo Wild Wings’ in Riyadh, Saudi Arabia on May 1, 2025. (Photo by Fayez Nureldine / AFP)\nThe relationship has faced rough patches — including the oil embargo in the 1970s, the September 11, 2001, terror attacks carried out by mostly Saudi hijackers, and the gruesome murder of US-based dissident journalist Jamal Khashoggi by Saudi agents in Istanbul in 2018.\nBut for Saudis, the ties that bind, including a love of American food, cars and movies, remain strong — even after a grassroots campaign to boycott US products that has swept the region during the Israel-Hamas war.\n“The one thing we never disagree on is going to an American restaurant — especially Buffalo Wild Wings,” Dalal Abdulaziz, 28, told AFP, saying that chicken wings were one of her favorite foods.\n“You’ll find American restaurants in every neighborhood here. We eat it weekly, almost like Saudi food.”\nADVERTISEMENT\nKhaled Salman Al-Dosari agrees, saying it is hard to find a single street in Saudi Arabia without an American brand on offer.\n“American companies’ products have become an inseparable part of our day,” added the 21-year-old student in Riyadh.\nJust like home\nWhile many American companies have been in Saudi Arabia for decades, its Vision 2030 agenda — the oil-dependent country’s giant economic diversification plan — has opened it up and paved the way for further investment.\nSaudi men at a Dunkin’ coffee shop in Riyadh, Saudi Arabia, on May 1, 2025. (Photo by Fayez Nureldine / AFP)\nLive music and cinemas were all forbidden until recent years, but MMA fights and US professional wrestling are now among the entertainment offers available to Saudi consumers.\n“I think many Americans would be surprised at the extent to which American brands are all over Saudi Arabia,” said Andrew Leber from the Department of Political Science at Tulane University.\nSome see further correlations in terms of climate, architecture — dry, dusty Riyadh, with its wide concrete boulevards, evokes an Arab Dallas — and even mindset.\n“Texas is close to Riyadh in terms of climate,” said Fahd, the mechanical engineer. “And its people are conservative like us.”\nMeanwhile, the Saudi taste for US products has benefits for the tens of thousands of Americans working in the kingdom, many of them in the oil industry.\nADVERTISEMENT\n“It always… reminds me of home and keeps that connection with the places that I’ve seen since I’ve been growing up,” said Joshua Dunning, a 36-year-old American business developer working at a Saudi tech firm.\n“It’s always a nice reminder.”"}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/on-a-serene-thai-island-a-holistic-healing-center-provides-relief-for-traumatized-israelis/", "title": "On a serene Thai island, a holistic healing center provides relief for traumatized Israelis", "media_type": "article", "date": "11 May 2025, 1:47 pm", "content": "KOH PHANGAN, Thailand — Nestled in a lush Thai jungle, thousands of miles from the ongoing conflict with Hamas in Gaza, a unique therapeutic refuge in Koh Phangan has emerged for Israelis impacted by war.\nUnder bamboo roofs, young Supernova festival survivors, released soldiers, a group of dedicated volunteers and others gather around communal tables and art spaces, their conversations punctuated by the gentle sounds of a nearby river. This is David’s Circle — a healing space where trauma meets hope in the aftermath of October 7.\nOver a year and a half after the Hamas onslaught on southern Israel that left some 1,200 dead and 251 kidnapped and taken to the Gaza Strip, thousands of Israelis have left their homeland seeking respite from constant reminders of the seemingly never-ending war sparked by the massacre. Among them is Daniel, an Israeli reservist who found himself in Thailand with his wife and children after serving multiple lengthy rotations in Gaza.\n“I was emotionally unstable, really struggling,” he says during The Times of Israel’s visit. “When I arrived at David’s Circle for the first time, I remember meeting Segev [a former IDF mental health officer]. That conversation was a spark of hope when nothing seemed possible.”\nWith over 300,000 Israelis having traveled to Thailand in the last year alone and experts estimating that as many as 31% of Israelis who were directly exposed to the October 7 atrocities may be suffering from PTSD, David’s Circle represents a groundbreaking approach to collective healing for Israelis abroad.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nAs traditional therapy fails to reach many survivors who can’t process their trauma while surrounded by constant reminders of war, this jungle sanctuary offers a different path. Here, healing happens through a holistic combination of peer support, creative expression, physical activities, and community connection rather than a formal clinical environment.\nParticipants at David’s Circle in Koh Phangan, Thailand, March 2025. (Inor Kagno)\nDavid’s Circle has hosted over 900 visitors since its opening in September 2024. Most participants are between 21-26 years old, with approximately half being discharged soldiers, a quarter being Supernova festival survivors or residents from border communities, and another quarter dealing with various forms of trauma and grief.\nA 2025 qualitative study from Tel Hai Academic College found that the center’s non-clinical approach helps participants address what researchers identified as common themes of “emotional dislocation, mistrust, and existential uncertainty” through community connection and creative expression.\nADVERTISEMENT\nParticipants at David’s Circle in Koh Phangan, Thailand, March 2025. (Inor Kagno)\nA sanctuary born from tragedy\nDavid’s Circle is based on Thailand’s scenic island of Koh Phangan, on which it is estimated that about 600 Israeli families reside and thousands more visit for short-term stays.\nThe vision originated with Israeli trauma specialist Yael Shoshani-Rom, who had been working with survivors of the Supernova music festival, where over 360 revelers were murdered in one of the most gruesome massacres on October 7.\n“I started hearing from my personal patients that they feel they can’t heal in Israel because the situation was unbearable — it still is unbearable. Everything was triggering, sirens all the time, the trauma doesn’t end,” says Shoshani-Rom.\nDavid’s Circle founder Yael Shoshani-Rom. (Inor Kagno)\nAs she noticed many survivors leaving Israel, she envisioned creating “something like a Chabad house, but therapeutic” where Israelis could continue their healing journey abroad, Shoshani-Rom says, referring to the Jewish outreach centers around the world established by the Chabad Hasidic group.\nThe idea became reality through a partnership with Let’s Do Something, a nonprofit founded by friends of David Newman, who was murdered by Hamas terrorists at the Supernova festival.\nWhat began as a WhatsApp group for gathering humanitarian supplies has since expanded its operations across three areas: investing in next-generation defense solutions to support Israel long-term, healing survivors of the war — mainly through David’s Circle — and producing pro-Israel content. Let’s Do Something embraced Shoshani-Rom’s vision of a healing center in Thailand, and so David’s Circle, named in memory of Newman, was born.\nADVERTISEMENT\nAn oasis in the jungle\nVisitors enter David’s Circle by passing under a decorative bamboo gate into the holistic healing space. The daily rhythm balances structured activities with unstructured time, with the bulk of activities taking place within a large roofed structure divided into different zones.\nAn art activity at David’s Circle in Koh Phangan, Thailand, March 2025. (Inor Kagno)\nIn the social area, participants engage in intense games of backgammon and cards, cigarette smoke curling upward as they laugh at inside jokes and sing Israeli folk music. The open art studio corner bustles with creativity as participants work on intricate mandalas and mixed-media projects, vibrant paintings depicting themes of resilience adorning the walls. Meanwhile, in the communal dining section, others prepare meals in the open-air kitchen, the aroma of home-cooked couscous filling the air and providing comfort through familiar tastes from home.\nTo one side of the main area, a carefully maintained bonfire pit awaits the evening gathering. As night falls, participants form a circle around the crackling flames, where they share stories, process emotions, and find connection through guided discussions on topics ranging from coping through struggle to inner resilience. Across the river, accessible by a small footbridge, stands the shala, a traditional Thai pavilion where workshops are held — from voice-opening exercises to ice bathing and discussions about coping with PTSD-related sleep disruptions.\n“What I fell in love with is how you can do super professional work that’s based on knowledge, research, and the most advanced techniques, but you don’t need a clinic for it — you can do it on a pouf, on a mat, during things that are very healthy and part of their world without making them feel that they are now in crisis,” Shoshani-Rom says.\nBeyond traditional therapy\n“There’s something in conventional treatment that doesn’t actually look at you as who you are,” says Ahia Meir Malul, a 28-year-old artist and Supernova festival survivor who has thrived in the informal space of David’s Circle after struggling in Israel. “You exist more than just your problem; you are a whole world in itself. When [therapists] only address the problem, they miss 99% of what’s actually happening.”\nWhat sets David’s Circle apart is not just its relaxed setting, but its embrace of a peer-support model.\nParticipants at David’s Circle in Koh Phangan, Thailand, March 2025. (Inor Kagno)\n“The trauma was collective,” says Shoshani-Rom. “Therefore, the idea was to create a community that is healing and being healed at the same time.”\nYarden Asher, a 27-year-old Supernova festival survivor, who trained to be a mentor at the center, sees his role as essential to his own recovery.\nADVERTISEMENT\n“It gives me meaning. It’s one of the stages in post-traumatic growth, this stage of giving back. Because if until now I received and learned and gained knowledge from people, the next stage is you give, that you’re in a position where you can give,” he says.\nParticipants take therapeutic ice baths at David’s Circle in Koh Phangan, Thailand, March 2025. (Inor Kagno)\nFinding connection and hope\nFor Daniel, the IDF reservist, David’s Circle in Thailand became an anchor amid emotional chaos.\n“I remember the day I first arrived,” he says. “I was going downhill — nothing looked possible, nothing looked hopeful.” Through consistent Monday and Wednesday visits, Daniel gradually found stability.\n“I experienced this medicine drop by drop,” he says, noting how arts workshops and community connections transformed him. “Now it’s already different. I’m speaking from an angle where I’m looking back, it’s a completely different world.”\nParticipants at David’s Circle in Koh Phangan, Thailand, March 2025. (Inor Kagno)\nAmong the participants, artist Ahia Malul perhaps embodies the center’s essence of healing through creativity, peer support and connection.\n“I understand that what happened to me there is not what defines me,” he says. “What’s important is to give hope and a point of light… my mission is to show people that it’s possible to translate emotion into material, to draw words in colors.”"}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/sexual-allegations-against-khan-spurred-israeli-icc-arrest-warrants-report-suggests/", "title": "Sexual allegations against Khan spurred Israeli ICC arrest warrants, report suggests", "media_type": "article", "date": "11 May 2025, 2:26 pm", "content": "International Criminal Court Chief Prosecutor Karim Khan allegedly forced sexual intercourse upon a member of staff on multiple occasions, the Wall Street Journal said Saturday, in a report that questioned whether the allegations may have prompted his decision to issue arrest warrants for Prime Minister Benjamin Netanyahu and then-defense minister Yoav Gallant.\nThe report said that at the time — weeks after the Hamas-led October 7, 2023, onslaught — Khan was coming under increasing pressure to take action over Israel’s military campaign in Gaza, and that he had been lashing out at his team.\nA Malaysian lawyer in her 30s reportedly asked to meet with Kahn to ask him to change the manner in which he interacted with the staff. In response, he summoned her to his suite in the Millennium Hilton Hotel next to the UN headquarters in New York.\n00:00 / 23:33\nAccording to the report, the woman testified to UN officials that Khan started to touch her in a sexual manner, something that she said had been occurring for a number of months.\n“She said she attempted to leave the room several times, but he took her hand and eventually pulled her to the bed. Then he pulled off her pants and forced sexual intercourse, according to the testimony,” the report said.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\n“He always holds on to me and leads me to the bed,” she said in testimony reviewed by the Journal. “It’s the feeling of being trapped.”\nThe report said the woman, a married mother, claimed it was one of multiple incidents of “coerced sexual intercourse” but that she stayed in the job because she felt it was an important role in human rights, and she was additionally paying for medical care for her mother. The report said she also began to fear retaliation if she were to complain.\nIsraeli Prime Minister Benjamin (left) Netanyahu at the Knesset, November 11, 2024. (Yonatan Sindel/Flash90); An exterior view of the International Criminal Court, or ICC, in The Hague, Netherlands, on April 30, 2024. (AP/Peter Dejong); Then-defense Minister Yoav Gallant speaks during a press conference at the Kirya military headquarters in Tel Aviv, on November 5, 2024. (Miriam Alster/Flash90)\nThe woman alleged that Khan carried out “nonconsensual sex acts” in New York, Colombia, Congo, Chad, and Paris, as well as at a residence owned by his wife in The Hague, the report said.\nADVERTISEMENT\nKhan, through his lawyers, told the newspaper that it is “categorically untrue that he has engaged in sexual misconduct of any kind.”\nThe newspaper said that just two and a half weeks after Khan learned of the allegations, on May 20, 2024, he announced his intention to issue arrest warrants for Netanyahu and Gallant over the war in Gaza, in addition to Hamas leaders. The day before, he had canceled a fact-finding mission to Israel and Gaza for which he had pressed then-US secretary of state Anthony Blinken to convince Israel to grant him access to Gaza, the report said, citing a May 3, 2024, phone call between the two. According to the newspaper, it was at that time that Khan found out about the allegations against him.\n“The timing of the announcement has spurred questions about whether Khan was aiming to protect himself from the sexual-assault allegations. The day before announcing the warrant application, Khan abruptly canceled a trip to Israel and Gaza that he had previously said was important to make his decision,” the report said.\nAccording to the Journal, Alan Dershowitz had been organizing a meeting that was set to take place during the trip between Khan and Netanyahu.\nLawyers for Khan denied any connection between the allegations and the warrants.\nKhan said the fact that the ICC judges approved the warrants shows that the evidence for them “met the rigorous legal threshold required.” The report also noted that already in March 2024, Khan had notified US State Department officials that he intended to seek the arrest warrants, and that was before the allegations were made against him.\nADVERTISEMENT\nHowever, court officials told the newspaper that the arrest warrants ensured support for Khan from anti-Israel countries if the allegations were to become public and additionally discouraged his accuser from coming forward.\nThe woman allegedly told investigators that Khan had informed her that her accusations would harm the investigation into the Gaza war.\n“Think about the Palestinian arrest warrants,” she said he told her, according to her testimony.\nInternational Criminal Court Chief Prosecutor Karim Khan speaks during a press conference at the San Carlos Palace in Bogota, Colombia, April 25, 2024. (Luis Acosta / AFP)\nThe woman, a Muslim, was said to support investigations of Netanyahu, Gallant, and Hamas. She reportedly later told colleagues she didn’t want to harm the arrest warrant process by filing a complaint. On April 29 of that year, she eventually told officials about the alleged assaults, and on May 5, the ICC’s internal investigation agency contacted her.\nOn November 24, 2024, the ICC issued warrants for Netanyahu and Gallant. The Prime Minister’s Office panned the move in a statement as an “antisemitic decision” and asserted that it stemmed from Khan’s efforts to “save his skin from the serious charges against him for sexual harassment” as well as the beliefs of “biased judges motivated by antisemitic hatred of Israel.”\nICC Warrants were also issued against three Hamas leaders, all of whom have since been killed by Israel.\nLast month, it was reported that United Nations investigators examining the allegations of sexual misconduct were also looking into allegations that Khan retaliated against staff who reported the allegations or were critical of his handling of the matter.\nKhan has alleged that the accusations against him were part of an effort to undermine the ICC. The Journal report said that court officials were concerned that the Mossad was operating at The Hague. No further details were given.\nKhan remains in his position. The ICC did not respond to a Journal request for comment."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/eurovision-kicks-off-as-yuval-raphael-israeli-team-met-by-protests/", "title": "Israel’s Yuval Raphael and her team met by protests, threat as Eurovision week kicks off", "media_type": "article", "date": "11 May 2025, 11:48 pm", "content": "Israel’s Yuval Raphael walked the “turquoise carpet” event in front of a crowd of protesters on Sunday, as the opening ceremony parade officially kicked off the Eurovision Song Contest week in Basel, Switzerland.\nA man was filmed threatening Raphael and the Israeli delegation, leading Israel’s Kan public broadcaster to file a complaint with Swiss police.\nPalestinian flags were seen flying in the crowd and along the parade route, the most visible flag waved by spectators.\nAs she came out of the city hall, Raphael waved and blew kisses to the crowd and posed for photographs, waving the Israeli flag. One person held up a sign reading: “No applause for genocide.” Another read: “Singing while Gaza burns.”\nA smattering of boos were also heard as Raphael stepped onto the carpet.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nIn a video filmed by a member of the Israeli delegation, a man waving a Palestinian flag and wearing a keffiyeh was seen making a throat-slitting gesture and spitting toward the Israeli procession during the “turquoise carpet” event.\nIn a statement, Kan said it sent a message to the European Broadcasting Union asking for help in identifying the man. Asked to comment, the EBU said it was a matter for Swiss police.\nLast year, Israel’s contestant Eden Golan skipped the turquoise carpet event due to security concerns, as well as its overlap with Holocaust Remembrance Day.\nADVERTISEMENT\nRaphael, a survivor of the October 7, 2023, Hamas massacre at the Nova music festival, will perform in the second semifinal on Thursday evening, hoping for a spot in Saturday’s grand final.\nThe 24-year-old Israeli singer said she hopes her song “New Day Will Rise” will send a message of healing and solidarity.\nA protester holds a Palestinian flag as she takes part in a demonstration against Israel during the Eurovision Song Contest 2025 opening ceremony in Basel, Switzerland, on May 11, 2025. (Stefan Wermuth / AFP)\nShe told The Times of Israel ahead of her departure for Basel that she is focused on the music and not the “background noise.”\n“There are things that I can control and things that I can’t control. Ultimately, there’s no point investing energy in something I can’t control,” she said. “The most important thing to me is to bring honor to my country and do the best I can.”\nIsraeli singer Yuval Raphael at a Eurovision rehearsal in Basel, Switzerland, May 6, 2025. (Alma Bengtsson/EBU)\nAhead of the event, experts said they did not expect protests on the same level as last year, in part because the European Broadcasting Union, which organizes the competition, has systematically and repeatedly rejected all appeals to have Israel barred. Public anti-Israel sentiments in Switzerland are also not believed to be as high as those in Sweden.\nStill, last week, Israel’s National Security Council released a travel advisory for Israelis traveling to Basel for the annual song contest, warning Israelis to avoid demonstrations and refrain from displaying Jewish or Israeli symbols.\nADVERTISEMENT\n‘Heart of Europe’\nEurovision celebrates kitsch, and plenty of dazzling outfits were on show as the 37 competing countries’ entrants took their place in the parade.\nSwitzerland hosted the inaugural Eurovision Song Contest in 1956, then staged it for a second time in 1989.\nBasel is located right on the border with France and Germany.\nSerbian singer Princ representing Serbia with the song, ‘Mila’ walks on the turquoise carpet next to the Basel Town Hall during the opening ceremony of the Eurovision Song Contest 2025 in Basel on May 11, 2025. (Fabrice COFFRINI / AFP)\n“The moment we have eagerly awaited is finally here. The stage is ready. Excitement fills the air, and the entire city is buzzing with a unique and vibrant energy,” said Conradin Cramer, president of the Basel City canton.\n“The ESC is the most groundbreaking Swiss invention, after the pocket knife, the zipper, and bircher muesli.”\n“Basel, located in the heart of Europe, is the perfect place to unite people by music,” he said, before declaring Eurovision 2025 officially open.\nParade and protests\nVintage trams and buses took the performers along the so-called “turquoise carpet” parade route — the longest in Eurovision history at 1.3 kilometers (0.8 miles).\nADVERTISEMENT\nEurovision fans lined the route, joining in the party atmosphere in the hot sunshine.\nThe parade was accompanied by drummers, carnival groups, marching bands, alphorn players and techno acts as they crossed the River Rhine over the Mittlere bridge, ending up at the “Eurovision Village” fan zone.\nIsraeli singer Yuval Raphael representing Israel on the turquoise carpet next to the Basel Town Hall during the opening ceremony of the Eurovision Song Contest 2025 in Basel, Switzerland, on May 11, 2025. (Fabrice COFFRINI / AFP)\nSwitzerland is hosting after Swiss vocalist Nemo won Eurovision 2024 in Malmo with the highly personal song “The Code,” about non-binary gender identity.\nNemo has joined calls for Israel to be thrown out of the show.\n“I support the call for Israel’s exclusion from the Eurovision Song Contest,” the singer told the Huffington Post news website. “Israel’s actions are fundamentally at odds with the values that Eurovision claims to uphold — peace, unity, and respect for human rights.”\nDozens of former participants also joined calls for Israel to be banned from the event, penning a letter published last week demanding that the EBU suspend Israel’s participation, which the broadcasting union rejected.\nProtestors hold a banner and Palestinian flags as they take part in a demonstration against Israel’s candidate during the Eurovision Song Contest 2025 opening ceremony in Basel on May 11, 2025. (Stefan Wermuth / AFP)\n“Last year, we were appalled that the EBU allowed Israel to participate while it continued its genocide in Gaza,” the letter read, calling the 2024 contest “the most politicized, chaotic and unpleasant in the competition’s history.”\nADVERTISEMENT\nThe signatories to the letter accused Kan, Israel’s public broadcaster and an EBU member, of being “complicit in Israel’s genocide against the Palestinians in Gaza and the decades-long regime of apartheid and military occupation against the entire Palestinian people.”\nIn a statement to The Times of Israel, Martin Green, the director of the competition, said that while the EBU understands “the concerns and deeply held views,” its goal is to maintain “a universal event that promotes connections, diversity and inclusion through music.”\nFor decades, Eurovision has positioned itself as a non-political contest, but geopolitics has undeniably filtered into the proceedings most years. This year, public broadcasters from Slovenia, Spain, Iceland and Ireland have called on the EBU to reconsider Israel’s participation, to no avail.\nDespite animosity on the ground, in last year’s competition Israel came second in the popular vote, with voters in 14 different countries giving it the most possible points — twelve. It was far less successful in the jury votes, and ended up fifth place overall."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/supreme-court-rules-birth-parents-of-child-born-in-ivf-mix-up-are-legal-parents/", "title": "Supreme Court rules birth parents of child born in IVF mix-up are legal parents", "media_type": "article", "date": "11 May 2025, 10:40 pm", "content": "The Supreme Court ruled on appeal on Sunday that the legal parents of Sophia, a young girl born following an embryo implantation mix-up in 2022, are her birth mother and the woman’s partner, and not her genetic parents.\nIn the majority four-to-one decision, the court upheld the Central District Court’s decision earlier this year that Sophia should remain in the care of her birth parents, bringing the tragic three-year-long saga to an end.\nThe Supreme Court did, however, approve the lower court’s determination that a special framework must be established to enable Sophia’s genetic parents to keep in close contact with her.\nSophia has been raised by her birth mother and her partner from the time that she was born. The embryo implantation mistake was made at the Rishon Lezion Assuta Medical Center in 2022, where the birth mother was undergoing fertility treatments.\nThe error was discovered during the pregnancy, when the fetus was determined to have medical problems, and subsequent tests revealed that neither the woman carrying the child nor her husband could be the biological parents.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nThe Rishon Lezion Family Court ruled in November 2024, based on a professional opinion submitted to the court, that Sophia’s genetic parents were her “natural parents” and that it was “best for a child to be raised by them.”\nIllustrative: An in vitro fertilization embryologist works on a petri dish at a fertility clinic in London, August 14, 2013. (AP Photo/Sang Tan)\nBut the Central District Court reversed that decision in March this year, ruling that the parental rights of the birth mother and her partner should be given preference over that of the genetic parents, a decision that was appealed by the genetic parents, resulting in Sunday’s Supreme Court ruling.\nJudges Yael Wilner, Ofer Grosskopf, and Yehiel Kasher all ruled that the birth mother and her partner were Sophia’s legal parents. Judge Alex Stein also ruled to reject the appeal and that the birth mother was Sophia’s legal mother, but contended that the genetic father should be registered as the child’s father — without guardianship rights.\nADVERTISEMENT\nJudge Daphne Barak Erez maintained that Sophia’s genetic parents should be the legal parents.\nWriting for the majority, Wilner said that there was a lacuna in the law for dealing with the legal questions arising from the situation.\nShe therefore used a legal tool of deduction from a clause in the 1996 Surrogacy Law, which established that in a situation in which the surrogate mother decides to withdraw from a surrogacy agreement with the genetic parents (with the agreement of a court), the birthing mother is the legal mother and guardian of the baby.\nWilner wrote that that law can be applied to the current case since the contested parentage claims, which the surrogacy law discusses, mirror the contested parentage claims in the embryo mix-up case.\nWilner also wrote that Sophia’s birth mother and her partner had already established a parental connection to the baby before her genetic parents were able to seek custody.\nAnd she wrote that the good of the child justified leaving her in the care of her birth mother and partner due to “the fact that the young girl has lived with them from the day of her birth and sees them as her father and mother,” as well as Sophia’s “complex medical situation,” from which she has suffered since birth.\nADVERTISEMENT\nIllustrative image: A single sperm is injected directly into an egg as part of IVF. (Lars Neumann; iStock by Getty Images)\nLawyers for Sophia’s birth parents said they were “extraordinarily moved” that her birth parents would now “have quiet to raise her in peace — for the mother who carried her, and her partner who is raising her.”\nThey added, “We hope and pray that the other side will put down its sword and begin to speak and act with peace for [the sake] of this little girl, who deserves this.”\nLawyers for the genetic parents said they had “read with sadness” the Supreme Court decision, saying it would have “significant and difficult” broad implications for the girl’s future and for the field of fertility in Israel in general.\n“Sophia’s best interests and future are what concern her genetic parents, and this is what has guided us from the beginning of the path in the fight to return her to the bosom of her biological family,” they said.\nA Health Ministry probe into the incident, published in March 2023, pointed to significant breaches in protocol, due to heavy workload resulting in the embryo mix-up.\nAfter reviewing medical records and interviewing medical staff and patients, an external committee concluded that the mix-up most likely occurred when the woman who received the embryo and the genetic mother were both in the clinic’s waiting area at the same time. The women likely went in for the embryo transfer in the wrong order, resulting in the error."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/israel-attacks-yemens-hodeidah-houthi-interior-ministry-says/", "title": "IDF issues ‘urgent’ evacuation warning for three Houthi-controlled ports in Yemen", "media_type": "article", "date": "11 May 2025, 10:38 pm", "content": "The Israel Defense Forces on Sunday evening issued an “urgent” evacuation warning to the three Houthi-controlled ports in western Yemen, ahead of potential Israeli strikes.\nThe warning came after the Houthis fired several ballistic missiles and drones at Israel in recent days, since the Israeli Air Force struck the Houthi-controlled airport in Sanaa and several other facilities last week in response to a Houthi ballistic missile that impacted inside the grounds of Ben Gurion Airport last Sunday.\nIn a post on X, the IDF’s Arabic-language spokesman Col. Avichay Adraee warned those at the Ras Isa, Hodeidah, and Salif ports on the western coast to evacuate.\n00:00 / 23:33\n“Due to the Houthi terror regime’s use of ports for its terror activities, we urge all those present at these ports to evacuate and stay away from them for your own safety until further notice,” he said.\nA report by Reuters, citing the Houthi interior ministry, claimed that Israel targeted Hodeidah port following the warning. Israeli military sources said no strikes had been carried out as of Sunday night. There were no reports in Houthi media of strikes either.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nOn Friday afternoon, the Houthis fired a ballistic missile that triggered sirens across central Israel. The IDF reported that the missile was successfully intercepted by air defenses.\nDefense Minister Israel Katz warned then that Israel would respond. “The Houthis continue to launch Iranian missiles at Israel. As we promised, we will respond, strongly in Yemen and anywhere else necessary,” he said in a statement.\nThe Friday attack came three days after the US announced that it had reached a ceasefire with the Yemeni terror group.\nHouthi officials made clear that the deal, in which they agreed to stop targeting US maritime activity in the Red Sea in exchange for an end to weeks of intense US airstrikes, did not include any agreement to stop firing at Israel or ships linked to the Jewish state.\nOn Wednesday, the IDF said a missile fired by the Houthis crashed outside Israeli territory. Earlier in the day, the IDF said it had downed a drone launched from Yemen.\nADVERTISEMENT\nThe attacks came after Israel carried out two days of heavy sorties targeting infrastructure controlled by the Houthis in response to the missile that struck Ben Gurion Airport. Since Ben Gurion was hit, most foreign airlines have suspended flights to Israel.\nThe fiery reprisals destroyed the international airport in the capital Sanaa, and caused heavy damage to a port in Hodeida and several power stations and a cement factory, officials said.\nThe Houthis — whose slogan calls for “Death to America, Death to Israel, [and] a Curse on the Jews” — first began attacking Israel and maritime traffic in November 2023, a month after the October 7 Hamas massacre.\nThe Houthis held their fire when a ceasefire was reached between Israel and Hamas in January 2025. By that point, they had fired over 40 ballistic missiles and dozens of attack drones and cruise missiles at Israel, including one that killed a civilian and wounded several others in Tel Aviv in July, prompting Israel’s first strike in Yemen.\nSince March 18, when the IDF resumed its offensive against Hamas in the Gaza Strip, the Houthis have launched some 29 ballistic missiles and at least 10 drones at Israel.\nThe sirens warning of missile attacks have sent hundreds of thousands of Israelis rushing to shelters at all hours of the day and night."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/tehran-says-4th-round-of-nuclear-talks-difficult-while-us-encouraged/", "title": "Tehran says 4th round of nuclear talks difficult, while US ‘encouraged’", "media_type": "article", "date": "11 May 2025, 9:44 pm", "content": "Iran and the United States wrapped up nuclear talks in Oman on Sunday with no apparent breakthrough and a public standoff over enrichment, but with both sides confirming plans for future negotiations.\nIt was the fourth round of the talks that began a month ago, marking the highest-level contact between the two foes since Washington withdrew in 2018 from a landmark nuclear deal during President Donald Trump’s first term.\nBoth sides had reported progress in the previous three rounds, and on Sunday, Iran said the meeting was “difficult but useful,” while a senior US official said Washington was “encouraged.”\nIn a post on X, Iran’s foreign ministry spokesman Esmaeil Baqaei said the talks could help “better understand each other’s positions and to find reasonable and realistic ways to address the differences.”\nBaqaei earlier said negotiators would push for relief from US sanctions.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nThe US official, speaking on condition of anonymity, said Washington was “encouraged by today’s outcome and look(s) forward to our next meeting, which will happen in the near future,” without specifying when.\nThis handout picture provided by the Iranian Foreign Ministry on May 11, 2025, shows Iran’s Foreign Minister Abbas Araghchi (C) being welcomed upon his arrival in Muscat (Iranian Foreign Ministry / AFP)\nBaqaei said that the “next round will be coordinated and announced by Oman.”\nAccording to the US official, the talks were “both direct and indirect, and lasted over three hours.”\nADVERTISEMENT\n“Agreement was reached to move forward” and “continue working through technical elements,” the official added.\nIran entered the talks saying that its right to maintain uranium enrichment was “non-negotiable,” while Washington’s chief negotiator Steve Witkoff has said that the American demand to stop enrichment is a “red line.”\nIranian Foreign Minister Abbas Araghchi, who led Tehran’s delegation, said in a video before departing for the Omani capital Muscat that “enrichment capability is one of the honors” of Iran.\nUS President Donald Trump, left, shakes hands with Assistant to the President, Senior Adviser and Special Envoy Steve Witkoff after Witkoff’s swearing-in ceremony in the Oval Office of the White House in Washington, DC, on May 6, 2025. (Jim WATSON / AFP)\n‘Pressure’\nThe talks come amid a flurry of diplomatic activity in the region, with Trump heading to the Gulf for his first major foreign tour next week, and Araghchi just back from Saudi Arabia and Qatar.\nThe fourth round that took place on Sunday was initially scheduled for May 3, but was delayed, with mediator Oman citing “logistical reasons.”\nYousuf Al Bulushi, chairman of the Muscat Policy Council think tank, said that a breakthrough “will take quite some time, but I’m optimistic.”\nADVERTISEMENT\nHe warned, however, that both sides had lost precious time during past negotiations, trying to clarify public statements “instead of focusing solely on talks.”\nPublic pressure “is a tactic in negotiations… but this is really impacting the atmosphere” at the table, said Bulushi.\nWestern countries, including the United States, have long accused Iran of seeking to acquire nuclear weapons, while Tehran insists that its nuclear program is for peaceful purposes.\nA handout picture provided by the Iranian presidency shows Iran’s President Masoud Pezeshkian (2nd R) and the Atomic Energy Organisation of Iran (AEOI) chief Mohammad Eslami (R) during the ‘National Day of Nuclear Technology,’ in Tehran, on April 9, 2025 (Iranian Presidency / AFP)\nIran currently enriches uranium to 60-percent purity — far above the 3.67% limit set in the 2015 deal with the United States and other world powers, and a short technical step from the 90% needed for weapons-grade material. Tehran regularly threatens to destroy Israel, and its uranium enrichment level is far higher than necessary for civilian uses.\nWitkoff, Trump’s Middle East envoy, said in a Friday interview that Iran’s “enrichment facilities have to be dismantled.”\n“That’s our red line. No enrichment. That means dismantlement. It means no weaponization. And it means that Natanz, Fordow and Isfahan — those are their three enrichment facilities — have to be dismantled,” he told US right-wing outlet Breitbart News, after initially suggesting flexibility on Tehran maintaining low-level enrichment of uranium for civilian purposes.\nAraghchi has repeatedly defended Iran’s right to enrich uranium.\nForeign Minister Gideon Saar visits at the Yad Vashem Holocaust Memorial museum in Jerusalem on May 11, 2025 (Yonatan Sindel/Flash90)\n‘World’s most dangerous weapon’\nAt a press conference in Jerusalem on Sunday, Foreign Minister Gideon Sa’ar said Iran’s uranium enrichment facilities “must be dismantled,” and that the US and Israel agree on this issue.\nADVERTISEMENT\n“The most dangerous regime must not be allowed to obtain the world’s most dangerous weapon,” he said.\nSa’ar said he “agrees very much” with comments made over the weekend by Witkoff, who said enrichment facilities “have to be dismantled” for Washington to take it at its word that it does not want nuclear arms.\n“I think this is the right approach and we hold the same view on the matter,” Sa’ar said.\nAsked whether Israel is concerned about recent foreign policy moves by Trump that seemed to sideline Jerusalem on key regional issues, Sa’ar said, “We are coordinated. It doesn’t mean we must fully agree one hundred percent on every issue.”\n“The US is a sovereign state, Israel is a sovereign state. But I believe that we have very, very big common grounds with positions in this US administration, more than in the past…I think the US is our greatest friend and President Trump is a great friend of Israel, and we will work together; we are working together,” he added.\nSa’ar noted that “there is no other world leader” with whom Trump has spent more time than Prime Minister Benjamin Netanyahu.\nA woman walks past a billboard bearing portraits of slain Iranian and Lebanese and Palestinian terror leaders in Tehran’s Enghelab square on May 11, 2025. (ATTA KENARE / AFP)\nNetanyahu, who is deeply skeptical of the Iran-US talks, has called for all of Tehran’s nuclear facilities to be dismantled and for its ballistic missile program to be stopped as part of any credible deal.\nADVERTISEMENT\nTehran has insisted that the talks be solely focused on the nuclear issue and the lifting of sanctions, ruling out negotiations on military capabilities.\nJerusalem is reportedly unhappy with the state of the talks, which were said to be developing into a largely similar framework to the 2015 Joint Comprehensive Plan of Action, or JCPOA, which was signed by then-US president Barack Obama and was panned at the time by Netanyahu as disastrous for Israel. Trump also maligned the accord before withdrawing from it in 2018."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/film-about-gaza-photojournalist-premiers-at-cannes-this-week-after-her-death-in-airstrike/", "title": "Film about Gaza photojournalist premieres at Cannes this week after her death in airstrike", "media_type": "article", "date": "11 May 2025, 7:21 pm", "content": "The Cannes Film Festival, which begins on Tuesday, will include several movies this year that focus on the war between Israel and the Hamas terror group in Gaza, including a documentary whose protagonist was killed in an Israeli strike last month.\nFatima Hassouna, a 25-year-old Gazan photojournalist, is the main character in Iranian filmmaker Sepideh Farsi’s documentary, “Put Your Soul on Your Hand and Walk.”\nThe filmmaker, a refugee from Iran, made the movie from video phone calls with Hassouna over more than 200 days of war.\nOn April 15, Farsi rang the young Palestinian to tell her the film had been selected for Cannes, and they immediately started trying to arrange for her to attend the French festival.\nThe next day, an Israeli airstrike killed Hassouna along with 10 relatives in her family home in northern Gaza. Only her mother survived.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nThe Israel Defense Forces said the strike targeted a Hamas operative involved in attacks on soldiers and civilians.\n“Prior to the strike, measures were taken to minimize the risk to civilians, including the use of precision munitions, aerial surveillance, and additional intelligence,” the IDF said.\nAt the time, Cannes said in a statement that it wished “to express its horror and deep sorrow at this tragedy, which has moved and shocked the entire world,” saying the film’s screening would be “a way of honoring the memory of the young woman, a victim like so many others of the war.”\nADVERTISEMENT\nThe war in Gaza started on October 7, 2023, when some 5,000 Hamas-led terrorists invaded southern Israel from Gaza, killing some 1,200 people and taking 251 hostages, 58 of whom are still held in Gaza along with the body of a soldier killed in 2014. Twenty-four of the hostages are officially believed to be alive, though Israel has expressed “grave concern” about three of them.\nFarsi’s documentary is likely to draw attention to the war, at a festival where the conflict was already present last year.\nAt the Berlinale festival in February, British movie star Tilda Swinton lashed out at “internationally enabled mass murder” in Gaza.\nLocal residents walk past the poster of the 78th Cannes Film Festival installed on the façade of the Palais des Festivals in Cannes, south-eastern France, on May 11, 2025. The 78th Cannes Film Festival will take place from May 13 to May 24, 2025. (Valery HACHE / AFP)\n‘Once Upon a Time in Gaza’\nTwo fiction features at Cannes are also likely to spark discussion of the war, in sections parallel to the main competition.\nADVERTISEMENT\nGazan twin brothers Arab and Tarzan Nasser will screen “Once Upon a Time in Gaza,” a tale of two friends peddling drugs from a falafel shop in 2007. That year, Hamas forcibly took control of the Strip from the Palestinian Authority, which had governed the area after Israel’s unilateral withdrawal in 2005.\nThe film — in the Un Certain Regard section — is the latest from the exiled duo to show at the festival, with several of their earlier works set in Gaza but filmed in Jordan.\nMeanwhile, Israeli director Nadav Lapid, whose work frequently touches on Israeli identity and the conflict with the Palestinians, will be showing “Yes” in the Directors’ Fortnight program. The film is to follow a jazz musician tasked with setting to music a new national anthem in the aftermath of the October 7 attack."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/in-first-sunday-blessing-pope-leo-xiv-calls-for-gaza-ceasefire-release-of-hostages/", "title": "In first Sunday blessing, Pope Leo XIV calls for Gaza ceasefire, release of hostages", "media_type": "article", "date": "11 May 2025, 6:47 pm", "content": "Pope Leo XIV called for an immediate ceasefire in Gaza, the entry of humanitarian aid into the Strip, and the release of all hostages in his first Sunday message to crowds in St. Peter’s Square since his election as pontiff.\nQuoting his late predecessor Pope Francis in denouncing the number of conflicts ravaging the globe today, the new pontiff spoke of a “Third World War in pieces.” He decried the war in Ukraine, calling for a “genuine, just and lasting peace” there, and welcomed the recent truce between India and Pakistan after fighting there.\n“I too address the world’s great powers by repeating the ever-present call ‘Never again to war,’” Leo said from the loggia of St. Peter’s Basilica to an estimated 100,000 people below.\n“I am deeply saddened by what is happening in Gaza,” the pope said.\n“May a ceasefire immediately come into effect,” he continued, to long applause and cheers.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\n“Let humanitarian aid be given to the exhausted civilian population, and let all hostages be freed,” he added.\nThe war in Gaza began on October 7, 2023, when the Hamas terror group and its allies invaded southern Israel, killing some 1,200 people, mostly civilians, and taking 251 hostages (58 of them, as well as a soldier killed in 2014, are still held in the Strip).\nADVERTISEMENT\nTwenty-four of the hostages are officially believed to be alive, though Israel has said it has “grave concerns” for three of those.\nIn March, Israel cut off the flow of humanitarian aid into the Strip, amid efforts to pressure Hamas — which Jerusalem says has diverted much of the aid delivered to the Strip — into releasing hostages. On Sunday, Israel backed an initiative made public in vague terms by Washington on Friday for a new mechanism to distribute aid to civilians.\nThe late Pope Francis called repeatedly for a ceasefire in Gaza, as well as for the release of the hostages, regularly speaking over video calls with the Christian community in Gaza and meeting with the families of several Israeli hostages.\nFrancis, who died last month, drew harsh criticism from Jewish and Israeli leaders following his response to the October 7 attack and the subsequent war. Leo’s predecessor endorsed the idea of investigating whether the Israeli campaign in Gaza amounted to genocide, called the humanitarian situation in the Strip “shameful,” and at one point appeared to call Israel’s war-fighting “terrorism.” He also visited a Vatican nativity scene in which Jesus was portrayed wearing a keffiyeh. The display was removed following criticism.\nPope Francis prays before the ‘Nativity of Bethlehem 2024,’ upon its inauguration in the Paul VI Hall, during the private audience with donors of the nativity scene and the lighting of the Christmas tree ceremony at St Peter’s Square, in the Paul-VI hall at the Vatican on December 7, 2024. (Andreas Solaro/ AFP)\n‘Beloved Ukrainian people’\nAddressing the ongoing war in Ukraine, which began with Russia’s full-scale invasion of the country in 2022, Leo said: “I carry in my heart the sufferings of the beloved Ukrainian people.”\n“Let everything possible be done to achieve genuine, just and lasting peace as soon as possible,” he continued.\nADVERTISEMENT\n“Let all the prisoners [of war] be freed, and the children returned to their family,” Leo added.\nRussia has forcefully deported almost 20,000 Ukrainian children since the start of the invasion, according to Ukraine. A December 2024 report by the Yale Humanitarian Research Lab called the practice “intentional, systemic, and widespread.”\nA general view shows faithful gathering as Pope Leo XIV delivers the Regina Caeli prayer from the main central loggia of St. Peter’s basilica in The Vatican, on May 11, 2025. (Photo by Stefano Rellandini / AFP)\nThe pontiff also briefly addressed the recent fighting between India and Pakistan.\n“I was happy to see that there is a ceasefire between India and Pakistan,” he said, “and I hope that through the coming negotiations we might soon come to a lasting accord.”\nThe truce, announced Saturday, appears to be holding, according to reports, though India and Pakistan have both accused each other of violations.\n“I entrust this appeal to the Queen of Peace (the Virgin Mary), so that it might be she who presents it to the Lord Jesus, to achieve the miracle of peace,” Leo said.\nHe also noted that Sunday was Mother’s Day in Italy and other countries, expressing a prayer for all mothers, “including those who are already in heaven.”"}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/jewish-group-exposes-antisemitic-posts-of-quebec-med-school-applicants-and-students/", "title": "Jewish group exposes antisemitic posts of Quebec med school applicants and students", "media_type": "article", "date": "11 May 2025, 6:47 pm", "content": "Canadian Jewish nonprofit B’nai Brith has reported on antisemitic and other hateful content spread by Quebec medical school applicants and students on a social media platform server available to some 1,400 people.\nOn the public Discord server, the “aspiring doctors openly posted Holocaust denial, praise for the ‘Final Solution,’ hurled racial slurs, glorified terrorism, and degraded women,” B’nai Brith said in a statement, releasing screenshots of the French-language posts.\nThe watchdog Doctors Against Racism and Antisemitism (DARA) also highlighted the posts in a statement Friday.\n00:00 / 23:33\nOne post read: “Don’t worry. You can trust me as long as you don’t have a kippa under your wig.”\nHolocaust-related content included a remark proposing “a coalition of doctors to pressure the government and call it ‘The Final Solution Bill'” and another that imagined telling SS officers to “gas the attic as fast as possible” if Anne Frank was hiding in a neighbor’s roof space.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nAnother appeared to call for an “Islamic State of Quebec,” and alleged that “Quebec is done. We’ll dominate soon.”\nWhile the hateful posts shared on the Discord channel were largely antisemitic, posters also made other racist and misogynistic comments.\n“The downfall of society came when women had the right to vote and work,” one poster commented.\n“No, the downfall happened when Jews got rights,” another answered.\nAnother poster said: “I don’t understand why women take our places in medicine when the majority of them become housewives.”\nWhen talking about admissions to the university, one poster said, “Blacks are often poor so double bonus,” apparently referring to the odds of getting into medical school.\nADVERTISEMENT\n“They are just Negroes,” another poster said.\nAn anti-Israel protest encampment on the campus of McGill University in Montreal, Canada, on April 29, 2024. (Graham Hughes / AFP)\n“This content wasn’t buried. It was shared in open channels, visible to over 1,400 members. Almost no one spoke up. These aren’t anonymous trolls. They are future doctors. And this kind of hate doesn’t stay online. It follows them into classrooms, clinics, and operating rooms,” B’nai B’rith said.\nThe posts “are the culmination of the inaction and silence of the medical school and university leadership across Canada since October 7, 2023, to skyrocketing antisemitism in their faculties of medicine,” DARA said, a reference to the date when Palestinian terror group Hamas led over 5,000 attackers to invade southern Israel, killing 1,200 people, mostly civilians.\n“Now is not the time to be quiet,” it said. It called for expelling the students involved and barring applicants from medical school.\nPhilip Berger of DARA told The Gazette outlet in a Saturday report that “we couldn’t find a single objection by anybody” on the server.\nA spokesperson for Discord told the Gazette that the San Francisco-based app has a “zero-tolerance” policy for hate speech and that it will quickly deal with the issue.\n“I was shocked by the individuals, the 20 to 30 people who were posting this antisemitic stuff. They were so blatant about it,” a McGill University medical student told the outlet.\nThe Jewish Clinicians Against Antisemitism filed a complaint with Montreal police against one user who it claims is a student at Dawson College, The Gazette reported.\nADVERTISEMENT\nPro-Palestinian, anti-Israel students and activists protest at an anti-Israel encampment on the campus at McGill University in Montreal, Canada, on April 29, 2024. (Graham Hughes/AFP)\nIn a statement, the school told The Gazette: “The matter you refer to is being investigated.”\nDr. Lior Bibas, president of the Association des médecins Juifs du Québec, a Jewish medical ethics awareness group, urged authorities to investigate.\n“It is essential that the institutions involved act swiftly, transparently, and decisively to restore public trust,” he told the Gazette. “Admitting individuals who hold such views into the medical profession poses a real risk to Quebec patients, especially those from vulnerable communities.”\nEarlier this month, Israel’s Diaspora Affairs Ministry crowned Canada the “champion of antisemitism” in a report blaming world leaders, universities, media outlets, and social networks for rocketing antisemitism.\nIn Canada, the report found a “significant increase in antisemitic incidents in intensity and forms not previously seen” in the country following October 7, 2023, counting a 670% jump in anti-Jewish incidents over the previous year."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/holocaust-survivor-dies-2-weeks-after-great-grandson-killed-in-gaza-as-she-visited-nazi-camp/", "title": "Holocaust survivor dies 2 weeks after great-grandson killed in Gaza as she visited Nazi camp", "media_type": "article", "date": "11 May 2025, 4:45 pm", "content": "Two weeks after her great-grandson was killed fighting in northern Gaza, 96-year-old Holocaust survivor Magda Baratz died on Friday, it was announced Sunday.\nOn April 24, IDF reservist Master Sgt. (res.) Asaf Cafri was killed by sniper fire in the Beit Hanoun area of Gaza, in an attack that wounded three others.\nAt the time Cafri was killed, Baratz was attending a Holocaust Remembrance Day ceremony at the Bergen-Belsen concentration camp, where she was honored as a survivor of the death march from Auschwitz to Bergen-Belsen. She traveled there with her grandson Hagai, Cafri’s father.\n00:00 / 23:33\nBoth only learned of Cafri’s death upon their arrival back in Israel.\nBaratz died on Friday, leaving behind three children, 10 grandchildren and 17 great-grandchildren, the family said.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nShe will be buried Sunday at 5 p.m. at the Ganei Esther Cemetery in Rishon Lezion.\nHer son Ohad told the Ynet outlet that Baratz had a strong connection to Assaf, her oldest great-grandson, and that his death “was very painful to her.”\nHe said she “faded” after her return from Germany, where she was accompanied by family members from three generations.\nADVERTISEMENT\n“For her [the visit] was closure, to go back there with family to the camp that she survived,” he said.\nOhad noted that Baratz had also survived the Auschwitz camp.\nCafri, a tank driver in the 14th Reserve Armored Brigade’s 79th Battalion, from Beit Hashmonai, was standing outside his tank when he and three others were shot, according to an initial IDF investigation."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/three-coalition-members-summoned-for-questioning-over-july-riot-at-idf-holding-facility/", "title": "Three coalition members summoned for questioning over July riot at IDF holding facility", "media_type": "article", "date": "11 May 2025, 4:38 pm", "content": "Coalition members Nissim Vaturi, Amichay Eliyahu and Zvi Sukkot have been summoned for police interrogation over their part in a mob that stormed the Sde Teiman detention center in southern Israel in July 2024, following the arrest of IDF reservists accused of severe abuse of a Palestinian inmate.\nThe summonses came six weeks after Attorney General Gali Baharav-Miara and State Prosecutor Amit Aisman authorized a police probe of the politicians for taking part in the riot, which was followed by a similar break-in at the Beit Lid military courthouse in central Israel the same day.\nThe Sde Teiman riot began after masked military police officers arrested 10 soldiers at the base for allegedly sodomizing a detainee, causing him severe injuries including broken ribs and a rectal tear. In February, five of the reservists were indicted.\n00:00 / 23:33\nMonths after the riots, it was reported that police had identified some 20 suspects from the mobs that stormed Sde Teiman and Beit Lid, but that none had been brought in for questioning.\nWhen news of the criminal probe broke in March, Vaturi and Eliyahu said they would not show up for questioning, citing parliamentary immunity.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nSukkot had lost his Knesset seat in January after his party bolted the government over the Gaza ceasefire-hostage deal, but has since returned. On Sunday he did not immediately say he would refuse questioning, but accused Baharav-Miara of seeking to muzzle him.\nIn a video filmed outside Sde Teiman, he said: “I want to tell the AG and her friends in the public prosecutor’s office, you won’t scare us, you won’t intimidate us in your efforts to terrorize elected officials” as they seek to “protect IDF soldiers.”\nSukkot called the sexual abuse investigation against the soldiers baseless, adding that “the only ones who should be investigated” were the military prosecution, whom he accused of leaking a “cooked-up” video that purported to show the abuse at Sde Teiman, “causing us damage in the entire world.”\nADVERTISEMENT\nMK Zvi Sukkot (Religious Zionism) pictured after breaking into the IDF’s Sde Teiman detention center, July 29, 2024. (X screenshot, used in accordance with clause 27a of the copyright law)\nVaturi, a lawmaker from Prime Minister Benjamin Netanyahu’s Likud party, told police on Sunday that he would not show up for questioning, Hebrew media reported. Speaking to right-wing radio station Galey Israel, Vaturi said the probe was a “clown act” by Baharav-Miara, and called on the government to fire her. He also released a statement accusing her of refraining from prosecuting alleged crimes by opposition figures.\nEliyahu, who serves as heritage minister and is a member of National Security Minister Itamar Ben-Gvir’s Otzma Yehudit party, did not immediately comment.\nBen Gvir himself took to X to denounce “the criminal activity of an attorney general who is partisan from head to toe.”\n“I, as a minister, am prevented from intervening in independent investigations, and it’s important that it be that way, but the political attorney general, as head of the general prosecution, is initiating political and selective investigations,” said Ben Gvir. He also demanded a prosecution of “the staged clip from Sde Teiman.”\nA heated argument erupts between soldiers at the Sde Teiman detention facility in southern Israel after Military Police investigators arrived to detain reservists suspected of severe abuse of a Palestinian inmate, July 29, 2024. (Screenshot: X, used in accordance with Clause 27a of the Copyright Law)"}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/trumps-meeting-with-saudi-ruler-said-set-to-include-leaders-of-pa-lebanon-syria/", "title": "Trump’s meeting with Saudi ruler said set to include leaders of PA, Lebanon, Syria", "media_type": "article", "date": "11 May 2025, 2:59 pm", "content": "US President Donald Trump’s meeting with Saudi Crown Prince Mohammed bin Salman in Riyadh on Tuesday is also set to include Palestinian Authority President Mahmoud Abbas, Lebanese President Joseph Aoun and Syria’s de facto leader, Ahmed al-Sharaa, Arabic media reported Sunday.\nCiting an informed source who declined to be identified, Palestinian newspaper Al-Quds said the Saudi prince “looks forward to Trump’s agreement to the Saudi condition of establishing a Palestinian state.” Trump had said in February that Saudi Arabia was no longer demanding Palestinian statehood as a condition for normalizing ties with Israel, a statement that at the time drew an urgent Saudi denial.\nAccording to the source cited by Al-Quds, Trump had acceded to bin Salman’s request to include the other Arab leaders in the meeting, which will come at the start of Trump’s visit to Saudi Arabia, Qatar and the United Arab Emirates between May 13 and 16.\nTrump will not be visiting Israel, whose government accuses both Abbas and Sharaa of supporting terrorism.\nThe US president predicted ahead of his trip that Saudi-Israeli normalization would happen “very quickly,” but in the meantime, he has reportedly dropped normalization with Israel as a condition for progress on Saudi Arabia’s civilian nuclear program.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nIt had been reported Saturday that Trump would announce US recognition of Palestinian statehood, but Washington’s envoy to Israel Mike Huckabee dismissed the report as “nonsense.”\nUS President Donald Trump, right, shakes hands with Saudi Deputy Crown Prince and Defense Minister Mohammed bin Salman during a bilateral meeting, in Riyadh, May 20, 2017. (Evan Vucci/AP)\nIsrael-Saudi normalization seemed just around the corner before the Hamas onslaught of October 7, 2023, that started the war in Gaza. Two Israeli ministers made unprecedented state visits to the desert kingdom in the weeks before the shock assault that sparked the war in Gaza. But the prospect of normalization faded as anti-Israel sentiment reached new heights in the Muslim world amid the war.\nDuring his first term, Trump brokered the Abraham Accords normalization agreements between Israel, the UAE, Morocco, Sudan and Bahrain, partly in exchange for Israel backing away from a plan to annex the West Bank, the seat of the Palestinian Authority.\nADVERTISEMENT\nTrump in his first term also proposed a solution to the Israeli-Palestinian conflict that would have seen a truncated Palestinian state established in parts of the West Bank, Gaza and the Negev Desert. The plan was rejected outright by both the PA and Prime Minister Benjamin Netanyahu’s pro-settler coalition partners.\nIsrael has long accused the PA of inciting violence against Jews in its school system and through stipends paid to families of Palestinian terrorists detained in Israeli prisons. Abbas ordered an end to the so-called play-to-play system in February, less than a month after Trump took office for the second time.\nFrom left, Bahrain Foreign Minister Khalid bin Ahmed Al Khalifa, Prime Minister Benjamin Netanyahu, then-US president Donald Trump, and United Arab Emirates Foreign Minister Abdullah bin Zayed al-Nahyan, sit during the Abraham Accords signing ceremony on the South Lawn of the White House, in Washington, September 15, 2020. (AP Photo/Alex Brandon, File)\nThe meeting in Riyadh on Tuesday comes as Trump has reportedly expressed frustration over the failure to reach a ceasefire in Gaza, which has been devastated over 19 months of war. The PA had previously threatened to cut ties with Trump over a plan he announced in February to take over Gaza, oust its residents and rebuild the devastated Strip as a coastal resort.\nA rival Egyptian plan for postwar Gaza would have ultimately handed the Strip over to the PA, but Netanyahu has rejected any role for the unpopular body in Gaza’s postwar governance.\nSeparately, Israel has maintained troop presence and carried out military strikes in southern Lebanon following the ceasefire with Hezbollah in November, and ib the Syrian side of the Golan Heights following Sharaa’s ouster in December of Syria’s Iran-backed president Bashar al-Assad. Both Lebanese President Aoun and Syria’s Sharaa have demanded that Israel withdraw from their respective countries."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/saudi-israel-deal-remains-elusive-as-trump-visits-in-bid-for-1-trillion-bonanza/", "title": "Saudi-Israel deal remains elusive as Trump visits in bid for $1 trillion bonanza", "media_type": "article", "date": "11 May 2025, 2:49 pm", "content": "When US President Donald Trump lands in Riyadh on Tuesday, he will be greeted with opulent ceremonies, gilded palaces, and the prospect of $1 trillion in investments. But the raging war in Gaza has denied him one goal he has long craved: Saudi-Israel normalization.\nBehind the scenes, US officials are quietly pressing Israel to agree to an immediate ceasefire in Gaza — one of Saudi Arabia’s preconditions for any restart of normalization talks, said two Gulf sources close to official circles and a US official.\nTrump’s Middle East envoy Steve Witkoff told an audience at the Israeli embassy in Washington this week that he imminently expected progress on expanding the Abraham Accords, a set of deals brokered by Trump in his first term under which several Arab states — the UAE, Bahrain, Sudan, and Morocco — recognized Israel.\nHowever, opposition by Prime Minister Benjamin Netanyahu to a permanent stop to the war or to the creation of a Palestinian state makes progress on similar talks with Riyadh unlikely, two of the sources said.\n“We think we will have some or a lot of announcements very, very shortly, which we hope will yield progress by next year,” Witkoff said in a video of his speech. He is expected to accompany Trump on his visit to the Middle East.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nSaudi Arabia does not recognize Israel as legitimate, meaning the Middle East’s two most advanced economies and military powers do not have formal diplomatic ties. Supporters of normalizing relations say it would bring stability and prosperity to the region, while countering Iran’s influence.\nUS President Donald Trump, right, shakes hands with Saudi Deputy Crown Prince and Defense Minister Mohammed bin Salman during a bilateral meeting, in Riyadh, May 20, 2017. (Evan Vucci/AP)\nEstablishing ties has become especially toxic for Saudi Arabia, the birthplace of Islam, since the start of the war in the Gaza Strip, triggered on October 7, 2023, when the Palestinian terror group Hamas led a devastating invasion of southern Israel that killed 1,200 people, mostly civilians, and saw 251 taken as hostages to Gaza.\nAs such, the issue, central to bilateral talks in Trump’s first term, has effectively been delinked from economic and other security matters between Washington and the kingdom, according to six other sources Reuters spoke with for this story, including two Saudi and two US officials. The people all asked to remain anonymous to speak about sensitive diplomatic conversations.\nADVERTISEMENT\nSaudi Arabia’s de facto ruler, Crown Prince Mohammed bin Salman, needs the Gaza war to end and a credible path to a Palestinian state “before he re-engages with the issue of normalization,” said Dennis Ross, a former US negotiator.\nIn the meantime, Washington and Riyadh will focus Trump’s trip largely on the economic partnership and other regional matters, according to the six sources. Lucrative investments such as major deals in arms, mega-projects and artificial intelligence are in play, officials from both sides stressed.\nThe approach was cemented in diplomatic talks between Saudi and US officials ahead of the trip, the first formal state visit of Trump’s second term, they said.\nTrump’s stated aim is to secure a trillion-dollar investment in US companies, building on an initial commitment of $600 billion pledged by the crown prince.\nThe wealthy kingdom, the world’s top oil exporter, knows the ritual well: dazzle the guest, secure the favor. The goal, the sources told Reuters, is to evade diplomatic landmines and perhaps, one said, to win concessions from Trump on the Gaza war and its aftermath.\nUS President Donald Trump, left, shakes hands with Prime Minister Benjamin Netanyahu as he leaves the West Wing of the White House, April 7, 2025, in Washington. (AP Photo/Mark Schiefelbein)\n“The Trump administration wants this trip to be a big deal. That means lots of splashy deal announcements and collaborations that can be sold as being good for America,” said Robert Mogielnicki, senior resident scholar at the Arab Gulf States Institute, a think tank in Washington.\nADVERTISEMENT\n“Normalizing ties with Israel is a much heavier lift than rolling out the red carpet for President Trump and announcing investment deals,” he said.\nA State Department spokesperson declined to comment on any understanding reached ahead of the trip, saying Trump “will look to strengthen ties between the United States and our Arab Gulf partners during the visits.”\nThe Saudi government communications office did not reply to a request for comment.\nCourt the kingdom\nBefore Hamas launched its October 7 attacks on Israel, the crown prince was finalizing a landmark diplomatic agreement: a US defense pact in exchange for Riyadh recognizing Israel.\nBut the scale of Israel’s campaign to destroy Hamas, topple its Gaza regime, and free the hostages forced a pause in the talks.\nThe Hamas-run Gaza health ministry says more than 50,000 people in the Strip have been killed or are presumed dead in the fighting so far, though the toll cannot be verified and does not differentiate between civilians and fighters.\nIsrael says it has killed some 20,000 combatants in battle as of January and another 1,600 terrorists inside Israel on October 7. Israel has said it seeks to minimize civilian fatalities and stresses that Hamas uses Gaza’s civilians as human shields, fighting from civilian areas including homes, hospitals, schools, and mosques.\nIn November last year, bin Salman accused Israel of genocide.\nADVERTISEMENT\nIsraeli troops operate in Gaza in a photo published by the IDF on May 9, 2025. (Israel Defense Forces)\nFrustrated by the impact of Gaza’s prolonged crisis on normalization efforts, Trump could use his visit to unveil a US framework to end the 18-month war, the two Gulf sources said.\nThe plan could create a transitional government and new security arrangements for postwar Gaza, potentially reshaping regional diplomacy and opening the door to future normalization talks, they said.\nUnderscoring the high-stakes diplomacy underway, Trump met privately with Israel’s Strategic Affairs Minister Ron Dermer on Thursday to discuss the war and nuclear talks with Iran, Axios reported.\nThe US State Department did not immediately respond to questions about Trump’s discussions on Gaza.\nTrump conspicuously has not announced a visit to Israel as part of his tour of the region. Two diplomats noted the US president has recently refrained from talking about his “Gaza Riviera” plan, which enraged the Arab world with the suggestion of resettling the entire Gazan population and US ownership of the strip.\nIn the build-up to the trip, Washington has taken a number of actions that are positive for Saudi Arabia. An agreement to stop US bombing of the Houthis in Yemen is in line with a Saudi ceasefire there. Washington has also delinked civil nuclear talks from the normalization question.\nThe stalled Saudi-US defense pact, initially conceived as a formal treaty, was revived in the scaled-back form of security guarantees late in the Biden presidency to bypass congressional opposition.\nADVERTISEMENT\nThe Trump administration has now picked up those talks, along with the discussions about a civilian nuclear agreement, three of the sources said, while cautioning that it will take time to define terms.\nChina influence\nTrump’s Saudi trip is his first formal state visit and second foreign trip since his re-election, after attending the pope’s funeral in Rome. He will also visit Qatar and the United Arab Emirates.\nChildren arrive with flowers for US President Donald Trump (C) during his welcoming by Saudi Arabia’s King Salman bin Abdulaziz al-Saud (R), upon Trump’s arrival at King Khalid International Airport in Riyadh on May 20, 2017. ( AFP PHOTO / MANDEL NGAN)\nBeneath the showmanship of Trump’s visits, diplomats say, lies also a calculated US effort to reassert influence and reshape economic alignments in a region where Beijing — Washington’s chief economic rival — has steadily expanded its foothold at the heart of the petrodollar system.\nTrump’s first trip abroad in his first term also began in Riyadh, where he unveiled $350 billion in Saudi investments.\nTrump commands deep trust from the Saudi leadership, rooted in the close ties during his first term — a period defined by large arms deals and steadfast US backing for bin Salman, even as global outrage erupted over the killing of columnist Jamal Khashoggi by Saudi agents in Istanbul.\nSaudi Arabia and its Gulf allies now plan to urge Trump to ease US regulations that have increasingly deterred foreign investment, particularly in sectors deemed part of America’s “critical national infrastructure,” five industry sources said.\nIn meetings with US officials, Saudi ministers will advocate for a more business-friendly climate, especially at a time when China is aggressively courting Gulf capital, the industry sources said.\nWhile countering China’s economic rise may top Trump’s foreign policy agenda, it won’t be easy in Saudi Arabia. Since the launch of Vision 2030, China has become integral to the kingdom’s plans, dominating sectors from energy and infrastructure to renewables."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/israel-attacks-yemens-hodeidah-houthi-interior-ministry-says/", "title": "IDF issues ‘urgent’ evacuation warning for three Houthi-controlled ports in Yemen", "media_type": "article", "date": "11 May 2025, 10:38 pm", "content": "The Israel Defense Forces on Sunday evening issued an “urgent” evacuation warning to the three Houthi-controlled ports in western Yemen, ahead of potential Israeli strikes.\nThe warning came after the Houthis fired several ballistic missiles and drones at Israel in recent days, since the Israeli Air Force struck the Houthi-controlled airport in Sanaa and several other facilities last week in response to a Houthi ballistic missile that impacted inside the grounds of Ben Gurion Airport last Sunday.\nIn a post on X, the IDF’s Arabic-language spokesman Col. Avichay Adraee warned those at the Ras Isa, Hodeidah, and Salif ports on the western coast to evacuate.\n“Due to the Houthi terror regime’s use of ports for its terror activities, we urge all those present at these ports to evacuate and stay away from them for your own safety until further notice,” he said.\nA report by Reuters, citing the Houthi interior ministry, claimed that Israel targeted Hodeidah port following the warning. Israeli military sources said no strikes had been carried out as of Sunday night. There were no reports in Houthi media of strikes either.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nOn Friday afternoon, the Houthis fired a ballistic missile that triggered sirens across central Israel. The IDF reported that the missile was successfully intercepted by air defenses.\nDefense Minister Israel Katz warned then that Israel would respond. “The Houthis continue to launch Iranian missiles at Israel. As we promised, we will respond, strongly in Yemen and anywhere else necessary,” he said in a statement.\nThe Friday attack came three days after the US announced that it had reached a ceasefire with the Yemeni terror group.\nHouthi officials made clear that the deal, in which they agreed to stop targeting US maritime activity in the Red Sea in exchange for an end to weeks of intense US airstrikes, did not include any agreement to stop firing at Israel or ships linked to the Jewish state.\nOn Wednesday, the IDF said a missile fired by the Houthis crashed outside Israeli territory. Earlier in the day, the IDF said it had downed a drone launched from Yemen.\nADVERTISEMENT\nThe attacks came after Israel carried out two days of heavy sorties targeting infrastructure controlled by the Houthis in response to the missile that struck Ben Gurion Airport. Since Ben Gurion was hit, most foreign airlines have suspended flights to Israel.\nThe fiery reprisals destroyed the international airport in the capital Sanaa, and caused heavy damage to a port in Hodeida and several power stations and a cement factory, officials said.\nThe Houthis — whose slogan calls for “Death to America, Death to Israel, [and] a Curse on the Jews” — first began attacking Israel and maritime traffic in November 2023, a month after the October 7 Hamas massacre.\nThe Houthis held their fire when a ceasefire was reached between Israel and Hamas in January 2025. By that point, they had fired over 40 ballistic missiles and dozens of attack drones and cruise missiles at Israel, including one that killed a civilian and wounded several others in Tel Aviv in July, prompting Israel’s first strike in Yemen.\nSince March 18, when the IDF resumed its offensive against Hamas in the Gaza Strip, the Houthis have launched some 29 ballistic missiles and at least 10 drones at Israel.\nThe sirens warning of missile attacks have sent hundreds of thousands of Israelis rushing to shelters at all hours of the day and night."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/body-of-soldier-zvi-feldman-missing-for-43-years-recovered-by-mossad-and-idf/", "title": "Body of soldier Zvi Feldman, missing for 43 years, recovered from Syria by Mossad, IDF", "media_type": "article", "date": "11 May 2025, 11:14 am", "content": "The Mossad spy agency and the Israel Defense Forces recovered the remains of Sgt. First Class Zvi Feldman, who went missing in the First Lebanon War’s battle of Sultan Yacoub in 1982, officials announced on Sunday.\nThe battle, nearly 43 years ago, was a skirmish between the IDF and the Syrian army in Lebanon’s Beqaa Valley. It claimed the lives of 21 Israeli servicemen, and more than 30 were injured during it.\nFeldman, a tank soldier, went missing during the battle along with Sgt. First Class Yehuda Katz and Sgt. First Class Zachary Baumel. Baumel’s remains were recovered and returned to Israel in 2019.\nIn a joint statement on Sunday, the Mossad and IDF said the body of Feldman was recovered from “the heart of Syria” in a special operation.\nThey said the “complex and covert operation” was made possible by “precise intelligence” and other capabilities, including “intelligence research and collection efforts and many activities and operations in enemy territory.”\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nThe military said the efforts to locate the body had been ongoing for decades.\nThis image released by the IDF on May 11, 2025, shows troops carrying a coffin containing the remains of Sgt. First Class Zvi Feldman, who went missing in 1982. (Israel Defense Forces)\nDefense officials said the operation to recover the remains was carried out by non-Israeli Mossad agents. The team operated deep inside Syria, dozens of kilometers from the Israeli border, to retrieve the body, while risking their lives.\nThe agents, operating on behalf of Mossad, had a cover story and had been inside Syria for several years. In the past five months, following the fall of the Bashar al-Assad regime, there were breakthroughs in the case and an opportunity to recover Feldman’s remains, the officials said.\nADVERTISEMENT\nOfficials said the team operated “under fire” during the mission, as they visited a graveyard several times, obtaining various findings that were sent to Israel for identification. Eventually findings matched Feldman’s DNA.\nThe team also found the tank soldier’s overalls, which were identified by the head of the Intelligence Directorate’s missing persons unit, who himself served in the Armored Corps in his youth.\nPrime Minister Benjamin Netanyahu informs relatives of Sgt. First Class Zvi Feldman that his body was recovered, May 11, 2025 (Kobi Gideon/GPO)\nThe remains belonging to Feldman — which were in a complex state due to the passage of time — and his overalls were brought to Israel for identification some two weeks ago. Feldman’s family was notified early Sunday once the identification process was completed.\nA video released by the IDF on Sunday showed the moment the remains were returned to Israel. The clip showed a coffin draped in an Israeli flag, as troops recited the mourner’s Kaddish, the Jewish prayer for the dead.\nThis video released by the IDF on May 11, 2025, shows troops reciting the Jewish prayer for the dead upon receiving the remains of Sgt. First Class Zvi Feldman, who went missing in 1982. (Israel Defense Forces)\n“For decades, Zvika was missing, and the efforts to locate him, along with the other missing soldiers from that same battle, never ceased for a moment,” Prime Minister Benjamin Netanyahu said in a statement.\nThe Mossad, IDF, Netanyahu, and Defense Minister Israel Katz all said Israel would not stop its efforts until the remains of Katz are also returned.\nADVERTISEMENT\n“Just as we returned Zachary Baumel, and today Zvi Feldman, we continue to act in every way to also return Sgt. First Class Yehuda Katz and fulfill our duty for him and his family,” the defense minister said.\nFrom left: Zachary Baumel, Yehuda Katz and Zvi Feldman (Courtesy)\nBaumel’s body was recovered with Russian assistance from the Yarmouk refugee camp, home to one of the largest Palestinian communities in Syria. In 2016, an Israeli tank lost in the battle was returned to Israel by Russia.\nThe IDF has been deployed to nine posts inside southern Syria since the fall of the Bashar al-Assad regime in December, mostly within a UN-patrolled buffer zone on the border between the countries.\nTroops have been operating in areas up to around 15 kilometers (9 miles) deep into Syria, aiming to capture weapons that Israel says could pose a threat to the country if they fall into the hands of “hostile forces.”\nThe Hostages Forum, which represents the majority of relatives of those held captive in Gaza, welcomes the return of Feldman’s body, while calling for the return of the remaining hostages, living and dead.\nIsraeli soldiers carry the coffin of Zachary Baumel at the Mount Herzl Military cemetery in Jerusalem on April 4, 2019. (Hadas Parush/Flash90)\n“The families of the hostages would like to extend a big hug to the Feldman family and to every family that is privileged to bring their loved one to burial,” the forum said in a statement.\n“The return of Zvi Feldman is a moral, ethical and national reminder to the prime minister and members of the government — a grave is not a privilege, but a basic duty of the state to its citizens and fighters. In Israel, no one is left behind,” it said.\n“As a society, we must not normalize a situation in which families have to wait over 40 years or more to be reunited with their loved ones,” it said.\nTerror groups in the Gaza Strip are holding 59 hostages, including 58 of the 251 abducted by Hamas-led terrorists on October 7, 2023. They include the bodies of at least 35 confirmed dead by the IDF, one of whom is a soldier killed a decade ago. Israel has said there are grave concerns for the lives of a further three."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/purge-of-hezbollah-from-beirut-airport-satisfying-israeli-us-officials-report/", "title": "Purge of Hezbollah from Beirut airport satisfying Israeli, US officials — report", "media_type": "article", "date": "11 May 2025, 12:28 pm", "content": "Lebanon has conducted a major overhaul of security at its sole international airport, in Beirut, to prevent smuggling by Hezbollah, satisfying Israeli and US officials and giving them hope that the government will take full control over the country’s ports of entry from the terror group, according to a new report.\nAirport staff linked to Hezbollah have been fired, smugglers have been detained, and new surveillance mechanisms using AI are being deployed at Rafik Hariri International Airport, which is situated in an area of southern Beirut that is controlled by the Iran-backed terror group, The Wall Street Journal reported Saturday.\nIn one recent achievement, Lebanese security thwarted an attempt to smuggle over 22 kilograms (50 pounds) of gold to Hezbollah through the airport, a senior security official told the newspaper.\n00:00 / 23:33\n“You can feel the difference,” Lebanese Prime Minister Nawaf Salam said. “We’re doing better on smuggling for the first time in the contemporary history of Lebanon.”\nSalam, who was appointed by Lebanon’s new president in January, was also cited as saying that Hezbollah had tried to block plans to construct a second airport for commercial and cargo flights in an area outside the terror group’s control, near the Syrian border in northern Lebanon. The second airport could also serve as an alternative should the Beirut airport be shuttered due to Israeli attacks on Hezbollah targets there, the newspaper said.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nWhile Israeli and US officials reportedly felt there was still work to be done in Lebanon, a senior US official told the newspaper that “there is reason for hope here.”\nA Lebanese army officer shows Lebanese Prime Minister Nawaf Salam, center, an Israeli military position on the horizon, in the southern village of Khiam, February 28, 2025. (Rabih Daher / AFP)\nThe official, who works for the mechanism overseeing the implementation of the November 27 Israel-Hezbollah ceasefire agreement, said “it has only been six or seven months, and we have stepped to a place that I am not sure I thought was achievable back in November.”\nSenior Lebanese security and military officials cited by the Journal said no planes are now exempt from security checks, while flights from Iran have been suspended since February.\nADVERTISEMENT\nThe suspension, triggered by an IDF claim that Iran was smuggling cash to Hezbollah aboard civilian flights, set off massive riots by supporters of the terror group who demanded Iranian flights be let in. At one point, rioters attacked a convoy led by a top officer from the international peacekeeping force UNIFIL, wounding him.\nMeanwhile, the IDF has continued to target Hezbollah operatives and arms caches in southern Lebanon, and maintains some posts in the region after withdrawing from most of it in February.\nThe terror group was required to vacate the area under the November 27 ceasefire agreement, to be replaced by Lebanon’s military and UNIFIL. Last month, an official said the Lebanese military had dismantled over 90% of Hezbollah’s infrastructure near the border with Israel.\nFire from burning tires burns as Hezbollah supporters face off with Lebanese soldiers during a Hezbollah-organized riot to block the road to the airport in Beirut, Lebanon, February 15, 2025. (Ibrahim Amro / AFP)\nIbrahim Mousawi, a Hezbollah member of Lebanon’s parliament, told the Journal that while the terror group sustained heavy losses, it had ways to rearm, saying, “Where there is a will, there is a way.” He also said allegations that Hezbollah controlled the airport were exaggerated: “We are part of the system, just like any other Lebanese constituency.”\nHowever, Lebanon’s former deputy prime minister Ghassan Hasbani said the airport had been “a main port of entry for supporting whatever para-state activities were happening.”\nHasbani, who now represents an anti-Hezbollah bloc in the Lebanese parliament, said authorities had turned “a purposeful blind eye” to the terror group’s use of the Beirut airport. “In the absence of international attention and pressure to do something about it, nothing much was done.”\nADVERTISEMENT\nHezbollah’s standing in domestic politics has taken a blow in the wake of the fighting that began when the terror group attacked Israel on October 8, 2023 — a day after fellow Iran-backed group Hamas stormed southern Israel to kill some 1,200 people and take 251 hostages, sparking the war in Gaza.\nSome 60,000 residents of northern Israel were displaced by Hezbollah’s near-daily attacks. In a bid to secure the residents’ return, the IDF stepped up operations in Lebanon in September, decimating Hezbollah’s leadership.\nView of a large fire caused by rockets fired from Lebanon, in the northern town of Kiryat Shmona, June 3, 2024. (Ayal Margolin/Flash90)\nThe fighting killed thousands of people, according to Lebanon’s health ministry, which does not distinguish between combatants and civilians. The IDF estimated it had killed some 3,500 Hezbollah operatives.\nHezbollah also took a hit with the ouster in December of its powerful ally in Syria, the Iran-backed president Bashar al-Assad. The ouster cut off a land route for arms smuggling from Iran to Lebanon.\nIn January, Lebanon’s parliament elected US-backed President Joseph Aoun, ending a two-year vacancy in the post. Aoun, previously the commander of Lebanon’s armed forces, has vowed to maintain a state monopoly on arms — a veiled threat against Hezbollah, the only armed group not to surrender its arms to the Lebanese state when the country’s 15-year civil war ended in 1990. Aoun has also demanded that Israel vacate its remaining posts in southern Lebanon."}
{"website": "timesofisrael", "url": null, "link": "https://www.timesofisrael.com/israel-attacks-yemens-hodeidah-houthi-interior-ministry-says/", "title": "IDF issues ‘urgent’ evacuation warning for three Houthi-controlled ports in Yemen", "media_type": "article", "date": "11 May 2025, 10:38 pm", "content": "The Israel Defense Forces on Sunday evening issued an “urgent” evacuation warning to the three Houthi-controlled ports in western Yemen, ahead of potential Israeli strikes.\nThe warning came after the Houthis fired several ballistic missiles and drones at Israel in recent days, since the Israeli Air Force struck the Houthi-controlled airport in Sanaa and several other facilities last week in response to a Houthi ballistic missile that impacted inside the grounds of Ben Gurion Airport last Sunday.\nIn a post on X, the IDF’s Arabic-language spokesman Col. Avichay Adraee warned those at the Ras Isa, Hodeidah, and Salif ports on the western coast to evacuate.\n“Due to the Houthi terror regime’s use of ports for its terror activities, we urge all those present at these ports to evacuate and stay away from them for your own safety until further notice,” he said.\nA report by Reuters, citing the Houthi interior ministry, claimed that Israel targeted Hodeidah port following the warning. Israeli military sources said no strikes had been carried out as of Sunday night. There were no reports in Houthi media of strikes either.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nOn Friday afternoon, the Houthis fired a ballistic missile that triggered sirens across central Israel. The IDF reported that the missile was successfully intercepted by air defenses.\nDefense Minister Israel Katz warned then that Israel would respond. “The Houthis continue to launch Iranian missiles at Israel. As we promised, we will respond, strongly in Yemen and anywhere else necessary,” he said in a statement.\nThe Friday attack came three days after the US announced that it had reached a ceasefire with the Yemeni terror group.\nHouthi officials made clear that the deal, in which they agreed to stop targeting US maritime activity in the Red Sea in exchange for an end to weeks of intense US airstrikes, did not include any agreement to stop firing at Israel or ships linked to the Jewish state.\nOn Wednesday, the IDF said a missile fired by the Houthis crashed outside Israeli territory. Earlier in the day, the IDF said it had downed a drone launched from Yemen.\nADVERTISEMENT\nThe attacks came after Israel carried out two days of heavy sorties targeting infrastructure controlled by the Houthis in response to the missile that struck Ben Gurion Airport. Since Ben Gurion was hit, most foreign airlines have suspended flights to Israel.\nThe fiery reprisals destroyed the international airport in the capital Sanaa, and caused heavy damage to a port in Hodeida and several power stations and a cement factory, officials said.\nThe Houthis — whose slogan calls for “Death to America, Death to Israel, [and] a Curse on the Jews” — first began attacking Israel and maritime traffic in November 2023, a month after the October 7 Hamas massacre.\nThe Houthis held their fire when a ceasefire was reached between Israel and Hamas in January 2025. By that point, they had fired over 40 ballistic missiles and dozens of attack drones and cruise missiles at Israel, including one that killed a civilian and wounded several others in Tel Aviv in July, prompting Israel’s first strike in Yemen.\nSince March 18, when the IDF resumed its offensive against Hamas in the Gaza Strip, the Houthis have launched some 29 ballistic missiles and at least 10 drones at Israel.\nThe sirens warning of missile attacks have sent hundreds of thousands of Israelis rushing to shelters at all hours of the day and night."}
