{"website": null, "url": null, "link": "https://www.timesofisrael.com/israel-attacks-yemens-hodeidah-houthi-interior-ministry-says/", "title": "IDF issues ‘urgent’ evacuation warning for three Houthi-controlled ports in Yemen", "media_type": "article", "date": "Today, 10:38 pm", "content": "The Israel Defense Forces on Sunday evening issued an “urgent” evacuation warning to the three Houthi-controlled ports in western Yemen, ahead of potential Israeli strikes.\nThe warning came after the Houthis fired several ballistic missiles and drones at Israel in recent days, since the Israeli Air Force struck the Houthi-controlled airport in Sanaa and several other facilities last week.\nIn a post on X, the IDF’s Arabic-language spokesman Col. Avichay Adraee warned those at the Ras Isa, Hodeidah, and Salif ports on the western coast to evacuate.\n“Due to the Houthi terror regime’s use of ports for its terror activities, we urge all those present at these ports to evacuate and stay away from them for your own safety until further notice,” he said.\nA report by Reuters, citing the Houthi interior ministry, claimed that Israel targeted Hodeidah port following the warning. Israeli military sources said no strikes had been carried out as of Sunday night. There were no reports in Houthi media of strikes either.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nOn Friday afternoon, the Houthis fired a ballistic missile that triggered sirens across central Israel. The IDF reported that the missile was successfully intercepted by air defenses.\nDefense Minister Israel Katz warned then that Israel would respond. “The Houthis continue to launch Iranian missiles at Israel. As we promised, we will respond, strongly in Yemen and anywhere else necessary,” he said in a statement.\nThe Friday attack came three days after the US announced that it had reached a ceasefire with the Yemeni terror group.\nHouthi officials made clear that the deal, in which they agreed to stop targeting US maritime activity in the Red Sea in exchange for an end to weeks of intense US airstrikes, did not include any agreement to stop firing at Israel or ships linked to the Jewish state.\nOn Wednesday, the IDF said a missile fired by the Houthis crashed outside Israeli territory. Earlier in the day, the IDF said it had downed a drone launched from Yemen.\nADVERTISEMENT\nThe attacks came after Israel carried out two days of heavy sorties targeting infrastructure controlled by the Houthis in response to the missile that struck Ben Gurion Airport. The fiery reprisals destroyed the international airport in the capital Sanaa, and caused heavy damage to a port in Hodeida and several power stations and a cement factory, officials said.\nThe Houthis — whose slogan calls for “Death to America, Death to Israel, [and] a Curse on the Jews” — first began attacking Israel and maritime traffic in November 2023, a month after the October 7 Hamas massacre.\nThe Houthis held their fire when a ceasefire was reached between Israel and Hamas in January 2025. By that point, they had fired over 40 ballistic missiles and dozens of attack drones and cruise missiles at Israel, including one that killed a civilian and wounded several others in Tel Aviv in July, prompting Israel’s first strike in Yemen.\nSince March 18, when the IDF resumed its offensive against Hamas in the Gaza Strip, the Houthis have launched some 29 ballistic missiles and at least 10 drones at Israel.\nThe sirens warning of missile attacks have sent hundreds of thousands of Israelis rushing to shelters at all hours of the day and night."}
{"website": null, "url": null, "link": "https://www.timesofisrael.com/body-of-soldier-zvi-feldman-missing-for-43-years-recovered-by-mossad-and-idf/", "title": "Body of soldier Zvi Feldman, missing for 43 years, recovered from Syria by Mossad, IDF", "media_type": "article", "date": "Today, 11:14 am", "content": "The Mossad spy agency and the Israel Defense Forces recovered the remains of Sgt. First Class Zvi Feldman, who went missing in the First Lebanon War’s battle of Sultan Yacoub in 1982, officials announced on Sunday.\nThe battle, nearly 43 years ago, was a skirmish between the IDF and the Syrian army in Lebanon’s Beqaa Valley. It claimed the lives of 21 Israeli servicemen, and more than 30 were injured during it.\nFeldman, a tank soldier, went missing during the battle along with Sgt. First Class Yehuda Katz and Sgt. First Class Zachary Baumel. Baumel’s remains were recovered and returned to Israel in 2019.\n00:00 / 23:33\nIn a joint statement on Sunday, the Mossad and IDF said the body of Feldman was recovered from “the heart of Syria” in a special operation.\nThey said the “complex and covert operation” was made possible by “precise intelligence” and other capabilities, including “intelligence research and collection efforts and many activities and operations in enemy territory.”\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nThe military said the efforts to locate the body had been ongoing for decades.\nThis image released by the IDF on May 11, 2025, shows troops carrying a coffin containing the remains of Sgt. First Class Zvi Feldman, who went missing in 1982. (Israel Defense Forces)\nDefense officials said the operation to recover the remains was carried out by non-Israeli Mossad agents. The team operated deep inside Syria, dozens of kilometers from the Israeli border, to retrieve the body, while risking their lives.\nThe agents, operating on behalf of Mossad, had a cover story and had been inside Syria for several years. In the past five months, following the fall of the Bashar al-Assad regime, there were breakthroughs in the case and an opportunity to recover Feldman’s remains, the officials said.\nADVERTISEMENT\nOfficials said the team operated “under fire” during the mission, as they visited a graveyard several times, obtaining various findings that were sent to Israel for identification. Eventually findings matched Feldman’s DNA.\nThe team also found the tank soldier’s overalls, which were identified by the head of the Intelligence Directorate’s missing persons unit, who himself served in the Armored Corps in his youth.\nPrime Minister Benjamin Netanyahu informs relatives of Sgt. First Class Zvi Feldman that his body was recovered, May 11, 2025 (Kobi Gideon/GPO)\nThe remains belonging to Feldman — which were in a complex state due to the passage of time — and his overalls were brought to Israel for identification some two weeks ago. Feldman’s family was notified early Sunday once the identification process was completed.\nA video released by the IDF on Sunday showed the moment the remains were returned to Israel. The clip showed a coffin draped in an Israeli flag, as troops recited the mourner’s Kaddish, the Jewish prayer for the dead.\nThis video released by the IDF on May 11, 2025, shows troops reciting the Jewish prayer for the dead upon receiving the remains of Sgt. First Class Zvi Feldman, who went missing in 1982. (Israel Defense Forces)\n“For decades, Zvika was missing, and the efforts to locate him, along with the other missing soldiers from that same battle, never ceased for a moment,” Prime Minister Benjamin Netanyahu said in a statement.\nThe Mossad, IDF, Netanyahu, and Defense Minister Israel Katz all said Israel would not stop its efforts until the remains of Katz are also returned.\nADVERTISEMENT\n“Just as we returned Zachary Baumel, and today Zvi Feldman, we continue to act in every way to also return Sgt. First Class Yehuda Katz and fulfill our duty for him and his family,” the defense minister said.\nFrom left: Zachary Baumel, Yehuda Katz and Zvi Feldman (Courtesy)\nBaumel’s body was recovered with Russian assistance from the Yarmouk refugee camp, home to one of the largest Palestinian communities in Syria. In 2016, an Israeli tank lost in the battle was returned to Israel by Russia.\nThe IDF has been deployed to nine posts inside southern Syria since the fall of the Bashar al-Assad regime in December, mostly within a UN-patrolled buffer zone on the border between the countries.\nTroops have been operating in areas up to around 15 kilometers (9 miles) deep into Syria, aiming to capture weapons that Israel says could pose a threat to the country if they fall into the hands of “hostile forces.”\nThe Hostages Forum, which represents the majority of relatives of those held captive in Gaza, welcomes the return of Feldman’s body, while calling for the return of the remaining hostages, living and dead.\nIsraeli soldiers carry the coffin of Zachary Baumel at the Mount Herzl Military cemetery in Jerusalem on April 4, 2019. (Hadas Parush/Flash90)\n“The families of the hostages would like to extend a big hug to the Feldman family and to every family that is privileged to bring their loved one to burial,” the forum said in a statement.\n“The return of Zvi Feldman is a moral, ethical and national reminder to the prime minister and members of the government — a grave is not a privilege, but a basic duty of the state to its citizens and fighters. In Israel, no one is left behind,” it said.\n“As a society, we must not normalize a situation in which families have to wait over 40 years or more to be reunited with their loved ones,” it said.\nTerror groups in the Gaza Strip are holding 59 hostages, including 58 of the 251 abducted by Hamas-led terrorists on October 7, 2023. They include the bodies of at least 35 confirmed dead by the IDF, one of whom is a soldier killed a decade ago. Israel has said there are grave concerns for the lives of a further three."}
{"website": null, "url": null, "link": "https://www.timesofisrael.com/purge-of-hezbollah-from-beirut-airport-satisfying-israeli-us-officials-report/", "title": "Purge of Hezbollah from Beirut airport satisfying Israeli, US officials — report", "media_type": "article", "date": "Today, 12:28 pm", "content": "Lebanon has conducted a major overhaul of security at its sole international airport, in Beirut, to prevent smuggling by Hezbollah, satisfying Israeli and US officials and giving them hope that the government will take full control over the country’s ports of entry from the terror group, according to a new report.\nAirport staff linked to Hezbollah have been fired, smugglers have been detained, and new surveillance mechanisms using AI are being deployed at Rafik Hariri International Airport, which is situated in an area of southern Beirut that is controlled by the Iran-backed terror group, The Wall Street Journal reported Saturday.\nIn one recent achievement, Lebanese security thwarted an attempt to smuggle over 22 kilograms (50 pounds) of gold to Hezbollah through the airport, a senior security official told the newspaper.\n“You can feel the difference,” Lebanese Prime Minister Nawaf Salam said. “We’re doing better on smuggling for the first time in the contemporary history of Lebanon.”\nSalam, who was appointed by Lebanon’s new president in January, was also cited as saying that Hezbollah had tried to block plans to construct a second airport for commercial and cargo flights in an area outside the terror group’s control, near the Syrian border in northern Lebanon. The second airport could also serve as an alternative should the Beirut airport be shuttered due to Israeli attacks on Hezbollah targets there, the newspaper said.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nWhile Israeli and US officials reportedly felt there was still work to be done in Lebanon, a senior US official told the newspaper that “there is reason for hope here.”\nA Lebanese army officer shows Lebanese Prime Minister Nawaf Salam, center, an Israeli military position on the horizon, in the southern village of Khiam, February 28, 2025. (Rabih Daher / AFP)\nThe official, who works for the mechanism overseeing the implementation of the November 27 Israel-Hezbollah ceasefire agreement, said “it has only been six or seven months, and we have stepped to a place that I am not sure I thought was achievable back in November.”\nSenior Lebanese security and military officials cited by the Journal said no planes are now exempt from security checks, while flights from Iran have been suspended since February.\nADVERTISEMENT\nThe suspension, triggered by an IDF claim that Iran was smuggling cash to Hezbollah aboard civilian flights, set off massive riots by supporters of the terror group who demanded Iranian flights be let in. At one point, rioters attacked a convoy led by a top officer from the international peacekeeping force UNIFIL, wounding him.\nMeanwhile, the IDF has continued to target Hezbollah operatives and arms caches in southern Lebanon, and maintains some posts in the region after withdrawing from most of it in February.\nThe terror group was required to vacate the area under the November 27 ceasefire agreement, to be replaced by Lebanon’s military and UNIFIL. Last month, an official said the Lebanese military had dismantled over 90% of Hezbollah’s infrastructure near the border with Israel.\nFire from burning tires burns as Hezbollah supporters face off with Lebanese soldiers during a Hezbollah-organized riot to block the road to the airport in Beirut, Lebanon, February 15, 2025. (Ibrahim Amro / AFP)\nIbrahim Mousawi, a Hezbollah member of Lebanon’s parliament, told the Journal that while the terror group sustained heavy losses, it had ways to rearm, saying, “Where there is a will, there is a way.” He also said allegations that Hezbollah controlled the airport were exaggerated: “We are part of the system, just like any other Lebanese constituency.”\nHowever, Lebanon’s former deputy prime minister Ghassan Hasbani said the airport had been “a main port of entry for supporting whatever para-state activities were happening.”\nHasbani, who now represents an anti-Hezbollah bloc in the Lebanese parliament, said authorities had turned “a purposeful blind eye” to the terror group’s use of the Beirut airport. “In the absence of international attention and pressure to do something about it, nothing much was done.”\nADVERTISEMENT\nHezbollah’s standing in domestic politics has taken a blow in the wake of the fighting that began when the terror group attacked Israel on October 8, 2023 — a day after fellow Iran-backed group Hamas stormed southern Israel to kill some 1,200 people and take 251 hostages, sparking the war in Gaza.\nSome 60,000 residents of northern Israel were displaced by Hezbollah’s near-daily attacks. In a bid to secure the residents’ return, the IDF stepped up operations in Lebanon in September, decimating Hezbollah’s leadership.\nView of a large fire caused by rockets fired from Lebanon, in the northern town of Kiryat Shmona, June 3, 2024. (Ayal Margolin/Flash90)\nThe fighting killed thousands of people, according to Lebanon’s health ministry, which does not distinguish between combatants and civilians. The IDF estimated it had killed some 3,500 Hezbollah operatives.\nHezbollah also took a hit with the ouster in December of its powerful ally in Syria, the Iran-backed president Bashar al-Assad. The ouster cut off a land route for arms smuggling from Iran to Lebanon.\nIn January, Lebanon’s parliament elected US-backed President Joseph Aoun, ending a two-year vacancy in the post. Aoun, previously the commander of Lebanon’s armed forces, has vowed to maintain a state monopoly on arms — a veiled threat against Hezbollah, the only armed group not to surrender its arms to the Lebanese state when the country’s 15-year civil war ended in 1990. Aoun has also demanded that Israel vacate its remaining posts in southern Lebanon."}
{"website": null, "url": null, "link": "https://www.timesofisrael.com/israel-attacks-yemens-hodeidah-houthi-interior-ministry-says/", "title": "IDF issues ‘urgent’ evacuation warning for three Houthi-controlled ports in Yemen", "media_type": "article", "date": "Today, 10:38 pm", "content": "The Israel Defense Forces on Sunday evening issued an “urgent” evacuation warning to the three Houthi-controlled ports in western Yemen, ahead of potential Israeli strikes.\nThe warning came after the Houthis fired several ballistic missiles and drones at Israel in recent days, since the Israeli Air Force struck the Houthi-controlled airport in Sanaa and several other facilities last week.\nIn a post on X, the IDF’s Arabic-language spokesman Col. Avichay Adraee warned those at the Ras Isa, Hodeidah, and Salif ports on the western coast to evacuate.\n00:00 / 23:33\n“Due to the Houthi terror regime’s use of ports for its terror activities, we urge all those present at these ports to evacuate and stay away from them for your own safety until further notice,” he said.\nA report by Reuters, citing the Houthi interior ministry, claimed that Israel targeted Hodeidah port following the warning. Israeli military sources said no strikes had been carried out as of Sunday night. There were no reports in Houthi media of strikes either.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nOn Friday afternoon, the Houthis fired a ballistic missile that triggered sirens across central Israel. The IDF reported that the missile was successfully intercepted by air defenses.\nDefense Minister Israel Katz warned then that Israel would respond. “The Houthis continue to launch Iranian missiles at Israel. As we promised, we will respond, strongly in Yemen and anywhere else necessary,” he said in a statement.\nThe Friday attack came three days after the US announced that it had reached a ceasefire with the Yemeni terror group.\nHouthi officials made clear that the deal, in which they agreed to stop targeting US maritime activity in the Red Sea in exchange for an end to weeks of intense US airstrikes, did not include any agreement to stop firing at Israel or ships linked to the Jewish state.\nOn Wednesday, the IDF said a missile fired by the Houthis crashed outside Israeli territory. Earlier in the day, the IDF said it had downed a drone launched from Yemen.\nADVERTISEMENT\nThe attacks came after Israel carried out two days of heavy sorties targeting infrastructure controlled by the Houthis in response to the missile that struck Ben Gurion Airport. The fiery reprisals destroyed the international airport in the capital Sanaa, and caused heavy damage to a port in Hodeida and several power stations and a cement factory, officials said.\nThe Houthis — whose slogan calls for “Death to America, Death to Israel, [and] a Curse on the Jews” — first began attacking Israel and maritime traffic in November 2023, a month after the October 7 Hamas massacre.\nThe Houthis held their fire when a ceasefire was reached between Israel and Hamas in January 2025. By that point, they had fired over 40 ballistic missiles and dozens of attack drones and cruise missiles at Israel, including one that killed a civilian and wounded several others in Tel Aviv in July, prompting Israel’s first strike in Yemen.\nSince March 18, when the IDF resumed its offensive against Hamas in the Gaza Strip, the Houthis have launched some 29 ballistic missiles and at least 10 drones at Israel.\nThe sirens warning of missile attacks have sent hundreds of thousands of Israelis rushing to shelters at all hours of the day and night."}
{"website": null, "url": null, "link": "https://www.timesofisrael.com/body-of-soldier-zvi-feldman-missing-for-43-years-recovered-by-mossad-and-idf/", "title": "Body of soldier Zvi Feldman, missing for 43 years, recovered from Syria by Mossad, IDF", "media_type": "article", "date": "Today, 11:14 am", "content": "The Mossad spy agency and the Israel Defense Forces recovered the remains of Sgt. First Class Zvi Feldman, who went missing in the First Lebanon War’s battle of Sultan Yacoub in 1982, officials announced on Sunday.\nThe battle, nearly 43 years ago, was a skirmish between the IDF and the Syrian army in Lebanon’s Beqaa Valley. It claimed the lives of 21 Israeli servicemen, and more than 30 were injured during it.\nFeldman, a tank soldier, went missing during the battle along with Sgt. First Class Yehuda Katz and Sgt. First Class Zachary Baumel. Baumel’s remains were recovered and returned to Israel in 2019.\n00:00 / 23:33\nIn a joint statement on Sunday, the Mossad and IDF said the body of Feldman was recovered from “the heart of Syria” in a special operation.\nThey said the “complex and covert operation” was made possible by “precise intelligence” and other capabilities, including “intelligence research and collection efforts and many activities and operations in enemy territory.”\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nThe military said the efforts to locate the body had been ongoing for decades.\nThis image released by the IDF on May 11, 2025, shows troops carrying a coffin containing the remains of Sgt. First Class Zvi Feldman, who went missing in 1982. (Israel Defense Forces)\nDefense officials said the operation to recover the remains was carried out by non-Israeli Mossad agents. The team operated deep inside Syria, dozens of kilometers from the Israeli border, to retrieve the body, while risking their lives.\nThe agents, operating on behalf of Mossad, had a cover story and had been inside Syria for several years. In the past five months, following the fall of the Bashar al-Assad regime, there were breakthroughs in the case and an opportunity to recover Feldman’s remains, the officials said.\nADVERTISEMENT\nOfficials said the team operated “under fire” during the mission, as they visited a graveyard several times, obtaining various findings that were sent to Israel for identification. Eventually findings matched Feldman’s DNA.\nThe team also found the tank soldier’s overalls, which were identified by the head of the Intelligence Directorate’s missing persons unit, who himself served in the Armored Corps in his youth.\nPrime Minister Benjamin Netanyahu informs relatives of Sgt. First Class Zvi Feldman that his body was recovered, May 11, 2025 (Kobi Gideon/GPO)\nThe remains belonging to Feldman — which were in a complex state due to the passage of time — and his overalls were brought to Israel for identification some two weeks ago. Feldman’s family was notified early Sunday once the identification process was completed.\nA video released by the IDF on Sunday showed the moment the remains were returned to Israel. The clip showed a coffin draped in an Israeli flag, as troops recited the mourner’s Kaddish, the Jewish prayer for the dead.\nThis video released by the IDF on May 11, 2025, shows troops reciting the Jewish prayer for the dead upon receiving the remains of Sgt. First Class Zvi Feldman, who went missing in 1982. (Israel Defense Forces)\n“For decades, Zvika was missing, and the efforts to locate him, along with the other missing soldiers from that same battle, never ceased for a moment,” Prime Minister Benjamin Netanyahu said in a statement.\nThe Mossad, IDF, Netanyahu, and Defense Minister Israel Katz all said Israel would not stop its efforts until the remains of Katz are also returned.\nADVERTISEMENT\n“Just as we returned Zachary Baumel, and today Zvi Feldman, we continue to act in every way to also return Sgt. First Class Yehuda Katz and fulfill our duty for him and his family,” the defense minister said.\nFrom left: Zachary Baumel, Yehuda Katz and Zvi Feldman (Courtesy)\nBaumel’s body was recovered with Russian assistance from the Yarmouk refugee camp, home to one of the largest Palestinian communities in Syria. In 2016, an Israeli tank lost in the battle was returned to Israel by Russia.\nThe IDF has been deployed to nine posts inside southern Syria since the fall of the Bashar al-Assad regime in December, mostly within a UN-patrolled buffer zone on the border between the countries.\nTroops have been operating in areas up to around 15 kilometers (9 miles) deep into Syria, aiming to capture weapons that Israel says could pose a threat to the country if they fall into the hands of “hostile forces.”\nThe Hostages Forum, which represents the majority of relatives of those held captive in Gaza, welcomes the return of Feldman’s body, while calling for the return of the remaining hostages, living and dead.\nIsraeli soldiers carry the coffin of Zachary Baumel at the Mount Herzl Military cemetery in Jerusalem on April 4, 2019. (Hadas Parush/Flash90)\n“The families of the hostages would like to extend a big hug to the Feldman family and to every family that is privileged to bring their loved one to burial,” the forum said in a statement.\n“The return of Zvi Feldman is a moral, ethical and national reminder to the prime minister and members of the government — a grave is not a privilege, but a basic duty of the state to its citizens and fighters. In Israel, no one is left behind,” it said.\n“As a society, we must not normalize a situation in which families have to wait over 40 years or more to be reunited with their loved ones,” it said.\nTerror groups in the Gaza Strip are holding 59 hostages, including 58 of the 251 abducted by Hamas-led terrorists on October 7, 2023. They include the bodies of at least 35 confirmed dead by the IDF, one of whom is a soldier killed a decade ago. Israel has said there are grave concerns for the lives of a further three."}
{"website": null, "url": null, "link": "https://www.timesofisrael.com/purge-of-hezbollah-from-beirut-airport-satisfying-israeli-us-officials-report/", "title": "Purge of Hezbollah from Beirut airport satisfying Israeli, US officials — report", "media_type": "article", "date": "Today, 12:28 pm", "content": "Lebanon has conducted a major overhaul of security at its sole international airport, in Beirut, to prevent smuggling by Hezbollah, satisfying Israeli and US officials and giving them hope that the government will take full control over the country’s ports of entry from the terror group, according to a new report.\nAirport staff linked to Hezbollah have been fired, smugglers have been detained, and new surveillance mechanisms using AI are being deployed at Rafik Hariri International Airport, which is situated in an area of southern Beirut that is controlled by the Iran-backed terror group, The Wall Street Journal reported Saturday.\nIn one recent achievement, Lebanese security thwarted an attempt to smuggle over 22 kilograms (50 pounds) of gold to Hezbollah through the airport, a senior security official told the newspaper.\n“You can feel the difference,” Lebanese Prime Minister Nawaf Salam said. “We’re doing better on smuggling for the first time in the contemporary history of Lebanon.”\nSalam, who was appointed by Lebanon’s new president in January, was also cited as saying that Hezbollah had tried to block plans to construct a second airport for commercial and cargo flights in an area outside the terror group’s control, near the Syrian border in northern Lebanon. The second airport could also serve as an alternative should the Beirut airport be shuttered due to Israeli attacks on Hezbollah targets there, the newspaper said.\nGet The Times of Israel's Daily Edition\nby email and never miss our top stories\nNewsletter email address\nGET IT\nBy signing up, you agree to the terms\nWhile Israeli and US officials reportedly felt there was still work to be done in Lebanon, a senior US official told the newspaper that “there is reason for hope here.”\nA Lebanese army officer shows Lebanese Prime Minister Nawaf Salam, center, an Israeli military position on the horizon, in the southern village of Khiam, February 28, 2025. (Rabih Daher / AFP)\nThe official, who works for the mechanism overseeing the implementation of the November 27 Israel-Hezbollah ceasefire agreement, said “it has only been six or seven months, and we have stepped to a place that I am not sure I thought was achievable back in November.”\nSenior Lebanese security and military officials cited by the Journal said no planes are now exempt from security checks, while flights from Iran have been suspended since February.\nADVERTISEMENT\nThe suspension, triggered by an IDF claim that Iran was smuggling cash to Hezbollah aboard civilian flights, set off massive riots by supporters of the terror group who demanded Iranian flights be let in. At one point, rioters attacked a convoy led by a top officer from the international peacekeeping force UNIFIL, wounding him.\nMeanwhile, the IDF has continued to target Hezbollah operatives and arms caches in southern Lebanon, and maintains some posts in the region after withdrawing from most of it in February.\nThe terror group was required to vacate the area under the November 27 ceasefire agreement, to be replaced by Lebanon’s military and UNIFIL. Last month, an official said the Lebanese military had dismantled over 90% of Hezbollah’s infrastructure near the border with Israel.\nFire from burning tires burns as Hezbollah supporters face off with Lebanese soldiers during a Hezbollah-organized riot to block the road to the airport in Beirut, Lebanon, February 15, 2025. (Ibrahim Amro / AFP)\nIbrahim Mousawi, a Hezbollah member of Lebanon’s parliament, told the Journal that while the terror group sustained heavy losses, it had ways to rearm, saying, “Where there is a will, there is a way.” He also said allegations that Hezbollah controlled the airport were exaggerated: “We are part of the system, just like any other Lebanese constituency.”\nHowever, Lebanon’s former deputy prime minister Ghassan Hasbani said the airport had been “a main port of entry for supporting whatever para-state activities were happening.”\nHasbani, who now represents an anti-Hezbollah bloc in the Lebanese parliament, said authorities had turned “a purposeful blind eye” to the terror group’s use of the Beirut airport. “In the absence of international attention and pressure to do something about it, nothing much was done.”\nADVERTISEMENT\nHezbollah’s standing in domestic politics has taken a blow in the wake of the fighting that began when the terror group attacked Israel on October 8, 2023 — a day after fellow Iran-backed group Hamas stormed southern Israel to kill some 1,200 people and take 251 hostages, sparking the war in Gaza.\nSome 60,000 residents of northern Israel were displaced by Hezbollah’s near-daily attacks. In a bid to secure the residents’ return, the IDF stepped up operations in Lebanon in September, decimating Hezbollah’s leadership.\nView of a large fire caused by rockets fired from Lebanon, in the northern town of Kiryat Shmona, June 3, 2024. (Ayal Margolin/Flash90)\nThe fighting killed thousands of people, according to Lebanon’s health ministry, which does not distinguish between combatants and civilians. The IDF estimated it had killed some 3,500 Hezbollah operatives.\nHezbollah also took a hit with the ouster in December of its powerful ally in Syria, the Iran-backed president Bashar al-Assad. The ouster cut off a land route for arms smuggling from Iran to Lebanon.\nIn January, Lebanon’s parliament elected US-backed President Joseph Aoun, ending a two-year vacancy in the post. Aoun, previously the commander of Lebanon’s armed forces, has vowed to maintain a state monopoly on arms — a veiled threat against Hezbollah, the only armed group not to surrender its arms to the Lebanese state when the country’s 15-year civil war ended in 1990. Aoun has also demanded that Israel vacate its remaining posts in southern Lebanon."}
